-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_cr_analysis_dataset.log
  log type:  text
 opened on:   8 Dec 2021, 14:46:23

. 
. 
. *Import dataset into STATA
. import delimited "output/input", clear
(62 vars, 30,000 obs)

. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates and TPP case outcome dates are given with month only, so addi
> ng day 
> 15 to enable  them to be processed as dates                                  
>                                                      */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(29,837 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(1,207 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(125 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 dialysis                     
>                    ///
>                                                 kidney_transplant            
>            ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 dereg_date  ///
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable diabetes was str7 now str10
(30,000 real changes made)
(28,505 real changes made)
(28,505 missing values generated)
variable cancer_haem was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable cancer_nonhaem was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable dialysis was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable kidney_transplant was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable other_transplant was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable asplenia was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable chronic_liver_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable other_neuro was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable stroke_dementia was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable esrf was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable hypertension was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable bmi_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable bp_sys_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable bp_dias_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable creatinine_date was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable smoking_status_date was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable dereg_date was str7 now str10
(30,000 real changes made)
(29,872 real changes made)
(29,872 missing values generated)

. 
. * Recode to dates from the strings 
. foreach var of varlist  positive_covid_test covid_test_ever     ///
> covid_tpp_codes_clinical covid_tpp_codes_test covid_tpp_codes_seq ///
> died_date_ons covid_admission_date covid_tpp_probable ///
> covid_vacc_date  covid_vacc_second_dose_date    {
  2.                                                 
.         confirm string variable `var'
  3.         rename `var' `var'_dstr
  4.         gen `var' = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var' %td        
  7. }
(24,000 missing values generated)
(24,000 missing values generated)
(15,000 missing values generated)
(15,000 missing values generated)
(15,000 missing values generated)
(5,999 missing values generated)
(16,109 missing values generated)
(1,500 missing values generated)
(15,000 missing values generated)
(24,000 missing values generated)

. 
. *Amend vaccine dates
. replace covid_vacc_second_dose_date=. if covid_vacc_date>=covid_vacc_second_d
> ose_date
(5,433 real changes made, 5,433 to missing)

. replace covid_vacc_second_dose_date=. if covid_vacc_date==. 
(0 real changes made)

. 
. gen covid_admission_primary_date = covid_admission_date ///
> if (covid_admission_primary_diagnosi == "U071"| covid_admission_primary_diagn
> osi == "U072")
(23,125 missing values generated)

. 
. gen  covid_primary_care_codes_only=covid_tpp_probable
(1,500 missing values generated)

. format covid_primary_care_codes_only %td

. replace covid_tpp_probable=positive_covid_test_ever if covid_tpp_probable==. 
> & covid_tpp_probable>positive_covid_test
(302 real changes made)

. 
. 
. /*Tab all variables in initial extract*/
. sum, d f

                       dereg_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15dec2020      15dec2020
 5%    15jan2021      15dec2020
10%    15jan2021      15dec2020       Obs                 128
25%    15mar2021      15dec2020       Sum of Wgt.         128

50%    30may2021                      Mean          31may2021
                        Largest       Std. Dev.      103.5504
75%    15aug2021      15dec2021
90%    15nov2021      15dec2021       Variance       10722.69
95%    15nov2021      15dec2021       Skewness       .2062229
99%    15dec2021      15dec2021       Kurtosis       1.904231

                       ethnicity_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%         1970           1970
 5%         1972           1970
10%         1975           1970       Obs              27,001
25%         1982           1970       Sum of Wgt.      27,001

50%         1995                      Mean           1995.304
                        Largest       Std. Dev.      14.96932
75%         2008           2021
90%         2016           2021       Variance       224.0804
95%         2019           2021       Skewness       .0099501
99%         2021           2021       Kurtosis       1.799202

                   bmi_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2015      15feb2015
 5%    15jun2015      15feb2015
10%    15oct2015      15feb2015       Obs              28,500
25%    15oct2016      15feb2015       Sum of Wgt.      28,500

50%    15jun2018                      Mean          28jun2018
                        Largest       Std. Dev.       722.103
75%    15mar2020      15dec2021
90%    15apr2021      15dec2021       Variance       521432.8
95%    15aug2021      15dec2021       Skewness        .020531
99%    15nov2021      15dec2021       Kurtosis       1.796383

                  bp_sys_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jul1972      15jan1970
10%    15jan1975      15jan1970       Obs              28,500
25%    15sep1982      15jan1970       Sum of Wgt.      28,500

50%    15may1995                      Mean          15may1995
                        Largest       Std. Dev.       5361.07
75%    15jan2008      15dec2020
90%    15aug2015      15dec2020       Variance       2.87e+07
95%    15may2018      15dec2020       Skewness       .0045787
99%    15may2020      15dec2020       Kurtosis       1.798227

                 bp_dias_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jul1972      15jan1970
10%    15mar1975      15jan1970       Obs              28,500
25%    15sep1982      15jan1970       Sum of Wgt.      28,500

50%    15jun1995                      Mean          02jul1995
                        Largest       Std. Dev.      5371.163
75%    15mar2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.88e+07
95%    15jun2018      15dec2020       Skewness       .0016214
99%    15jun2020      15dec2020       Kurtosis       1.798917

                    creatinine_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15mar2019      15mar2019
 5%    15apr2019      15mar2019
10%    15may2019      15mar2019       Obs              28,500
25%    15aug2019      15mar2019       Sum of Wgt.      28,500

50%    15jan2020                      Mean          22jan2020
                        Largest       Std. Dev.      190.0419
75%    15jul2020      15dec2020
90%    15oct2020      15dec2020       Variance       36115.92
95%    15nov2020      15dec2020       Skewness       .0063631
99%    15dec2020      15dec2020       Kurtosis       1.805345

                  smoking_status_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15sep1972      15jan1970
10%    15mar1975      15jan1970       Obs              28,500
25%    15oct1982      15jan1970       Sum of Wgt.      28,500

50%    15may1995                      Mean          23jun1995
                        Largest       Std. Dev.      5347.031
75%    15feb2008      15dec2020
90%    15oct2015      15dec2020       Variance       2.86e+07
95%    15may2018      15dec2020       Skewness       .0021483
99%    15jun2020      15dec2020       Kurtosis       1.804492

              chronic_respiratory_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug1970      15jan1970
 5%    15aug1972      15jan1970
10%    15feb1975      15jan1970       Obs               6,000
25%    15aug1982      15jan1970       Sum of Wgt.       6,000

50%    15jun1995                      Mean          29may1995
                        Largest       Std. Dev.      5384.666
75%    15may2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.90e+07
95%    15apr2018      15dec2020       Skewness       .0099664
99%    30jun2020      15dec2020       Kurtosis       1.782032

                chronic_cardiac_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15feb1972      15jan1970
10%    15aug1974      15jan1970       Obs               6,000
25%    15jun1982      15jan1970       Sum of Wgt.       6,000

50%    15may1995                      Mean          07apr1995
                        Largest       Std. Dev.      5410.059
75%    15dec2007      15dec2020
90%    15sep2015      15dec2020       Variance       2.93e+07
95%    15jul2018      15dec2020       Skewness       .0077804
99%    15jun2020      15dec2020       Kurtosis       1.798806

                   hba1c_mmol_per_mol_date
-------------------------------------------------------------
no observations

                    hba1c_percentage_date
-------------------------------------------------------------
no observations

                      cancer_haem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15sep1972      15jan1970
10%    15feb1975      15jan1970       Obs               6,000
25%    15nov1982      15jan1970       Sum of Wgt.       6,000

50%    15jan1996                      Mean          01sep1995
                        Largest       Std. Dev.      5379.406
75%    15jun2008      15dec2020
90%    30dec2015      15dec2020       Variance       2.89e+07
95%    30jun2018      15dec2020       Skewness      -.0273309
99%    15jul2020      15dec2020       Kurtosis        1.80716

                     cancer_nonhaem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jul1972      15jan1970
10%    15apr1975      15jan1970       Obs               6,000
25%    15feb1983      15jan1970       Sum of Wgt.       6,000

50%    15nov1995                      Mean          05oct1995
                        Largest       Std. Dev.      5371.764
75%    15sep2008      15dec2020
90%    15dec2015      15dec2020       Variance       2.89e+07
95%    15apr2018      15dec2020       Skewness      -.0231941
99%    15jun2020      15dec2020       Kurtosis       1.792303

               permanent_immunodeficiency_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug1970      15jan1970
 5%    15oct1972      15jan1970
10%    15may1975      15jan1970       Obs               6,000
25%    15nov1982      15jan1970       Sum of Wgt.       6,000

50%    15apr1995                      Mean          27jun1995
                        Largest       Std. Dev.      5355.509
75%    15mar2008      15dec2020
90%    15feb2016      15dec2020       Variance       2.87e+07
95%    15apr2018      15dec2020       Skewness       .0257118
99%    30jun2020      15dec2020       Kurtosis       1.802629

                        asplenia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15sep1972      15jan1970
10%    15apr1975      15jan1970       Obs               6,000
25%    15oct1982      15jan1970       Sum of Wgt.       6,000

50%    30jun1995                      Mean          17jun1995
                        Largest       Std. Dev.      5363.459
75%    15apr2008      15dec2020
90%    15sep2015      15dec2020       Variance       2.88e+07
95%    15jun2018      15dec2020       Skewness       .0005144
99%    15jul2020      15dec2020       Kurtosis       1.799423

               temporary_immunodeficiency_date
-------------------------------------------------------------
no observations

                 chronic_liver_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15may1970      15jan1970
 5%    15jun1972      15jan1970
10%    15mar1975      15jan1970       Obs               6,000
25%    15sep1982      15jan1970       Sum of Wgt.       6,000

50%    15feb1995                      Mean          03may1995
                        Largest       Std. Dev.      5368.044
75%    15apr2008      15dec2020
90%    15jul2015      15dec2020       Variance       2.88e+07
95%    15mar2018      15dec2020       Skewness       .0099216
99%    15may2020      15dec2020       Kurtosis       1.788651

                    stroke_dementia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15aug1972      15jan1970
10%    15dec1974      15jan1970       Obs               6,000
25%    15jun1982      15jan1970       Sum of Wgt.       6,000

50%    15jul1995                      Mean          04may1995
                        Largest       Std. Dev.      5393.308
75%    15nov2007      15nov2020
90%    15jan2016      15dec2020       Variance       2.91e+07
95%    15may2018      15dec2020       Skewness       .0197515
99%    15jun2020      15dec2020       Kurtosis       1.798263

                      other_neuro_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jun1972      15jan1970
10%    15dec1974      15jan1970       Obs               6,000
25%    15sep1982      15jan1970       Sum of Wgt.       6,000

50%    15aug1995                      Mean          13jul1995
                        Largest       Std. Dev.      5398.463
75%    15may2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.91e+07
95%    15jun2018      15dec2020       Skewness      -.0105226
99%    15jul2020      15dec2020       Kurtosis       1.789213

                          esrf_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15aug1972      15jan1970
10%    15apr1975      15jan1970       Obs               6,000
25%    15jun1983      15jan1970       Sum of Wgt.       6,000

50%    15oct1995                      Mean          04sep1995
                        Largest       Std. Dev.      5327.358
75%    15mar2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.84e+07
95%    15apr2018      15dec2020       Skewness       -.021767
99%    30jun2020      15dec2020       Kurtosis       1.822079

                        dialysis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15may1972      15jan1970
10%    30jan1975      15jan1970       Obs               6,000
25%    15jul1982      15jan1970       Sum of Wgt.       6,000

50%    15jun1995                      Mean          30may1995
                        Largest       Std. Dev.      5384.623
75%    15feb2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.90e+07
95%    15may2018      15dec2020       Skewness       .0021146
99%    15may2020      15dec2020       Kurtosis       1.796232

                   kidney_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug1970      15jan1970
 5%    15oct1972      15jan1970
10%    15may1975      15jan1970       Obs               6,000
25%    15dec1982      15jan1970       Sum of Wgt.       6,000

50%    15nov1995                      Mean          10aug1995
                        Largest       Std. Dev.      5355.585
75%    15may2008      15dec2020
90%    15dec2015      15dec2020       Variance       2.87e+07
95%    15jun2018      15dec2020       Skewness      -.0014621
99%    15jun2020      15dec2020       Kurtosis       1.799953

                    other_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug1970      15jan1970
 5%    30nov1972      15jan1970
10%    15may1975      15jan1970       Obs               6,000
25%    15mar1983      15feb1970       Sum of Wgt.       6,000

50%    15jan1996                      Mean          12nov1995
                        Largest       Std. Dev.      5344.886
75%    30aug2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.86e+07
95%    15jun2018      15dec2020       Skewness      -.0295307
99%    15jul2020      15dec2020       Kurtosis       1.806422

                      hypertension_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15aug1972      15jan1970
10%    15apr1975      15jan1970       Obs               6,000
25%    15mar1983      15jan1970       Sum of Wgt.       6,000

50%    15oct1995                      Mean          17dec1995
                        Largest       Std. Dev.      5472.346
75%    15mar2009      15nov2021
90%    15aug2016      15nov2021       Variance       2.99e+07
95%    15may2019      15dec2021       Skewness       .0105782
99%    15may2021      15dec2021       Kurtosis       1.798144

                    ra_sle_psoriasis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    30jun1970      15jan1970
 5%    15mar1972      15jan1970
10%    30jul1974      15jan1970       Obs               6,000
25%    15may1982      15jan1970       Sum of Wgt.       6,000

50%    15aug1995                      Mean          26may1995
                        Largest       Std. Dev.      5413.855
75%    15mar2008      15dec2020
90%    15oct2015      15dec2020       Variance       2.93e+07
95%    30may2018      15dec2020       Skewness      -.0223311
99%    15jun2020      15dec2020       Kurtosis       1.794568

                     has_12_m_follow_up
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           .5              0
10%            1              0       Obs              30,000
25%            1              0       Sum of Wgt.      30,000

50%            1                      Mean                .95
                        Largest       Std. Dev.      .2179486
75%            1              1
90%            1              1       Variance       .0475016
95%            1              1       Skewness      -4.129483
99%            1              1       Kurtosis       18.05263

                   died_ons_covid_flag_any
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              30,000
25%            0              0       Sum of Wgt.      30,000

50%            1                      Mean                 .6
                        Largest       Std. Dev.      .4899061
75%            1              1
90%            1              1       Variance        .240008
95%            1              1       Skewness      -.4082483
99%            1              1       Kurtosis       1.166667

               died_ons_covid_flag_underlying
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              30,000
25%            0              0       Sum of Wgt.      30,000

50%            1                      Mean                 .6
                        Largest       Std. Dev.      .4899061
75%            1              1
90%            1              1       Variance        .240008
95%            1              1       Skewness      -.4082483
99%            1              1       Kurtosis       1.166667

              covid_admission_primary_diagnosis
-------------------------------------------------------------
no observations

                            sgtf
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              27,042
25%            0              0       Sum of Wgt.      27,042

50%            1                      Mean           1.441794
                        Largest       Std. Dev.      2.714684
75%            1              9
90%            9              9       Variance       7.369509
95%            9              9       Skewness       2.331043
99%            9              9       Kurtosis       6.718219

                           lft_pcr
-------------------------------------------------------------
no observations

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              30,000
25%           21              0       Sum of Wgt.      30,000

50%           40                      Mean           40.24737
                        Largest       Std. Dev.      23.73263
75%           58            106
90%           73            107       Variance       563.2376
95%           80            107       Skewness       .1450028
99%           89            109       Kurtosis          2.059

                             sex
-------------------------------------------------------------
no observations

                             imd
-------------------------------------------------------------
      Percentiles      Smallest
 1%          100            100
 5%          100            100
10%          200            100       Obs              30,000
25%          200            100       Sum of Wgt.      30,000

50%          300                      Mean           260.2033
                        Largest       Std. Dev.      66.22717
75%          300            300
90%          300            300       Variance       4386.038
95%          300            300       Skewness       -1.40572
99%          300            300       Kurtosis       3.634523

                             stp
-------------------------------------------------------------
no observations

                          ethnicity
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs              27,001
25%            1              1       Sum of Wgt.      27,001

50%            1                      Mean           1.606866
                        Largest       Std. Dev.      1.286222
75%            1              5
90%            5              5       Variance       1.654366
95%            5              5       Skewness       1.901194
99%            5              5       Kurtosis       5.076136

                        household_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%          541            170
 5%          675            203
10%          744            225       Obs              30,000
25%          864            272       Sum of Wgt.      30,000

50%         1000                      Mean           999.4844
                        Largest       Std. Dev.      198.6574
75%         1134           1744
90%         1256           1773       Variance       39464.77
95%         1326           1780       Skewness       .0046835
99%         1455           1827       Kurtosis       2.943798

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              30,000
25%            2              0       Sum of Wgt.      30,000

50%            2                      Mean           2.491567
                        Largest       Std. Dev.      1.036097
75%            3              6
90%            4              6       Variance       1.073498
95%            4              6       Skewness       .0308857
99%            5              7       Kurtosis       2.845417

                       care_home_type
-------------------------------------------------------------
no observations

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0       -14.4876
 5%            0      -13.12482
10%     8.682671      -12.56922       Obs              30,000
25%     16.89569      -11.78916       Sum of Wgt.      30,000

50%     24.33182                      Mean           23.67631
                        Largest       Std. Dev.      11.18529
75%     31.23835        60.3127
90%     37.45248       61.03738       Variance       125.1107
95%     41.12461       61.38228       Skewness      -.2310492
99%     48.08316       66.78109       Kurtosis       2.923952

                           bp_sys
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     41.22729              0
10%     103.8202              0       Obs              30,000
25%     111.9809              0       Sum of Wgt.      30,000

50%     119.3491                      Mean            114.009
                        Largest       Std. Dev.      27.91411
75%      126.385       160.5695
90%     132.5427       161.0372       Variance       779.1976
95%     136.1405       164.2268       Skewness      -3.318934
99%     143.0393       165.5279       Kurtosis       13.99686

                           bp_dias
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     19.22903              0
10%     63.74761              0       Obs              30,000
25%      72.0182              0       Sum of Wgt.      30,000

50%     79.45543                      Mean           76.08228
                        Largest       Std. Dev.      20.01961
75%     86.42573       117.1395
90%     92.64694       120.8408       Variance       400.7848
95%     96.41036       121.8661       Skewness      -2.594014
99%     103.0543       125.8075       Kurtosis       10.67108

                         creatinine
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0      -6.160084
 5%            0              0
10%     35.77135              0       Obs              30,000
25%     48.10664              0       Sum of Wgt.      30,000

50%     58.97501                      Mean           57.04424
                        Largest       Std. Dev.      19.62619
75%     69.48634       115.2666
90%      78.8409       115.3834       Variance       385.1874
95%     84.43868       115.4231       Skewness      -.9674991
99%     94.62052        117.181       Kurtosis       4.626442

                       smoking_status
-------------------------------------------------------------
no observations

                        diabetes_type
-------------------------------------------------------------
no observations

                     hba1c_mmol_per_mol
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -5.490139      -48.48341
 5%            0      -46.64746
10%     7.502495      -44.75081       Obs              30,000
25%     23.64163      -32.39259       Sum of Wgt.      30,000

50%     38.75146                      Mean           37.90907
                        Largest       Std. Dev.       21.3328
75%     52.48893       118.7955
90%     64.72919        118.854       Variance       455.0885
95%     72.13294       121.4914       Skewness      -.0381365
99%     86.34236        125.711       Kurtosis       2.776151

                      hba1c_percentage
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0      -2.583667
 5%            0      -2.287497
10%     1.737573      -2.083632       Obs              30,000
25%     3.354281      -1.854332       Sum of Wgt.      30,000

50%     4.854406                      Mean           4.729201
                        Largest       Std. Dev.      2.227846
75%     6.252398       12.72458
90%     7.469768       12.80076       Variance       4.963296
95%     8.208738       13.19589       Skewness      -.2136172
99%     9.578456       13.56721       Kurtosis         2.8939

                           asthma
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               6,000
25%            0              0       Sum of Wgt.       6,000

50%            0                      Mean           .6768333
                        Largest       Std. Dev.      .8932317
75%            2              2
90%            2              2       Variance       .7978629
95%            2              2       Skewness        .679276
99%            2              2       Kurtosis       1.598142

                         patient_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%         3319             46
 5%      15344.5            108
10%      30092.5            114       Obs              30,000
25%      75622.5            119       Sum of Wgt.      30,000

50%       149483                      Mean           149837.6
                        Largest       Std. Dev.      86355.82
75%       224625         299957
90%     269401.5         299980       Variance       7.46e+09
95%       285163         299981       Skewness       .0042012
99%       297165         299985       Kurtosis       1.810039

                        diabetes_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15sep1970      15jan1970
 5%    15feb1972      15jan1970
10%    15oct1974      15jan1970       Obs               1,495
25%    15may1982      15feb1970       Sum of Wgt.       1,495

50%    15dec1994                      Mean          07mar1995
                        Largest       Std. Dev.      5406.809
75%    15apr2008      15dec2020
90%    15jul2015      15dec2020       Variance       2.92e+07
95%    15jun2018      15dec2020       Skewness       .0194508
99%    15jun2020      15dec2020       Kurtosis        1.78427

                  positive_covid_test_ever
-------------------------------------------------------------
      Percentiles      Smallest
 1%    30jun2021      21feb2021
 5%    28aug2021      07mar2021
10%    20sep2021      11mar2021       Obs               6,000
25%    21oct2021      17mar2021       Sum of Wgt.       6,000

50%    15nov2021                      Mean          03nov2021
                        Largest       Std. Dev.         34.74
75%    29nov2021      08dec2021
90%    05dec2021      08dec2021       Variance       1206.867
95%    07dec2021      08dec2021       Skewness      -1.948276
99%    08dec2021      08dec2021       Kurtosis        8.36768

                       covid_test_ever
-------------------------------------------------------------
      Percentiles      Smallest
 1%    06jul2021      31jan2021
 5%    23aug2021      02apr2021
10%    19sep2021      05apr2021       Obs               6,000
25%    21oct2021      07apr2021       Sum of Wgt.       6,000

50%    14nov2021                      Mean          03nov2021
                        Largest       Std. Dev.      34.45176
75%    29nov2021      08dec2021
90%    05dec2021      08dec2021       Variance       1186.924
95%    07dec2021      08dec2021       Skewness      -1.833346
99%    08dec2021      08dec2021       Kurtosis       7.625425

                  covid_tpp_codes_clinical
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    07jan2021      21dec2020
10%    25jan2021      21dec2020       Obs              15,000
25%    20mar2021      21dec2020       Sum of Wgt.      15,000

50%    19jun2021                      Mean          16jun2021
                        Largest       Std. Dev.      101.9163
75%    13sep2021      08dec2021
90%    03nov2021      08dec2021       Variance       10386.93
95%    20nov2021      08dec2021       Skewness       -.040781
99%    05dec2021      08dec2021       Kurtosis       1.801534

                    covid_tpp_codes_test
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    06jan2021      21dec2020
10%    24jan2021      21dec2020       Obs              15,000
25%    17mar2021      21dec2020       Sum of Wgt.      15,000

50%    17jun2021                      Mean          14jun2021
                        Largest       Std. Dev.       102.407
75%    12sep2021      08dec2021
90%    03nov2021      08dec2021       Variance       10487.19
95%    21nov2021      08dec2021       Skewness      -.0145518
99%    05dec2021      08dec2021       Kurtosis        1.78703

                     covid_tpp_codes_seq
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    08jan2021      21dec2020
10%    26jan2021      21dec2020       Obs              15,000
25%    20mar2021      21dec2020       Sum of Wgt.      15,000

50%    17jun2021                      Mean          16jun2021
                        Largest       Std. Dev.      101.6542
75%    12sep2021      08dec2021
90%    03nov2021      08dec2021       Variance       10333.58
95%    21nov2021      08dec2021       Skewness      -.0164757
99%    05dec2021      08dec2021       Kurtosis        1.79846

                        died_date_ons
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    07jan2021      21dec2020
10%    25jan2021      21dec2020       Obs              24,001
25%    17mar2021      21dec2020       Sum of Wgt.      24,001

50%    14jun2021                      Mean          14jun2021
                        Largest       Std. Dev.      102.2376
75%    12sep2021      08dec2021
90%    03nov2021      08dec2021       Variance       10452.53
95%    21nov2021      08dec2021       Skewness       .0061079
99%    05dec2021      08dec2021       Kurtosis       1.788028

                    covid_admission_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      20dec2020
 5%    07jan2021      20dec2020
10%    24jan2021      20dec2020       Obs              13,891
25%    18mar2021      20dec2020       Sum of Wgt.      13,891

50%    16jun2021                      Mean          15jun2021
                        Largest       Std. Dev.      102.7564
75%    12sep2021      08dec2021
90%    05nov2021      08dec2021       Variance       10558.87
95%    22nov2021      08dec2021       Skewness      -.0079725
99%    05dec2021      08dec2021       Kurtosis       1.782455

                     covid_tpp_probable
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    07jan2021      21dec2020
10%    25jan2021      21dec2020       Obs              28,802
25%    20mar2021      21dec2020       Sum of Wgt.      28,802

50%    17jun2021                      Mean          16jun2021
                        Largest       Std. Dev.      102.4084
75%    14sep2021      08dec2021
90%    05nov2021      08dec2021       Variance       10487.48
95%    22nov2021      08dec2021       Skewness      -.0136791
99%    05dec2021      08dec2021       Kurtosis       1.789688

                       covid_vacc_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    11dec2020      09dec2020
 5%    19dec2020      09dec2020
10%    30dec2020      09dec2020       Obs              15,000
25%    02feb2021      09dec2020       Sum of Wgt.      15,000

50%    28mar2021                      Mean          28mar2021
                        Largest       Std. Dev.      63.61532
75%    23may2021      16jul2021
90%    24jun2021      16jul2021       Variance       4046.908
95%    05jul2021      16jul2021       Skewness      -.0052975
99%    14jul2021      16jul2021       Kurtosis       1.804966

                 covid_vacc_second_dose_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    18dec2020      12dec2020
 5%    25dec2020      13dec2020
10%    02jan2021      13dec2020       Obs                 567
25%    17jan2021      16dec2020       Sum of Wgt.         567

50%    06feb2021                      Mean          01feb2021
                        Largest       Std. Dev.      20.22378
75%    19feb2021      01mar2021
90%    25feb2021      01mar2021       Variance       409.0012
95%    28feb2021      01mar2021       Skewness      -.5942202
99%    01mar2021      01mar2021       Kurtosis       2.301732

                covid_admission_primary_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%        22272          22269
 5%        22286          22269
10%        22304          22269       Obs               6,875
25%        22356          22269       Sum of Wgt.       6,875

50%        22446                      Mean           22446.03
                        Largest       Std. Dev.      103.0071
75%        22535          22622
90%        22589          22622       Variance       10610.46
95%        22607          22622       Skewness      -.0036543
99%        22619          22622       Kurtosis       1.780314

                covid_primary_care_codes_only
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    07jan2021      21dec2020
10%    25jan2021      21dec2020       Obs              28,500
25%    19mar2021      21dec2020       Sum of Wgt.      28,500

50%    15jun2021                      Mean          15jun2021
                        Largest       Std. Dev.      101.8332
75%    12sep2021      08dec2021
90%    03nov2021      08dec2021       Variance          10370
95%    20nov2021      08dec2021       Skewness        -.00246
99%    05dec2021      08dec2021       Kurtosis       1.797991

. 
. 
. /*Flag earliest date under18s vaccinated*/
. gen under18vacc_temp=covid_vacc_date if age<18
(26,823 missing values generated)

. bysort household_id: egen under18vacc=min(under18vacc_temp)
(1823 missing values generated)

. format under18vacc* %td

. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(15,374 missing values generated)

. replace male = 0 if sex == "F"
(15,374 real changes made)

. 
. * Ethnicity 
. replace ethnicity = .u if ethnicity == .
(2,999 real changes made, 2,999 to missing)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 .u "Unknown"

. 
. label values ethnicity ethnicity

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(29,990 missing values generated)

. replace stp = sum(stp)
(29,999 real changes made)

. drop stp_old

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(30,000 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 30000 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age 18/29.9999 = 1 /// 
>                    30/39.9999 = 2 /// 
>            40/49.9999 = 3 ///
>                    50/59.9999 = 4 ///
>                60/69.9999 = 5 ///
>                    70/79.9999 = 6 ///
>                    80/max = 7, gen(agegroup) 
(23645 differences between age and agegroup)

. 
. label define agegroup   1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. * Create binary age (for age stratification)
. recode age min/65.999999999 = 0 ///
>            66/max = 1, gen(age66)
(29671 differences between age and age66)

. 
. * Check there are no missing ages
. assert age < .

. assert agegroup < .

. assert age66 < .

. 
. 
. /* APPLY HH level INCLUSION/EXCLUIONS========================================
> ==========*/ 
. 
. noi di "DROP if HH ID==0"
DROP if HH ID==0

. count if household_id==0
  0

. drop if household_id==0
(0 observations deleted)

. count
  30,000

. 
. drop if care_home_type!="U"
(916 observations deleted)

. count
  29,084

. 
. noi di "DROP HH>=10 persons:"
DROP HH>=10 persons:

. sum household_size, d

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              29,084
25%            2              0       Sum of Wgt.      29,084

50%            2                      Mean           2.490132
                        Largest       Std. Dev.      1.036191
75%            3              6
90%            4              6       Variance       1.073691
95%            4              6       Skewness       .0310824
99%            5              7       Kurtosis       2.840001

. drop if household_size>=10
(0 observations deleted)

. count
  29,084

. 
. noi di "DROP AGE MISSING:"
DROP AGE MISSING:

. recode age .=9
(age: 0 changes made)

. recode age .u=9
(age: 0 changes made)

. bysort household_id: egen age_drop=max(age)

. drop if age_drop==9
(2 observations deleted)

. count
  29,082

. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. ***KIDS_CAT5 (5 categories)
. *Identify kids under 5/5-11/12-18
. gen no_of_kids=1 if age<5
(27,443 missing values generated)

. recode no_of_kids .=2 if age<12
(no_of_kids: 2560 changes made)

. recode no_of_kids .=3 if age<18 
(no_of_kids: 1954 changes made)

. 
. *Make seperate files with only kids and household number
. preserve

. keep if age<18
(22,929 observations deleted)

. keep household_id no_of_kids

. *Drop duplicates (i.e. for hh with kids of same age, keep only one)
. duplicates drop

Duplicates in terms of all variables

(3,926 observations deleted)

. *If a hh has >1 record, there must be mixed ages in it: flag these as categor
> y 4
. bysort household_id: replace no_of_kids=4 if _N>1
(2,007 real changes made)

. duplicates drop

Duplicates in terms of all variables

(1,262 observations deleted)

. rename no_of_kids kids_cat5

. save kids_mixed_category, replace
(note: file kids_mixed_category.dta not found)
file kids_mixed_category.dta saved

. restore

. 
. *merge in kids identifier
. merge m:1 household_id using kids_mixed_category, nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                           619
        from master                       619  
        from using                          0  

    matched                            28,463  
    -----------------------------------------

. 
. *label variable
. lab define   kids_cat5 0 none  1 "only <5 years" ///
> 2 "only 5-11" 3 "12-<18" 4 "mixed"

. lab val kids_cat5 kids_cat5

. recode kids_cat5 .=0
(kids_cat5: 619 changes made)

. tab kids_cat5

    kids_cat5 |      Freq.     Percent        Cum.
--------------+-----------------------------------
         none |        619        2.13        2.13
only <5 years |        383        1.32        3.45
    only 5-11 |        791        2.72        6.17
       12-<18 |        567        1.95        8.11
        mixed |     26,722       91.89      100.00
--------------+-----------------------------------
        Total |     29,082      100.00

. drop no_of_kids

. 
. ***KIDS_CAT4 (4 categories)
. *Identify kids under 0-11/12-18
. gen no_of_kids=1 if age<12
(24,883 missing values generated)

. recode no_of_kids .=2 if age<18 
(no_of_kids: 1954 changes made)

. 
. *Make seperate files with only kids and household number
. preserve

. keep if age<18
(22,929 observations deleted)

. keep household_id no_of_kids

. *Drop duplicates (i.e. for hh with kids of same age, keep only one)
. duplicates drop

Duplicates in terms of all variables

(4,516 observations deleted)

. *If a hh has >1 record, there must be mixed ages in it: flag these as categor
> y 4
. bysort household_id: replace no_of_kids=3 if _N>1
(1,344 real changes made)

. duplicates drop

Duplicates in terms of all variables

(672 observations deleted)

. rename no_of_kids kids_cat4

. list in 1/100

     +---------------------+
     | househ~d   kids_c~4 |
     |---------------------|
  1. |      170          1 |
  2. |      299          2 |
  3. |      352          1 |
  4. |      361          1 |
  5. |      363          1 |
     |---------------------|
  6. |      367          1 |
  7. |      375          1 |
  8. |      382          2 |
  9. |      392          2 |
 10. |      395          1 |
     |---------------------|
 11. |      399          1 |
 12. |      405          1 |
 13. |      407          1 |
 14. |      414          1 |
 15. |      415          3 |
     |---------------------|
 16. |      420          2 |
 17. |      436          1 |
 18. |      437          1 |
 19. |      438          1 |
 20. |      441          3 |
     |---------------------|
 21. |      444          2 |
 22. |      446          2 |
 23. |      447          2 |
 24. |      448          1 |
 25. |      453          2 |
     |---------------------|
 26. |      456          1 |
 27. |      462          1 |
 28. |      473          1 |
 29. |      478          2 |
 30. |      479          1 |
     |---------------------|
 31. |      481          2 |
 32. |      482          2 |
 33. |      487          3 |
 34. |      491          2 |
 35. |      492          2 |
     |---------------------|
 36. |      493          2 |
 37. |      494          1 |
 38. |      495          1 |
 39. |      498          1 |
 40. |      499          1 |
     |---------------------|
 41. |      500          2 |
 42. |      501          1 |
 43. |      502          1 |
 44. |      503          1 |
 45. |      505          1 |
     |---------------------|
 46. |      510          3 |
 47. |      512          2 |
 48. |      513          3 |
 49. |      515          1 |
 50. |      516          1 |
     |---------------------|
 51. |      517          1 |
 52. |      518          2 |
 53. |      519          1 |
 54. |      527          3 |
 55. |      531          3 |
     |---------------------|
 56. |      533          1 |
 57. |      536          1 |
 58. |      537          3 |
 59. |      541          3 |
 60. |      544          1 |
     |---------------------|
 61. |      547          2 |
 62. |      549          1 |
 63. |      550          3 |
 64. |      552          1 |
 65. |      553          2 |
     |---------------------|
 66. |      554          2 |
 67. |      556          2 |
 68. |      557          1 |
 69. |      559          1 |
 70. |      560          3 |
     |---------------------|
 71. |      561          3 |
 72. |      562          1 |
 73. |      563          1 |
 74. |      565          3 |
 75. |      566          1 |
     |---------------------|
 76. |      568          1 |
 77. |      571          1 |
 78. |      572          1 |
 79. |      574          1 |
 80. |      575          3 |
     |---------------------|
 81. |      576          1 |
 82. |      577          1 |
 83. |      578          3 |
 84. |      579          1 |
 85. |      580          1 |
     |---------------------|
 86. |      584          1 |
 87. |      585          1 |
 88. |      586          1 |
 89. |      587          2 |
 90. |      588          3 |
     |---------------------|
 91. |      589          1 |
 92. |      590          1 |
 93. |      591          1 |
 94. |      592          2 |
 95. |      593          3 |
     |---------------------|
 96. |      595          2 |
 97. |      596          1 |
 98. |      597          1 |
 99. |      598          2 |
100. |      599          1 |
     +---------------------+

. save kids_mixed_category, replace
file kids_mixed_category.dta saved

. restore

. 
. *merge in kids identifier
. merge m:1 household_id using kids_mixed_category, nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                           619
        from master                       619  
        from using                          0  

    matched                            28,463  
    -----------------------------------------

. 
. *label variable
. lab define   kids_cat4 0 none  1 "only <12 years" ///
> 2 "only 12-18" ///
> 3 "mixed"

. lab val kids_cat4 kids_cat4

. recode kids_cat4 .=0
(kids_cat4: 619 changes made)

. tab kids_cat4

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        619        2.13        2.13
only <12 years |      2,695        9.27       11.40
    only 12-18 |        567        1.95       13.35
         mixed |     25,201       86.65      100.00
---------------+-----------------------------------
         Total |     29,082      100.00

. 
. *Dose-response exposure: identify number of kids in hh where there are ONLY u
> nder 11 yr olds
. bysort household_id: egen number_kids=sum(no_of_kids) if kids_cat4==1
(26387 missing values generated)

. 
. gen gp_number_kids=number_kids
(26,387 missing values generated)

. recode gp_number_kids 4/max=4
(gp_number_kids: 851 changes made)

. 
. lab var gp_number_kids "Number kids under 12 years in hh"

. lab define   gp_number_kids 0 none ///
> 1 "1 child <12" ///
> 2 "2 children <12" ///
> 3 "3 children <12" ///
> 4 "4+ children <12"

. lab val gp_number_kids gp_number_kids

. 
. tab kids_cat4 

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        619        2.13        2.13
only <12 years |      2,695        9.27       11.40
    only 12-18 |        567        1.95       13.35
         mixed |     25,201       86.65      100.00
---------------+-----------------------------------
         Total |     29,082      100.00

. tab kids_cat5

    kids_cat5 |      Freq.     Percent        Cum.
--------------+-----------------------------------
         none |        619        2.13        2.13
only <5 years |        383        1.32        3.45
    only 5-11 |        791        2.72        6.17
       12-<18 |        567        1.95        8.11
        mixed |     26,722       91.89      100.00
--------------+-----------------------------------
        Total |     29,082      100.00

. tab kids_cat*

              |                  kids_cat4
    kids_cat5 |      none  only <12   only 12-1      mixed |     Total
--------------+--------------------------------------------+----------
         none |       619          0          0          0 |       619 
only <5 years |         0        383          0          0 |       383 
    only 5-11 |         0        791          0          0 |       791 
       12-<18 |         0          0        567          0 |       567 
        mixed |         0      1,521          0     25,201 |    26,722 
--------------+--------------------------------------------+----------
        Total |       619      2,695        567     25,201 |    29,082 

. 
. 
. /* DROP ALL KIDS, AS HH COMPOSITION VARS ARE NOW MADE */
. drop if age<18
(6,153 observations deleted)

. 
. *Total number adults in household (to check hh size)
. bysort household_id: gen tot_adults_hh=_N

. recode tot_adults_hh 3/max=3
(tot_adults_hh: 22523 changes made)

. 
. tab kids_cat4

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        619        2.70        2.70
only <12 years |      2,170        9.46       12.16
    only 12-18 |        475        2.07       14.24
         mixed |     19,665       85.76      100.00
---------------+-----------------------------------
         Total |     22,929      100.00

. tab gp_num if kids_cat4==1

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
    1 child <12 |        470       21.66       21.66
 2 children <12 |        402       18.53       40.18
 3 children <12 |        272       12.53       52.72
4+ children <12 |      1,026       47.28      100.00
----------------+-----------------------------------
          Total |      2,170      100.00

. 
. erase kids_mixed_category.dta

. 
. /* SET FU DATES==============================================================
> =*/ 
. * Censoring dates for each outcome (largely, last date outcome data available
> )
. *****NEEDS UPDATING WHEN INFO AVAILABLE*******************
. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. rename dereg_date_date                                          dereg_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes_date  ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 dialysis                     
>                    ///
>                                                 kidney_transplant            
>            ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         
. }

. 
. 
. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(1,157 real changes made, 1,157 to missing)

. replace bmi = . if !inrange(bmi, 15, 50)
(3,619 real changes made, 3,619 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (date("$indexdate", "DMY") - bmi_measured_date)/365.25
(1,157 missing values generated)

. gen bmi_age = age - bmi_time
(1,157 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(398 real changes made, 398 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(4,017 real changes made, 4,017 to missing)

. replace bmi_measured = . if bmi == . 
(5,174 real changes made, 5,174 to missing)

. 
. gen     bmicat = .
(22,929 missing values generated)

. recode  bmicat . = 1 if bmi < 18.5
(bmicat: 2051 changes made)

. recode  bmicat . = 2 if bmi < 25
(bmicat: 5219 changes made)

. recode  bmicat . = 3 if bmi < 30
(bmicat: 4130 changes made)

. recode  bmicat . = 4 if bmi < 35
(bmicat: 3169 changes made)

. recode  bmicat . = 5 if bmi < 40
(bmicat: 1930 changes made)

. recode  bmicat . = 6 if bmi < .
(bmicat: 1256 changes made)

. replace bmicat = .u if bmi >= .
(5,174 real changes made, 5,174 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

.                                         
. label values bmicat bmicat

. 
. * Create less  granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(20878 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(22,050 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(424 real changes made)

. replace smoke = 3  if smoking_status == "S"
(2,802 real changes made)

. replace smoke = .u if smoking_status == "M"
(468 real changes made, 468 to missing)

. replace smoke = .u if smoking_status == "" 
(18,356 real changes made, 18,356 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(18824 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(cancer_haem_date, d(1/1/1900), d(1/2/2
> 015))
(18,903 missing values generated)

. replace cancer_haem_cat = 3 if inrange(cancer_haem_date, d(1/2/2015), d(1/2/2
> 019))
(374 real changes made)

. replace cancer_haem_cat = 2 if inrange(cancer_haem_date, d(1/2/2019), d(1/2/2
> 020))
(102 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 18427 changes made)

. label values cancer_haem_cat cancer

. 
. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(cancer_nonhaem_date,  d(1/1/1900), d
> (1/2/2015)) 
(18,908 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(cancer_nonhaem_date,  d(1/2/2015), d
> (1/2/2019))
(400 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(cancer_nonhaem_date,  d(1/2/2019), d
> (1/2/2020)) 
(84 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 18424 changes made)

. label values cancer_exhaem_cat cancer

. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(18,341 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (date("$indexdate", "DMY") - 365), 
> date("$indexdate", "DMY"))

. 
. egen other_immuno = rowmax(temp1 temp2)

. drop temp1 temp2 

. order other_immuno, after(temp_immunodef)

. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(16,662 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(3,902 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(9,397 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(3,967 real changes made)

. replace bpcat = .u if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(2,268 real changes made, 2,268 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" .u "Unknown"

. label values bpcat bpcat

. 
. recode bpcat .u=1, gen(bpcat_nomiss)
(2268 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 3839 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(1,231 real changes made, 1,231 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(1,231 missing values generated)

. 
. gen min=.
(22,929 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(11,094 real changes made)

. replace min = SCr_adj/0.9 if male==1
(10,604 real changes made)

. replace min = min^-0.329  if male==0
(11,094 real changes made)

. replace min = min^-0.411  if male==1
(10,604 real changes made)

. replace min = 1 if min<1
(5,978 real changes made)

. 
. gen max=.
(22,929 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(11,094 real changes made)

. replace max=SCr_adj/0.9 if male==1
(10,604 real changes made)

. replace max=max^-1.209
(21,698 real changes made)

. replace max=1 if max>1
(16,951 real changes made)

. 
. gen egfr=min*max*141
(1,231 missing values generated)

. replace egfr=egfr*(0.993^age)
(21,698 real changes made)

. replace egfr=egfr*1.018 if male==0
(11,094 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(1231 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(21698 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. *label var ckd "CKD stage calc without eth"
. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
.         
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(21454 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(1,231 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. lab var  reduced "Reduced kidney function"

. 
. 
. /*ESDR: dialysis or kidney transplant*/
. gen esrd=1 if dialysis==1 | kidney_transplant==1
(14,709 missing values generated)

. recode esrd .=0
(esrd: 14709 changes made)

. 
. 
. 
. ***************************
. /* DM / Hb1AC */
. ***************************
. 
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(1,292 real changes made, 1,292 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(1,609 real changes made, 1,609 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |     21,637    5.017156    1.950455   .0056085   13.56721
hba1c_mmol~l |     21,320    41.00571    18.90871   .0065538    125.711

. gen     hba1c_pct = hba1c_percentage 
(1,292 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(21,320 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(22,820 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(22,254 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(4,594 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(447 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(17,213 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |    17,213          0          0          0 |    17,213 
         1 |         0        675          0          0 |       675 
         2 |         0          0      4,594          0 |     4,594 
         3 |         0          0          0        447 |       447 
-----------+--------------------------------------------+----------
     Total |    17,213        675      4,594        447 |    22,929 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. /*Open safely diabetes codes with exeter algorithm
> gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
> replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
> replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
> label values  dm_type_exeter_os dm_type*/
. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(8,421 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(4,181 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(1,401 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(1,751 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(979 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |     14,508       63.58       63.58
  >=6.5-7.4 |      4,181       18.32       81.90
  >=7.5-7.9 |      1,401        6.14       88.04
    >=8-8.9 |      1,751        7.67       95.71
        >=9 |        979        4.29      100.00
------------+-----------------------------------
      Total |     22,820      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(4,240 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(4,131 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,689       81.51       81.51
          1 |      4,131       18.02       99.52
          . |        109        0.48      100.00
------------+-----------------------------------
      Total |     22,929      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0 | dm_type==.
(5,716 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(541 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(129 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(3,761 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(812 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(26 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     17,213       75.07       75.07
  T1DM, controlled |        541        2.36       77.43
T1DM, uncontrolled |        129        0.56       77.99
  T2DM, controlled |      3,761       16.40       94.40
T2DM, uncontrolled |        812        3.54       97.94
Diabetes, no HbA1c |         26        0.11       98.05
                 . |        447        1.95      100.00
-------------------+-----------------------------------
             Total |     22,929      100.00

. recode diabcat .=1
(diabcat: 447 changes made)

. 
. 
. 
. /*  Asthma  */
. 
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3
(asthmacat: 4621 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. /*  Probable shielding  */
. gen shield=1 if esrd==1 | other_transplant==1 | asthmacat==2 | asthmacat==3 |
>  ///
> chronic_respiratory_disease==1 | cancer_haem==1 | cancer_nonhaem==1 | ///
> asplenia==1 | other_immuno==1
(3,501 missing values generated)

. recode shield .=0
(shield: 3501 changes made)

. 
. /*Any comorbidity*/
. 
. gen anycomorb=1 if chronic_respiratory_disease==1 | ///
>                     asthmacat==2 | asthmacat==3 | ///
>                                         chronic_cardiac_disease==1  | ///
>                                         diabcat==2 | diabcat==3 | diabcat==4 
> | diabcat==5 | diabcat==6 | ///
>                                         cancer_haem==1 | cancer_nonhaem==1 | 
> ///
>                                         esrd==1 | ///
>                                         chronic_liver_disease==1 | ///
>                                         stroke_dementia==1 | ///
>                                         other_neuro==1 | ///
>                                         other_transplant==1 | ///
>                                         asplenia==1 | ///
>                                         ra_sle_psoriasis==1 | ///
>                                         other_immuno==1 
(883 missing values generated)

. recode anycomorb .=0
(anycomorb: 883 changes made)

. tab anyco

  anycomorb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        883        3.85        3.85
          1 |     22,046       96.15      100.00
------------+-----------------------------------
      Total |     22,929      100.00

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma categ
> ory"

. label var egfr_cat                                              "Calculated e
> GFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                                               "Haem
> atological cancer"

. label var cancer_exhaem_cat                                             "Non-
> haematological cancer"

. label var kidney_transplant                                             "Kidn
> ey transplant"     

. label var other_transplant                                              "Othe
> r solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (co
> mbination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                   "Neurological disease"               
>    

. label var stroke_dementia                           "Stroke or dementia"     
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosupp
> ression"

. lab var temp_immunodef                                  "Temporary immunosupp
> ression"

. lab var esrd                                                    "End-stage re
> nal disease"

. 
. lab var covid_vacc_date                         "First vacc date"

. lab var covid_vacc_second_dose_date "Second vacc date"

. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
. gen enter_date = date("$indexdate", "DMY")

. gen study_end_censor =date("$study_end_censor", "DMY")

. 
. * Format the dates
. format  enter_date                                      ///
>                 study_end_censor  

  variable name     display format
  --------------------------------
  enter_date        %9.0g
  study_end_censor  %9.0g
  --------------------------------

.                 
.                         /****   Outcome definitions   ****/
. 
. * Date of Covid death in ONS
. gen died_date_onscovid = died_date_ons if died_ons_covid_flag_any == 1
(11,973 missing values generated)

. gen died_date_onscovid_part1 = died_date_ons if died_ons_covid_flag_underlyin
> g == 1
(11,886 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen died_date_onsnoncovid = died_date_ons if died_ons_covid_flag_any != 1 
(15,527 missing values generated)

. 
. *Date probable covid in TPP
. rename covid_tpp_probable date_covid_tpp_prob

. rename covid_test_ever date_covid_test_ever

. 
. format died_date_ons %td

. format died_date_onscovid %td 

. format died_date_onsnoncovid %td

. format died_date_onscovid_part1 %td

. format covid_admission_primary_date %td

. format date_covid_test_ever %td

. 
. * Binary indicators (0/1) for outcomes
. gen covid_tpp_prob = (date_covid_tpp_prob < .)

. gen non_covid_death = (died_date_onsnoncovid < .)

. gen covid_death = (died_date_onscovid < .)

. gen covidadmission = (covid_admission_primary_date < .)

. gen covid_death_part1 = (died_date_onscovid_part1 < .)

. gen covid_test_ever = (date_covid_test_ever < .)

. 
.                                         /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: end study, death, or that outcom
> e)
. *gen stime_onscoviddeath = min(onscoviddeathcensor_date,                     
>            died_date_ons)
. gen stime_covid_death_part1     = min(study_end_censor   , died_date_onscovid
> _part1, died_date_ons, dereg_date)

. gen stime_covid_tpp_prob = min(study_end_censor   , died_date_ons, date_covid
> _tpp_prob, dereg_date)

. gen stime_non_covid_death = min(study_end_censor   , died_date_ons, died_date
> _onsnoncovid, dereg_date)

. gen stime_covid_death = min(study_end_censor   , died_date_ons, died_date_ons
> covid, dereg_date)

. gen stime_covidadmission        = min(study_end_censor   , covid_admission_pr
> imary_date, died_date_ons, dereg_date)

. gen stime_covid_test_ever = min(study_end_censor, died_date_ons, date_covid_t
> est_ever, dereg_date)

. 
. 
. * If outcome was after censoring occurred, set to zero
. replace covid_tpp_prob = 0 if (date_covid_tpp_prob > study_end_censor ) 
(3,096 real changes made)

. replace non_covid_death = 0 if (died_date_onsnoncovid > study_end_censor )
(976 real changes made)

. replace covid_death = 0 if (died_date_onscovid > study_end_censor )
(1,494 real changes made)

. replace covidadmission  = 0 if (covid_admission_primary_date > study_end_cens
> or  | covid_admission_primary_date > died_date_ons) 
(2,284 real changes made)

. replace covid_death_part1 = 0 if (died_date_onscovid_part1 > study_end_censor
>  )
(1,480 real changes made)

. replace covid_test_ever = 0 if (date_covid_test_ever > study_end_censor )
(3,428 real changes made)

. 
. 
. * If outcome was after censoring occurred, set date to missing
. replace date_covid_tpp_prob = . if (date_covid_tpp_prob > study_end_censor ) 
(3,096 real changes made, 3,096 to missing)

. replace died_date_onsnoncovid = . if (died_date_onsnoncovid > study_end_censo
> r )
(976 real changes made, 976 to missing)

. replace died_date_onscovid = . if (died_date_onscovid > study_end_censor )
(1,494 real changes made, 1,494 to missing)

. replace covid_admission_primary_date    = . if (covid_admission_primary_date 
> > study_end_censor  | covid_admission_primary_date > died_date_ons) 
(2,284 real changes made, 2,284 to missing)

. replace died_date_onscovid_part1 = . if (died_date_onscovid_part1 > study_end
> _censor )
(1,480 real changes made, 1,480 to missing)

. replace date_covid_test_ever = . if (date_covid_test_ever > study_end_censor 
> ) 
(3,428 real changes made, 3,428 to missing)

. 
. 
. * Format date variables
. format  stime* %td  

. gen positive_SGSS = (positive_covid_test_ever < .)

. gen covid_primary_care_codes = (covid_primary_care_codes_only < .)

. rename positive_covid_test_ever date_positive_SGSS

. rename covid_primary_care_codes_only date_covid_primary_care_codes

. replace covid_primary_care_codes = 0 if (date_covid_primary_care_codes > stud
> y_end_censor )
(2,914 real changes made)

. replace positive_SGSS = 0 if (date_positive_SGSS > study_end_censor )
(3,459 real changes made)

. 
. replace date_covid_primary_care_codes = . if (date_covid_primary_care_codes >
>  study_end_censor )
(2,914 real changes made, 2,914 to missing)

. replace date_positive_SGSS = . if (date_positive_SGSS > study_end_censor )
(3,459 real changes made, 3,459 to missing)

. 
. 
. gen reported_infection_source=1 if covid_tpp_prob==1
(4,003 missing values generated)

. recode reported_infection_source 1=2 if date_covid_tpp_prob== covid_tpp_codes
> _test 
(reported_infection_source: 28 changes made)

. recode reported_infection_source 1=3 if date_covid_tpp_prob==covid_tpp_codes_
> seq 
(reported_infection_source: 26 changes made)

. recode reported_infection_source 1=4 if date_covid_tpp_prob==covid_tpp_codes_
> clinical 
(reported_infection_source: 22 changes made)

. lab define reported_infection_source 1 SGSS 2 test_code 3 sequalae_code 4 dia
> gnosis_code

. lab val reported_infection_source reported_infection_source

. 
. 
. 
. 
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  number_kids "Number of children aged 1-<12 years in household"

. label var  household_size "Number people in household"

. label var  household_id "Household ID"

. 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var age66                                         "66 years and older"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "Grouped BMI"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Evidence of obesity 
> (4 categories)"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var ethnicity                                     "Ethnicity"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. lab var tot_adults_hh                           "Total number adults in hh"

. lab var kids_cat4                                       "Exposure (v2) with 4
> -cats"

. lab var kids_cat5                                        "Exposure (v3) with 
> 5-cats"

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma categ
> ory"

. label var egfr_cat                                              "Calculated e
> GFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                                               "Haem
> atological cancer"

. label var cancer_exhaem_cat                                             "Non-
> haematological cancer"

. label var kidney_transplant                                             "Kidn
> ey transplant"     

. label var other_transplant                                              "Othe
> r solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (co
> mbination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                   "Neurological disease"               
>    

. label var stroke_dementia                           "Stroke or dementia"     
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosupp
> ression"

. lab var temp_immunodef                                  "Temporary immunosupp
> ression"

. lab var esrd                                                    "End-stage re
> nal disease"

. lab var anycomorb                                               "Any comorbid
> ity"

. 
. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_haem_date                                      "Haem cancer 
> Date"

. label var cancer_nonhaem_date                           "Non-haem cancer Date
> "

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date              "Neurological disease  Date"

. label var stroke_dementia_date                      "Stroke or dementia date"
>                                                    

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var perm_immunodef_date                             "Permanent immunosupp
> ression date"

. lab var temp_immunodef_date                             "Temporary immunosupp
> ression date"

. label var kidney_transplant_date                                             
>    "Kidney transplant"     

. label var other_transplant_date                                         "Othe
> r solid organ transplant"

. label var asplenia_date                                                 "Aspl
> enia date"

. lab var  bphigh "non-missing indicator of known high blood pressure"

. lab var bpcat "Blood pressure four levels, non-missing"

. lab var htdiag_or_highbp "High blood pressure or hypertension diagnosis"

. lab var shield "Probable shielding"

. 
. * Outcomes and follow-up
. label var enter_date                                    "Date of study entry"

. label var study_end_censor                      "Date of admin censoring for 
> outcomes"

. 
. label var  covid_tpp_prob                               "Failure/censoring in
> dicator for outcome: covid prob case"

. label var  non_covid_death                              "Failure/censoring in
> dicator for outcome: non-covid death"

. label var  covid_death                              "Failure/censoring indica
> tor for outcome: covid death"

. label var  covid_test_ever                                  "Failure/censorin
> g indicator for outcome: covid test ever"

. lab var covidadmission                                  "Failure/censoring in
> dicator for outcome: covid SUS admission"

. lab var covid_death_part1                               "Failure/censoring in
> dicator for outcome: covid death part1"

. lab var  positive_SGSS          "Indicator positive covid test"

. lab var  covid_primary_care_codes               "Indicator positive primary c
> are code COVID infection"

. lab var reported_infection_source               "Reported Infection Source"

. lab var lft_pcr "Type of test taken"

. 
. rename died_date_onsnoncovid date_non_covid_death

. rename died_date_onscovid date_covid_death

. rename covid_admission_primary_date date_covidadmission

. label var date_covid_tpp_prob                   "Date of probable COVID-19 cl
> inical infection"

. label var date_non_covid_death                  "Date of ONS non-COVID-19 Dea
> th"

. label var  date_covid_death                     "Date of ONS COVID-19 Death"

. lab var date_covidadmission                     "Date of admission to hospita
> l for COVID-19" 

. label var  died_date_onscovid_part1                     "Date of ONS COVID De
> ath part1"

. lab var  date_positive_SGSS             "Date of positive SGSS test"

. lab var   date_covid_primary_care_codes "Date of COVID-19 primary care code"

. lab var   date_covid_test_ever  "Date of COVID-19 test"

. 
. * Survival times
. label var  stime_covid_tpp_prob                         "Survival tme (date);
>  outcome "

. label var  stime_non_covid_death                        "Survival tme (date);
>  outcome non_covid_death   "

. label var  stime_covid_death                            "Survival time (date)
> ; outcome covid death"

. label var  stime_covidadmission                         "Survival time (date)
> ; outcome covid hosp admission"

. label var  stime_covid_death_part1                              "Survival tim
> e (date); outcome covid death part1"

. label var  stime_covid_test_ever                                "Survival tim
> e (date); outcome covid test"

. 
. *Key DATES
. label var   died_date_ons                               "Date death ONS"

. label var  has_12_m_follow_up                   "Has 12 months follow-up"

. lab var  dereg_date                                             "Date deregis
> tration from practice"

. lab var under18vacc                                             "Date first c
> hild in hh vaccinated"

. 
. 
. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
ethnicity_~e  hba1c_mmol~e  sgtf          diabetes      SCr_adj
bmi_measured  hba1c_per~te  sex           covid_tpp_~l  min
bp_sys_dat~e  cancer_haem   care_home_~e  covid_tpp_~t  max
bp_sys_dat~d  cancer_non~m  bp_sys        covid_tpp_~q  hba1c_pct
bp_dias_da~e  esrf_date     bp_dias       covid_admi~e  dm_type
bp_dias_da~d  esrf          creatinine    under18vac~p  hba1ccat
crea~te_date  dialysis_d~e  diabetes_t~e  age_drop      hba1c75
crea~ne_date  dialysis      hba1c_mmol~l  no_of_kids
smoki~e_date  died_ons_c~y  hba1c_per~ge  bmi_time
smoki~s_date  died_ons_c~g  asthmacat     bmi_age

. drop `r(varlist)'

. drop covid_admission_primary_diagnosi   

. 
.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. *************TEMP DROP TO INVESTIGATE ASSOCIATIONS MORE EASILY***************
> ***
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. count
  22,929

. 
. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. drop if died_date_ons <=enter_date
(0 observations deleted)

. count
  22,929

. 
. noi di "DROP IF COVID IN TPP BEFORE INDEX"
DROP IF COVID IN TPP BEFORE INDEX

. drop if date_covid_tpp_prob <=enter_date
(0 observations deleted)

. count
  22,929

. 
. noi di "DROP IMD MISSING"
DROP IMD MISSING

. recode imd .=9
(imd: 0 changes made)

. recode imd .u=9
(imd: 0 changes made)

. drop if imd==9
(0 observations deleted)

. count
  22,929

. 
. noi di "DROP MISSING GENDER:"
DROP MISSING GENDER:

. recode male .=9
(male: 0 changes made)

. recode male .u=9
(male: 0 changes made)

. drop if male==9
(0 observations deleted)

. count   
  22,929

.         
. ***************
. *  Save data  *
. ***************
. sort patient_id

. save $tempdir/analysis_dataset_with_missing_ethnicity, replace
(note: file tempdata/analysis_dataset_with_missing_ethnicity.dta not found)
file tempdata/analysis_dataset_with_missing_ethnicity.dta saved

. 
. noi di "DROP NO ETHNICITY DATA"
DROP NO ETHNICITY DATA

. keep if ethnicity!=.u   
(2,274 observations deleted)

. 
. save $tempdir/analysis_dataset, replace
(note: file tempdata/analysis_dataset.dta not found)
file tempdata/analysis_dataset.dta saved

. 
. 
. 
. use  $tempdir/analysis_dataset, clear

. keep if age<=65
(4,543 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir/analysis_dataset_ageband_0, replace
(note: file tempdata/analysis_dataset_ageband_0.dta not found)
file tempdata/analysis_dataset_ageband_0.dta saved

. 
. 
. use  $tempdir/analysis_dataset, clear

. keep if age>65
(16,112 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir/analysis_dataset_ageband_1, replace
(note: file tempdata/analysis_dataset_ageband_1.dta not found)
file tempdata/analysis_dataset_ageband_1.dta saved

. 
. 
. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  3.         
. /*no longer using composite outcome
> use $tempdir/analysis_dataset_ageband_`x', clear
> * Save a version set on covid death/icu  outcome
> stset stime_covid_death_icu, fail(covid_death_icu)                           
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
> save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_icu_ageband_`x'.d
> ta", replace
> */
. use $tempdir/analysis_dataset_ageband_`x', clear
  4. * Save a version set on covid test ever  outcome only
. stset stime_covid_test_ever, fail(covid_test_ever)                           
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  5. save "$tempdir/cr_create_analysis_dataset_STSET_covid_test_ever_ageband_`x
> '.dta", replace
  6. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  7. * Save a version set on covid death only
. stset stime_covid_death, fail(covid_death)                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  8. save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_ageband_`x'.dt
> a", replace
  9. 
. /*this was created for investigation only
> use $tempdir/analysis_dataset_ageband_`x', clear
> * Save a version set on covid death only
> stset stime_covid_death_part1, fail(covid_death_part1)                       
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
> save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_part1_ageband_`x'
> .dta", replace
> */
. use $tempdir/analysis_dataset_ageband_`x', clear
 10. * Save a version set on probable covid
. stset stime_covid_tpp_prob, fail(covid_tpp_prob)                             
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 11. save "$tempdir/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_`x'
> .dta", replace        
 12. 
. use $tempdir/analysis_dataset_ageband_`x', clear
 13. * Save a version set on hosp admission for covid
. stset stime_covidadmission, fail(covidadmission)                             
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 14. save "$tempdir/cr_create_analysis_dataset_STSET_covidadmission_ageband_`x'
> .dta", replace        
 15. 
. }

                id:  patient_id
     failure event:  covid_test_ever != 0 & covid_test_ever < .
obs. time interval:  (stime_covid_test_ever[_n-1], stime_covid_test_ever]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,112  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     16,108  observations remaining, representing
     16,108  subjects
        790  failures in single-failure-per-subject data
  3,192,282  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       305
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_test_ever_ageband_0
> .dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_test_ever_ageband_0.dta sa
> ved

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,112  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     16,108  observations remaining, representing
     16,108  subjects
      6,638  failures in single-failure-per-subject data
  3,202,671  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       305
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta
>  not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,112  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     16,108  observations remaining, representing
     16,108  subjects
     13,310  failures in single-failure-per-subject data
  2,126,206  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       305
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_0.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_0.dta sav
> ed

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,112  total observations
         13  observations end on or before enter()
------------------------------------------------------------------------------
     16,099  observations remaining, representing
     16,099  subjects
      2,089  failures in single-failure-per-subject data
  2,940,750  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       305
(note: file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_0.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_0.dta sav
> ed

                id:  patient_id
     failure event:  covid_test_ever != 0 & covid_test_ever < .
obs. time interval:  (stime_covid_test_ever[_n-1], stime_covid_test_ever]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,543  total observations
          1  observation ends on or before enter()
------------------------------------------------------------------------------
      4,542  observations remaining, representing
      4,542  subjects
        226  failures in single-failure-per-subject data
    909,994  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       305
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_test_ever_ageband_1
> .dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_test_ever_ageband_1.dta sa
> ved

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,543  total observations
          1  observation ends on or before enter()
------------------------------------------------------------------------------
      4,542  observations remaining, representing
      4,542  subjects
      1,871  failures in single-failure-per-subject data
    913,633  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       305
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_1.dta
>  not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_1.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,543  total observations
          1  observation ends on or before enter()
------------------------------------------------------------------------------
      4,542  observations remaining, representing
      4,542  subjects
      3,746  failures in single-failure-per-subject data
    611,326  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       305
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_1.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_1.dta sav
> ed

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,543  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
      4,540  observations remaining, representing
      4,540  subjects
        602  failures in single-failure-per-subject data
    835,568  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       305
(note: file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_1.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_1.dta sav
> ed

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/01_cr_analysis_dataset.log
  log type:  text
 closed on:   8 Dec 2021, 14:46:36
-------------------------------------------------------------------------------
