-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/02_an_data_checks.log
  log type:  text
 opened on:  15 Mar 2023, 13:53:43

. 
. * Open Stata dataset
. use $tempdir/`inputfile', clear

. 
. *run ssc install if not on local machine - server needs datacheck.ado file
. *ssc install datacheck 
. 
. *Duplicate patient check
. datacheck _n==1, by(patient_id) nol

. 
. 
. /* CHECK INCLUSION AND EXCLUSION CRITERIA====================================
> =*/ 
. 
. * DATA STRUCTURE: Confirm one row per patient 
. duplicates tag patient_id, generate(dup_check)

Duplicates in terms of patient_id

. assert dup_check == 0 

. drop dup_check

. 
. * INCLUSION 1: >=18 and <=110 at 1 March 2020 
. assert age < .

. assert age >= 18 

. assert age <= 110

. 
. 
. * EXCLUDE 1:  MISSING IMD
. assert inlist(imd, 1, 2, 3, 4, 5)

. 
. * EXCLUDE 2:  HH with more than 10 people
. datacheck inlist(household_size, 1, 2, 3, 4, 5,6, 7, 8, 9, 10), nol

 (3108 contradictions)

. 
. /* EXPECTED VALUES===========================================================
> =*/ 
. 
. *HH
. datacheck kids_cat4<., nol

. datacheck inlist(kids_cat4, 0,1, 2), nol

 (135571 contradictions)

. 
. datacheck number_kids<., nol

 (136264 contradictions)

. datacheck inlist(number_kids, 0,1,2,3,4,5,6,7,8,9), nol

 (136264 contradictions)

. 
. * Age
. datacheck age<., nol

. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6,7), nol

. datacheck inlist(age66, 0, 1), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. datacheck inlist(obese4cat, 1, 2, 3, 4), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

. datacheck inlist(smoke_nomiss, 1, 2, 3), nol 

. 
. 
. * Check date ranges for all comorbidities 
. 
. foreach var of varlist  chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         perm_immunodef  ///
>                                         temp_immunodef  ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         hypertension                         
>    ///
>                                         {
  2.                                                 
.         summ `var'_date, format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_r~te |     27,460   01jul1995     5396.79  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_c~te |     27,522   08jul1995    5360.761  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_l~te |     27,572   18jun1995    5359.836  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_neur~e |     27,602   22may1995    5378.604  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stroke_dem~e |     27,266   21apr1995    5381.446  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ra_sle_pso~e |     27,513   22may1995    5358.506  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
perm_immun~e |     27,437   11jul1995    5370.456  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
temp_immun~e |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_tran~e |     27,430   20jul1995    5372.199  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
asplenia_d~e |     27,609   14may1995    5391.825  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hypertensi~e |     27,366   01mar1996     5525.69  15jan1970  15may2022

. 
. foreach comorb in $varlist { 
  2.         local comorb: subinstr local comorb "i." ""
  3.         safetab `comorb', m
  4. }

. 
. *summarise end dates for each outcome
. foreach outcome in date_covid_tpp_prob  date_covid_test_ever date_non_covid_d
> eath       date_covid_death        date_covidadmission     died_date_onscovid
> _part1         {
  2. sum `outcome', format
  3. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~b |    110,129   22jul2021    123.4448  21dec2020  21feb2022

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~r |      5,596   02jan2022    49.40328  08jan2021  21feb2022

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_non_c~h |     36,898   23jul2021    123.3682  21dec2020  21feb2022

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~h |     55,745   22jul2021    123.2874  21dec2020  21feb2022

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~n |     40,916   16jun2021    119.0676  20dec2020  21feb2022

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~1 |     55,479   22jul2021    123.2433  21dec2020  21feb2022

. 
. foreach outcome in date_covid_tpp_prob  date_non_covid_death    date_covid_de
> ath        date_covidadmission     died_date_onscovid_part1         {
  2. gen `outcome'_month=mofd(`outcome') 
  3.  lab define `outcome'_month 731 "Dec 2020" 734 "March 2020"  738 "July 202
> 0"
  4. lab val `outcome'_month `outcome'_month
  5. tab `outcome'_month
  6. drop `outcome'_month
  7. }
(27,330 missing values generated)

date_covid_ |
tpp_prob_mo |
        nth |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |      2,822        2.56        2.56
        732 |      8,009        7.27        9.83
        733 |      7,114        6.46       16.29
 March 2020 |      7,950        7.22       23.51
        735 |      7,677        6.97       30.48
        736 |      8,002        7.27       37.75
        737 |      7,696        6.99       44.74
  July 2020 |      7,855        7.13       51.87
        739 |      8,035        7.30       59.17
        740 |      7,824        7.10       66.27
        741 |      8,129        7.38       73.65
        742 |      7,651        6.95       80.60
        743 |      8,060        7.32       87.92
        744 |      7,976        7.24       95.16
        745 |      5,329        4.84      100.00
------------+-----------------------------------
      Total |    110,129      100.00
(100,561 missing values generated)

date_non_co |
vid_death_m |
       onth |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        916        2.48        2.48
        732 |      2,587        7.01        9.49
        733 |      2,464        6.68       16.17
 March 2020 |      2,675        7.25       23.42
        735 |      2,574        6.98       30.40
        736 |      2,676        7.25       37.65
        737 |      2,593        7.03       44.68
  July 2020 |      2,731        7.40       52.08
        739 |      2,632        7.13       59.21
        740 |      2,638        7.15       66.36
        741 |      2,638        7.15       73.51
        742 |      2,554        6.92       80.43
        743 |      2,652        7.19       87.62
        744 |      2,745        7.44       95.06
        745 |      1,823        4.94      100.00
------------+-----------------------------------
      Total |     36,898      100.00
(81,714 missing values generated)

date_covid_ |
death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |      1,395        2.50        2.50
        732 |      4,001        7.18        9.68
        733 |      3,664        6.57       16.25
 March 2020 |      4,051        7.27       23.52
        735 |      4,075        7.31       30.83
        736 |      3,916        7.02       37.85
        737 |      3,818        6.85       44.70
  July 2020 |      4,055        7.27       51.98
        739 |      4,151        7.45       59.42
        740 |      3,913        7.02       66.44
        741 |      4,008        7.19       73.63
        742 |      3,971        7.12       80.76
        743 |      3,991        7.16       87.92
        744 |      4,073        7.31       95.22
        745 |      2,663        4.78      100.00
------------+-----------------------------------
      Total |     55,745      100.00
(96,543 missing values generated)

date_covida |
dmission_mo |
        nth |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |      1,741        4.26        4.26
        732 |      4,200       10.26       14.52
        733 |      3,716        9.08       23.60
 March 2020 |      3,818        9.33       32.93
        735 |      3,567        8.72       41.65
        736 |      3,343        8.17       49.82
        737 |      3,072        7.51       57.33
  July 2020 |      2,986        7.30       64.63
        739 |      2,771        6.77       71.40
        740 |      2,444        5.97       77.37
        741 |      2,416        5.90       83.28
        742 |      2,068        5.05       88.33
        743 |      1,899        4.64       92.97
        744 |      1,755        4.29       97.26
        745 |      1,120        2.74      100.00
------------+-----------------------------------
      Total |     40,916      100.00
(81,980 missing values generated)

died_date_o |
nscovid_par |
   t1_month |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |      1,396        2.52        2.52
        732 |      3,992        7.20        9.71
        733 |      3,669        6.61       16.33
 March 2020 |      4,034        7.27       23.60
        735 |      3,948        7.12       30.71
        736 |      3,972        7.16       37.87
        737 |      3,895        7.02       44.89
  July 2020 |      4,052        7.30       52.20
        739 |      4,075        7.35       59.54
        740 |      3,912        7.05       66.59
        741 |      3,981        7.18       73.77
        742 |      3,902        7.03       80.80
        743 |      3,971        7.16       87.96
        744 |      4,021        7.25       95.21
        745 |      2,659        4.79      100.00
------------+-----------------------------------
      Total |     55,479      100.00

. 
. *Outcome dates
. di d(1jan2021) /*study start*/
22281

. *22281
. di d(01mar2021) 
22340

. *22340
. di d(01may2021)
22401

. *22401
. di d(01july2021)
22462

. *22462
. di d(01sept2021) 
22524

. *22524
. di d(01nov2021) 
22585

. *22585
. di d(01jan2022)
22646

. *22646
. di d(01mar2022)
22705

. *22705
. di d(21feb2022)
22697

. *22697
. 
. gen agegp=0 if age<=65
(30,221 missing values generated)

. replace agegp=1 if age>65
(30,221 real changes made)

. tab agegp, miss

      agegp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,238       78.01       78.01
          1 |     30,221       21.99      100.00
------------+-----------------------------------
      Total |    137,459      100.00

. 
. foreach age in 0 1 {
  2. foreach outcome of any covid_tpp_prob covidadmission covid_death    {
  3. summ  `outcome' if agegp==`age', format d 
  4. summ patient_id if `outcome'==1 & date_`outcome'<=22697 & agegp==`age'
  5. local total_`outcome'=`r(N)'
  6. hist date_`outcome' if date_`outcome'<=22697 & agegp==`age', saving(output
> /`outcome'_age`age', replace) ///
> xlabel(22281 22340 22401 22462 22524 22585 22646 22705,labsize(tiny))  xtitle
> (, size(vsmall)) ///
> graphregion(color(white))  legend(off) freq  ///
> ylabel(0 5000,labsize(tiny))  ytitle("Number", size(vsmall)) ///
> title("N=`total_`outcome''", size(vsmall)) width(5) yline(5, lcolor(black%100
> )  lwidth(thick)) color(black%100)
  7. }
  8. }

       Failure/censoring indicator for outcome: covid
                          prob case
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             107,238
25%            1              0       Sum of Wgt.     107,238

50%            1                      Mean           .8006583
                        Largest       Std. Dev.      .3995073
75%            1              1
90%            1              1       Variance        .159606
95%            1              1       Skewness      -1.505153
99%            1              1       Kurtosis       3.265485

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     85,861    997844.9    576985.7         67    1999974
(bin=86, start=22270, width=5)
(file output/covid_tpp_prob_age0.gph saved)

     Failure/censoring indicator for outcome: covid SUS
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             107,238
25%            0              0       Sum of Wgt.     107,238

50%            0                      Mean           .2988586
                        Largest       Std. Dev.      .4577599
75%            1              1
90%            1              1       Variance       .2095441
95%            1              1       Skewness       .8788115
99%            1              1       Kurtosis        1.77231

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     32,049    999283.2    576672.1        161    1999974
(bin=86, start=22269, width=5)
(file output/covidadmission_age0.gph saved)

       Failure/censoring indicator for outcome: covid
                            death
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             107,238
25%            0              0       Sum of Wgt.     107,238

50%            0                      Mean           .4049777
                        Largest       Std. Dev.        .49089
75%            1              1
90%            1              1       Variance        .240973
95%            1              1       Skewness       .3871447
99%            1              1       Kurtosis       1.149881

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     43,429    995418.8    575331.2         67    1999974
(bin=86, start=22270, width=5)
(file output/covid_death_age0.gph saved)

       Failure/censoring indicator for outcome: covid
                          prob case
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              30,221
25%            1              0       Sum of Wgt.      30,221

50%            1                      Mean           .8030178
                        Largest       Std. Dev.      .3977254
75%            1              1
90%            1              1       Variance       .1581855
95%            1              1       Skewness      -1.523779
99%            1              1       Kurtosis       3.321902

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     24,268     1000107    573434.6         46    1999680
(bin=86, start=22270, width=5)
(file output/covid_tpp_prob_age1.gph saved)

     Failure/censoring indicator for outcome: covid SUS
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              30,221
25%            0              0       Sum of Wgt.      30,221

50%            0                      Mean           .2934052
                        Largest       Std. Dev.      .4553301
75%            1              1
90%            1              1       Variance       .2073255
95%            1              1       Skewness       .9074655
99%            1              1       Kurtosis       1.823494

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      8,867     1005391    572660.6         28    1999830
(bin=86, start=22269, width=5)
(file output/covidadmission_age1.gph saved)

       Failure/censoring indicator for outcome: covid
                            death
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              30,221
25%            0              0       Sum of Wgt.      30,221

50%            0                      Mean           .4075312
                        Largest       Std. Dev.      .4913833
75%            1              1
90%            1              1       Variance       .2414575
95%            1              1       Skewness       .3763675
99%            1              1       Kurtosis       1.141652

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     12,316     1003277    573882.5        489    1999673
(bin=86, start=22270, width=5)
(file output/covid_death_age1.gph saved)

. 
. 
. di (5/4000)*100
.125

. *addplot(pci 0 20 .1 20): With the 2 supplied coordinates, we are just 
. *connecting the line from the point (y=0,x=20) to (y=.1,x=20) -- a 
. *vertical line at x=20. 
. 
. * Combine histograms
. graph combine output/covid_tpp_prob_age0.gph output/covid_tpp_prob_age1.gph /
> //
> output/covidadmission_age0.gph output/covidadmission_age1.gph ///
> output/covid_death_age0.gph output/covid_death_age1.gph, graphregion(color(wh
> ite)) col(2) ysize(10)

. graph export "output/01_histogram_outcomes.svg", as(svg) replace 
(note: file output/01_histogram_outcomes.svg not found)
(file output/01_histogram_outcomes.svg written in SVG format)

. 
. *censor dates
. summ dereg_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dereg_date |        734   01sep2021    147.7921  15dec2020  15may2022

. summ has_12_m

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
has_12_m_f~p |    137,459    .9499851    .2179765          0          1

. 
. count if covid_vacc_date>=covid_vacc_second_dose_date
  6,850

. count if covid_vacc_second_dose_date >= covid_vacc_third_dose_date
  22,120

. count if covid_vacc_date >= covid_vacc_third_dose_date
  6,850

. 
. *Vacc data
. foreach age in 0 1 {
  2. foreach vacc of any covid_vacc_date covid_vacc_second_dose_date  covid_vac
> c_third_dose_date {
  3. summ  `vacc'  if agegp==`age', format d 
  4. summ patient_id if `vacc'!=. & `vacc'<=22697 & agegp==`age'
  5. local total=`r(N)' 
  6. hist `vacc' if `vacc'<=22697  & agegp==`age', saving(output/`vacc'_age`age
> ', replace) ///
> xlabel(22281 22340 22401 22462 22524 22585 22646 22705,labsize(tiny))  xtitle
> (, size(vsmall)) ///
> graphregion(color(white))  legend(off) freq ylabel(0 500000,labsize(tiny)) //
> /
> ytitle("Number", size(vsmall))   ///
> title("N=`total'", size(vsmall))  yline(5, lcolor(black%100)  lwidth(thick)) 
> color(black%100)
  7. }
  8. }

                       First vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    10dec2020      09dec2020
 5%    19dec2020      09dec2020
10%    29dec2020      09dec2020       Obs             101,931
25%    29jan2021      09dec2020       Sum of Wgt.     101,931

50%    21mar2021                      Mean          21mar2021
                        Largest       Std. Dev.      59.23779
75%    12may2021      01jul2021
90%    11jun2021      01jul2021       Variance       3509.116
95%    21jun2021      01jul2021       Skewness      -.0068829
99%    30jun2021      01jul2021       Kurtosis       1.799888

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |    101,931    998221.3    577364.6         67    1999974
(bin=50, start=22258, width=4.08)
(file output/covid_vacc_date_age0.gph saved)

                      Second vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    03jun2021      02jun2021
 5%    08jun2021      02jun2021
10%    15jun2021      02jun2021       Obs              90,037
25%    03jul2021      02jun2021       Sum of Wgt.      90,037

50%    03aug2021                      Mean          02aug2021
                        Largest       Std. Dev.      34.88454
75%    02sep2021      01oct2021
90%    19sep2021      01oct2021       Variance       1216.931
95%    25sep2021      01oct2021       Skewness      -.0201966
99%    30sep2021      01oct2021       Kurtosis       1.811198

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     90,037    997432.7    577713.8         67    1999974
(bin=49, start=22433, width=2.4693878)
(file output/covid_vacc_second_dose_date_age0.gph saved)

                       Third vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    04sep2021      02sep2021
 5%    15sep2021      02sep2021
10%    26sep2021      02sep2021       Obs              75,109
25%    27oct2021      02sep2021       Sum of Wgt.      75,109

50%    19dec2021                      Mean          18dec2021
                        Largest       Std. Dev.       60.3162
75%    09feb2022      01apr2022
90%    12mar2022      01apr2022       Variance       3638.044
95%    22mar2022      01apr2022       Skewness      -.0135955
99%    30mar2022      01apr2022       Kurtosis       1.812582

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     60,971    996877.9    577333.5         67    1999974
(bin=47, start=22525, width=3.6595745)
(file output/covid_vacc_third_dose_date_age0.gph saved)

                       First vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    10dec2020      09dec2020
 5%    19dec2020      09dec2020
10%    29dec2020      09dec2020       Obs              28,678
25%    29jan2021      09dec2020       Sum of Wgt.      28,678

50%    22mar2021                      Mean          21mar2021
                        Largest       Std. Dev.      59.18663
75%    12may2021      01jul2021
90%    11jun2021      01jul2021       Variance       3503.058
95%    22jun2021      01jul2021       Skewness      -.0071619
99%    30jun2021      01jul2021       Kurtosis       1.797598

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     28,678     1001967      575477         28    1999830
(bin=44, start=22258, width=4.6363636)
(file output/covid_vacc_date_age1.gph saved)

                      Second vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    03jun2021      02jun2021
 5%    08jun2021      02jun2021
10%    15jun2021      02jun2021       Obs              25,302
25%    04jul2021      02jun2021       Sum of Wgt.      25,302

50%    03aug2021                      Mean          02aug2021
                        Largest       Std. Dev.      34.74853
75%    02sep2021      01oct2021
90%    19sep2021      01oct2021       Variance        1207.46
95%    25sep2021      01oct2021       Skewness      -.0294947
99%    30sep2021      01oct2021       Kurtosis       1.823615

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     25,302     1002472    575706.3         28    1999830
(bin=44, start=22433, width=2.75)
(file output/covid_vacc_second_dose_date_age1.gph saved)

                       Third vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    04sep2021      02sep2021
 5%    15sep2021      02sep2021
10%    26sep2021      02sep2021       Obs              21,117
25%    28oct2021      02sep2021       Sum of Wgt.      21,117

50%    18dec2021                      Mean          18dec2021
                        Largest       Std. Dev.      60.19349
75%    09feb2022      01apr2022
90%    11mar2022      01apr2022       Variance       3623.256
95%    22mar2022      01apr2022       Skewness      -.0168131
99%    30mar2022      01apr2022       Kurtosis       1.821435

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     17,182     1003978    575572.7         46    1999830
(bin=42, start=22525, width=4.0952381)
(file output/covid_vacc_third_dose_date_age1.gph saved)

. 
. *Combine histograms
. graph combine output/covid_vacc_date_age0.gph output/covid_vacc_date_age1.gph
>   ///
> output/covid_vacc_second_dose_date_age0.gph output/covid_vacc_second_dose_dat
> e_age1.gph ///
> output/covid_vacc_third_dose_date_age0.gph output/covid_vacc_third_dose_date_
> age1.gph, ///
>  graphregion(color(white)) col(2)

. graph export "output/01_histogram_vaccinations.svg", as(svg) replace 
(note: file output/01_histogram_vaccinations.svg not found)
(file output/01_histogram_vaccinations.svg written in SVG format)

. 
. tab lft_pcr

    Type of |
 test taken |      Freq.     Percent        Cum.
------------+-----------------------------------
   LFT_Only |     54,862       39.91       39.91
LFT_WithPCR |     27,462       19.98       59.89
   PCR_Only |     55,135       40.11      100.00
------------+-----------------------------------
      Total |    137,459      100.00

. tab lft_pcr if date_covid_tpp_prob!=.

    Type of |
 test taken |      Freq.     Percent        Cum.
------------+-----------------------------------
   LFT_Only |     43,937       39.90       39.90
LFT_WithPCR |     21,972       19.95       59.85
   PCR_Only |     44,220       40.15      100.00
------------+-----------------------------------
      Total |    110,129      100.00

. tab kids_cat4 lft_pcr if date_covid_tpp_prob!=., col chi

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Exposure (v2) |        Type of test taken
   with 4-cats |  LFT_Only  LFT_Wit..   PCR_Only |     Total
---------------+---------------------------------+----------
          none |       157         74        130 |       361 
               |      0.36       0.34       0.29 |      0.33 
---------------+---------------------------------+----------
only <12 years |       370        188        402 |       960 
               |      0.84       0.86       0.91 |      0.87 
---------------+---------------------------------+----------
    only 12-18 |        90         35         77 |       202 
               |      0.20       0.16       0.17 |      0.18 
---------------+---------------------------------+----------
         mixed |    43,320     21,675     43,611 |   108,606 
               |     98.60      98.65      98.62 |     98.62 
---------------+---------------------------------+----------
         Total |    43,937     21,972     44,220 |   110,129 
               |    100.00     100.00     100.00 |    100.00 

          Pearson chi2(6) =   5.9897   Pr = 0.424

. 
. 
. 
. /* LOGICAL RELATIONSHIPS=====================================================
> =*/ 
. 
. *HH variables
. safetab kids_cat4 tot_adults_hh
0

**TABLE OF kids_cat4 tot_adults_hh REDACTED DUE TO SMALL N**


. safetab number_kids tot_adults_hh
0

**TABLE OF number_kids tot_adults_hh REDACTED DUE TO SMALL N**


. safetab household_size tot_adults_hh
0

**TABLE OF household_size tot_adults_hh REDACTED DUE TO SMALL N**


. 
. * BMI
. bysort bmicat: summ bmi

-------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     12,629     16.8268    1.005818   15.00009   18.49985

-------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     31,210    21.86334     1.85765   18.50012   24.99974

-------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     24,619    27.44472    1.433535   25.00008   29.99987

-------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     19,013      32.346    1.437625   30.00029   34.99904

-------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     11,799    37.23428    1.426106   35.00001   39.99969

-------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      7,837    43.43812     2.57782   40.00031   49.99836

-------------------------------------------------------------------------------
-> bmicat = Unknown (.u)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. safetab bmicat obese4cat, m
17

                     |     Evidence of obesity (4 categories)
         Grouped BMI | No record  Obese I (  Obese II   Obese III |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |    12,629          0          0          0 |    12,629 
  Normal (18.5-24.9) |    31,210          0          0          0 |    31,210 
Overweight (25-29.9) |    24,619          0          0          0 |    24,619 
   Obese I (30-34.9) |         0     19,013          0          0 |    19,013 
  Obese II (35-39.9) |         0          0     11,799          0 |    11,799 
     Obese III (40+) |         0          0          0      7,837 |     7,837 
        Unknown (.u) |    30,352          0          0          0 |    30,352 
---------------------+--------------------------------------------+----------
               Total |    98,810     19,013     11,799      7,837 |   137,459 

. 
. * Age
. bysort agegroup: summ age

-------------------------------------------------------------------------------
-> agegroup = 18-<30

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     26,704    23.73446    3.410861         18         29

-------------------------------------------------------------------------------
-> agegroup = 30-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     23,308    34.47799    2.884958         30         39

-------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     22,470    44.66453    2.854391         40         49

-------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     23,267    54.42274    2.867949         50         59

-------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     18,839    64.44472    2.879283         60         69

-------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     14,348    74.04495    2.848514         70         79

-------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,523    85.68474     4.81044         80        109


. safetab agegroup age66, m
15

   Grouped |  66 years and older
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    26,704          0 |    26,704 
    30-<40 |    23,308          0 |    23,308 
    40-<50 |    22,470          0 |    22,470 
    50-<60 |    23,267          0 |    23,267 
    60-<70 |    13,295      5,544 |    18,839 
    70-<80 |         0     14,348 |    14,348 
       80+ |         0      8,523 |     8,523 
-----------+----------------------+----------
     Total |   109,044     28,415 |   137,459 

. 
. * Smoking
. safetab smoke smoke_nomiss, m
19

             |  Smoking status (missing set to
     Smoking |               non)
      status |     Never     Former    Current |     Total
-------------+---------------------------------+----------
       Never |     5,638          0          0 |     5,638 
      Former |         0      2,758          0 |     2,758 
     Current |         0          0     16,483 |    16,483 
Unknown (.u) |   112,580          0          0 |   112,580 
-------------+---------------------------------+----------
       Total |   118,218      2,758     16,483 |   137,459 

. 
. * Diabetes
. *safetab diabcat diabetes, m
. 
. * CKD
. safetab reduced egfr_cat, m
17

       Reduced kidney |               Calculated eGFR
             function |        30         45         60          . |     Total
----------------------+--------------------------------------------+----------
                 None |         0          0    128,619      7,247 |   135,866 
Stage 3a/3b egfr 30-6 |        42      1,551          0          0 |     1,593 
----------------------+--------------------------------------------+----------
                Total |        42      1,551    128,619      7,247 |   137,459 

. * CKD
. safetab reduced esrd, m
13

                      |    End-stage renal
       Reduced kidney |        disease
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    86,844     49,022 |   135,866 
Stage 3a/3b egfr 30-6 |     1,006        587 |     1,593 
----------------------+----------------------+----------
                Total |    87,850     49,609 |   137,459 

. 
. /* EXPECTED RELATIONSHIPS====================================================
> =*/ 
. 
. /*  Relationships between demographic/lifestyle variables  */
. safetab agegroup bmicat,        row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |                      Grouped BMI
       age | Underweig  Normal (1  Overweigh  Obese I (  Obese II  |     Total
-----------+-------------------------------------------------------+----------
    18-<30 |     2,321      5,532      4,418      3,405      2,052 |    19,074 
           |     12.17      29.00      23.16      17.85      10.76 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 |     2,112      5,379      4,305      3,367      2,026 |    18,560 
           |     11.38      28.98      23.20      18.14      10.92 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 |     2,171      5,227      4,141      3,051      1,972 |    17,884 
           |     12.14      29.23      23.15      17.06      11.03 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 |     2,109      5,361      4,255      3,255      2,114 |    18,448 
           |     11.43      29.06      23.06      17.64      11.46 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 |     1,842      4,404      3,406      2,636      1,626 |    15,043 
           |     12.24      29.28      22.64      17.52      10.81 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 |     1,344      3,319      2,566      2,052      1,248 |    11,331 
           |     11.86      29.29      22.65      18.11      11.01 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |       730      1,988      1,528      1,247        761 |     6,767 
           |     10.79      29.38      22.58      18.43      11.25 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |    12,629     31,210     24,619     19,013     11,799 |   107,107 
           |     11.79      29.14      22.99      17.75      11.02 |    100.00 


           |  Grouped
   Grouped |    BMI
       age | Obese III |     Total
-----------+-----------+----------
    18-<30 |     1,346 |    19,074 
           |      7.06 |    100.00 
-----------+-----------+----------
    30-<40 |     1,371 |    18,560 
           |      7.39 |    100.00 
-----------+-----------+----------
    40-<50 |     1,322 |    17,884 
           |      7.39 |    100.00 
-----------+-----------+----------
    50-<60 |     1,354 |    18,448 
           |      7.34 |    100.00 
-----------+-----------+----------
    60-<70 |     1,129 |    15,043 
           |      7.51 |    100.00 
-----------+-----------+----------
    70-<80 |       802 |    11,331 
           |      7.08 |    100.00 
-----------+-----------+----------
       80+ |       513 |     6,767 
           |      7.58 |    100.00 
-----------+-----------+----------
     Total |     7,837 |   107,107 
           |      7.32 |    100.00 

. safetab agegroup smoke,         row  
15

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |          Smoking status
       age |     Never     Former    Current |     Total
-----------+---------------------------------+----------
    18-<30 |     1,027        505      3,201 |     4,733 
           |     21.70      10.67      67.63 |    100.00 
-----------+---------------------------------+----------
    30-<40 |       963        492      2,868 |     4,323 
           |     22.28      11.38      66.34 |    100.00 
-----------+---------------------------------+----------
    40-<50 |       981        454      2,715 |     4,150 
           |     23.64      10.94      65.42 |    100.00 
-----------+---------------------------------+----------
    50-<60 |       937        474      2,759 |     4,170 
           |     22.47      11.37      66.16 |    100.00 
-----------+---------------------------------+----------
    60-<70 |       803        389      2,232 |     3,424 
           |     23.45      11.36      65.19 |    100.00 
-----------+---------------------------------+----------
    70-<80 |       584        274      1,726 |     2,584 
           |     22.60      10.60      66.80 |    100.00 
-----------+---------------------------------+----------
       80+ |       343        170        982 |     1,495 
           |     22.94      11.37      65.69 |    100.00 
-----------+---------------------------------+----------
     Total |     5,638      2,758     16,483 |    24,879 
           |     22.66      11.09      66.25 |    100.00 

. safetab agegroup ethnicity, row 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |            Ethnicity
       age |     White  Asian or       Other |     Total
-----------+---------------------------------+----------
    18-<30 |    21,376      2,701      2,627 |    26,704 
           |     80.05      10.11       9.84 |    100.00 
-----------+---------------------------------+----------
    30-<40 |    18,724      2,334      2,250 |    23,308 
           |     80.33      10.01       9.65 |    100.00 
-----------+---------------------------------+----------
    40-<50 |    17,981      2,244      2,245 |    22,470 
           |     80.02       9.99       9.99 |    100.00 
-----------+---------------------------------+----------
    50-<60 |    18,630      2,326      2,311 |    23,267 
           |     80.07      10.00       9.93 |    100.00 
-----------+---------------------------------+----------
    60-<70 |    15,134      1,841      1,864 |    18,839 
           |     80.33       9.77       9.89 |    100.00 
-----------+---------------------------------+----------
    70-<80 |    11,433      1,426      1,489 |    14,348 
           |     79.68       9.94      10.38 |    100.00 
-----------+---------------------------------+----------
       80+ |     6,835        810        878 |     8,523 
           |     80.19       9.50      10.30 |    100.00 
-----------+---------------------------------+----------
     Total |   110,113     13,682     13,664 |   137,459 
           |     80.11       9.95       9.94 |    100.00 

. safetab agegroup imd,           row 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Index of Multiple Deprivation
   Grouped |              (IMD)
       age | 1 least d          4  5 most de |     Total
-----------+---------------------------------+----------
    18-<30 |    18,679      5,381      2,644 |    26,704 
           |     69.95      20.15       9.90 |    100.00 
-----------+---------------------------------+----------
    30-<40 |    16,343      4,635      2,330 |    23,308 
           |     70.12      19.89      10.00 |    100.00 
-----------+---------------------------------+----------
    40-<50 |    15,714      4,566      2,190 |    22,470 
           |     69.93      20.32       9.75 |    100.00 
-----------+---------------------------------+----------
    50-<60 |    16,187      4,800      2,280 |    23,267 
           |     69.57      20.63       9.80 |    100.00 
-----------+---------------------------------+----------
    60-<70 |    13,060      3,868      1,911 |    18,839 
           |     69.32      20.53      10.14 |    100.00 
-----------+---------------------------------+----------
    70-<80 |    10,101      2,835      1,412 |    14,348 
           |     70.40      19.76       9.84 |    100.00 
-----------+---------------------------------+----------
       80+ |     5,941      1,713        869 |     8,523 
           |     69.71      20.10      10.20 |    100.00 
-----------+---------------------------------+----------
     Total |    96,025     27,798     13,636 |   137,459 
           |     69.86      20.22       9.92 |    100.00 

. safetab agegroup shield,    row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Probable shielding
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     4,088     22,616 |    26,704 
           |     15.31      84.69 |    100.00 
-----------+----------------------+----------
    30-<40 |     3,542     19,766 |    23,308 
           |     15.20      84.80 |    100.00 
-----------+----------------------+----------
    40-<50 |     3,461     19,009 |    22,470 
           |     15.40      84.60 |    100.00 
-----------+----------------------+----------
    50-<60 |     3,564     19,703 |    23,267 
           |     15.32      84.68 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,899     15,940 |    18,839 
           |     15.39      84.61 |    100.00 
-----------+----------------------+----------
    70-<80 |     2,150     12,198 |    14,348 
           |     14.98      85.02 |    100.00 
-----------+----------------------+----------
       80+ |     1,300      7,223 |     8,523 
           |     15.25      84.75 |    100.00 
-----------+----------------------+----------
     Total |    21,004    116,455 |   137,459 
           |     15.28      84.72 |    100.00 

. 
. safetab bmicat smoke,            row   
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |          Smoking status
         Grouped BMI |     Never     Former    Current |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |       531        248      1,524 |     2,303 
                     |     23.06      10.77      66.17 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |     1,294        654      3,658 |     5,606 
                     |     23.08      11.67      65.25 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |       997        499      2,941 |     4,437 
                     |     22.47      11.25      66.28 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |       795        375      2,314 |     3,484 
                     |     22.82      10.76      66.42 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |       473        237      1,427 |     2,137 
                     |     22.13      11.09      66.78 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |       336        158        941 |     1,435 
                     |     23.41      11.01      65.57 |    100.00 
---------------------+---------------------------------+----------
               Total |     4,426      2,171     12,805 |    19,402 
                     |     22.81      11.19      66.00 |    100.00 

. safetab bmicat ethnicity,        row 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |            Ethnicity
         Grouped BMI |     White  Asian or       Other |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |    10,129      1,233      1,267 |    12,629 
                     |     80.20       9.76      10.03 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |    24,999      3,106      3,105 |    31,210 
                     |     80.10       9.95       9.95 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |    19,725      2,477      2,417 |    24,619 
                     |     80.12      10.06       9.82 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |    15,284      1,836      1,893 |    19,013 
                     |     80.39       9.66       9.96 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |     9,409      1,209      1,181 |    11,799 
                     |     79.74      10.25      10.01 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |     6,253        842        742 |     7,837 
                     |     79.79      10.74       9.47 |    100.00 
---------------------+---------------------------------+----------
               Total |    85,799     10,703     10,605 |   107,107 
                     |     80.11       9.99       9.90 |    100.00 

. safetab bmicat imd,              row 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Index of Multiple Deprivation
                     |              (IMD)
         Grouped BMI | 1 least d          4  5 most de |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |     8,953      2,494      1,182 |    12,629 
                     |     70.89      19.75       9.36 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |    21,865      6,254      3,091 |    31,210 
                     |     70.06      20.04       9.90 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |    17,103      4,985      2,531 |    24,619 
                     |     69.47      20.25      10.28 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |    13,244      3,859      1,910 |    19,013 
                     |     69.66      20.30      10.05 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |     8,245      2,441      1,113 |    11,799 
                     |     69.88      20.69       9.43 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |     5,464      1,637        736 |     7,837 
                     |     69.72      20.89       9.39 |    100.00 
---------------------+---------------------------------+----------
               Total |    74,874     21,670     10,563 |   107,107 
                     |     69.91      20.23       9.86 |    100.00 

. safetab bmicat hypertension, row 
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |       Diagnosed
                     |     hypertension
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    10,135      2,494 |    12,629 
                     |     80.25      19.75 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    25,054      6,156 |    31,210 
                     |     80.28      19.72 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |    19,640      4,979 |    24,619 
                     |     79.78      20.22 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |    15,165      3,848 |    19,013 
                     |     79.76      20.24 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |     9,466      2,333 |    11,799 
                     |     80.23      19.77 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |     6,303      1,534 |     7,837 
                     |     80.43      19.57 |    100.00 
---------------------+----------------------+----------
               Total |    85,763     21,344 |   107,107 
                     |     80.07      19.93 |    100.00 

. safetab bmicat shield,    row 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Probable shielding
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     1,954     10,675 |    12,629 
                     |     15.47      84.53 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     4,697     26,513 |    31,210 
                     |     15.05      84.95 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     3,776     20,843 |    24,619 
                     |     15.34      84.66 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |     3,004     16,009 |    19,013 
                     |     15.80      84.20 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,782     10,017 |    11,799 
                     |     15.10      84.90 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |     1,142      6,695 |     7,837 
                     |     14.57      85.43 |    100.00 
---------------------+----------------------+----------
               Total |    16,355     90,752 |   107,107 
                     |     15.27      84.73 |    100.00 

. 
.                             
. safetab smoke ethnicity,        row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |            Ethnicity
      status |     White  Asian or       Other |     Total
-------------+---------------------------------+----------
       Never |     4,505        572        561 |     5,638 
             |     79.90      10.15       9.95 |    100.00 
-------------+---------------------------------+----------
      Former |     2,199        277        282 |     2,758 
             |     79.73      10.04      10.22 |    100.00 
-------------+---------------------------------+----------
     Current |    13,152      1,697      1,634 |    16,483 
             |     79.79      10.30       9.91 |    100.00 
-------------+---------------------------------+----------
       Total |    19,856      2,546      2,477 |    24,879 
             |     79.81      10.23       9.96 |    100.00 

. safetab smoke imd,                      row 
10

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Index of Multiple Deprivation
     Smoking |              (IMD)
      status | 1 least d          4  5 most de |     Total
-------------+---------------------------------+----------
       Never |     3,923      1,165        550 |     5,638 
             |     69.58      20.66       9.76 |    100.00 
-------------+---------------------------------+----------
      Former |     1,965        536        257 |     2,758 
             |     71.25      19.43       9.32 |    100.00 
-------------+---------------------------------+----------
     Current |    11,649      3,230      1,604 |    16,483 
             |     70.67      19.60       9.73 |    100.00 
-------------+---------------------------------+----------
       Total |    17,537      4,931      2,411 |    24,879 
             |     70.49      19.82       9.69 |    100.00 

. safetab smoke hypertension, row 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     4,564      1,074 |     5,638 
             |     80.95      19.05 |    100.00 
-------------+----------------------+----------
      Former |     2,182        576 |     2,758 
             |     79.12      20.88 |    100.00 
-------------+----------------------+----------
     Current |    13,213      3,270 |    16,483 
             |     80.16      19.84 |    100.00 
-------------+----------------------+----------
       Total |    19,959      4,920 |    24,879 
             |     80.22      19.78 |    100.00 

. safetab smoke shield,    row 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Probable shielding
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       884      4,754 |     5,638 
             |     15.68      84.32 |    100.00 
-------------+----------------------+----------
      Former |       422      2,336 |     2,758 
             |     15.30      84.70 |    100.00 
-------------+----------------------+----------
     Current |     2,528     13,955 |    16,483 
             |     15.34      84.66 |    100.00 
-------------+----------------------+----------
       Total |     3,834     21,045 |    24,879 
             |     15.41      84.59 |    100.00 

.                       
. safetab ethnicity imd,          row 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |  Index of Multiple Deprivation
                      |              (IMD)
            Ethnicity | 1 least d          4  5 most de |     Total
----------------------+---------------------------------+----------
                White |    76,987     22,223     10,903 |   110,113 
                      |     69.92      20.18       9.90 |    100.00 
----------------------+---------------------------------+----------
Asian or Asian Britis |     9,438      2,862      1,382 |    13,682 
                      |     68.98      20.92      10.10 |    100.00 
----------------------+---------------------------------+----------
                Other |     9,600      2,713      1,351 |    13,664 
                      |     70.26      19.86       9.89 |    100.00 
----------------------+---------------------------------+----------
                Total |    96,025     27,798     13,636 |   137,459 
                      |     69.86      20.22       9.92 |    100.00 

. safetab shield imd,             row 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Index of Multiple Deprivation
  Probable |              (IMD)
 shielding | 1 least d          4  5 most de |     Total
-----------+---------------------------------+----------
         0 |    14,688      4,289      2,027 |    21,004 
           |     69.93      20.42       9.65 |    100.00 
-----------+---------------------------------+----------
         1 |    81,337     23,509     11,609 |   116,455 
           |     69.84      20.19       9.97 |    100.00 
-----------+---------------------------------+----------
     Total |    96,025     27,798     13,636 |   137,459 
           |     69.86      20.22       9.92 |    100.00 

. 
. safetab shield ethnicity,               row 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Probable |            Ethnicity
 shielding |     White  Asian or       Other |     Total
-----------+---------------------------------+----------
         0 |    16,828      2,132      2,044 |    21,004 
           |     80.12      10.15       9.73 |    100.00 
-----------+---------------------------------+----------
         1 |    93,285     11,550     11,620 |   116,455 
           |     80.10       9.92       9.98 |    100.00 
-----------+---------------------------------+----------
     Total |   110,113     13,682     13,664 |   137,459 
           |     80.11       9.95       9.94 |    100.00 

. 
. 
. 
. * Relationships with age
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>                    ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension            ///          
>    
>                                                                              
>    {
  2. 
.                 
.         safetab agegroup `var', row 
  3.  }
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |    Asthma category
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    24,579      2,125 |    26,704 
           |     92.04       7.96 |    100.00 
-----------+----------------------+----------
    30-<40 |    21,441      1,867 |    23,308 
           |     91.99       8.01 |    100.00 
-----------+----------------------+----------
    40-<50 |    20,707      1,763 |    22,470 
           |     92.15       7.85 |    100.00 
-----------+----------------------+----------
    50-<60 |    21,402      1,865 |    23,267 
           |     91.98       8.02 |    100.00 
-----------+----------------------+----------
    60-<70 |    17,341      1,498 |    18,839 
           |     92.05       7.95 |    100.00 
-----------+----------------------+----------
    70-<80 |    13,188      1,160 |    14,348 
           |     91.92       8.08 |    100.00 
-----------+----------------------+----------
       80+ |     7,813        710 |     8,523 
           |     91.67       8.33 |    100.00 
-----------+----------------------+----------
     Total |   126,471     10,988 |   137,459 
           |     92.01       7.99 |    100.00 
37

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    21,412      5,292 |    26,704 
           |     80.18      19.82 |    100.00 
-----------+----------------------+----------
    30-<40 |    18,669      4,639 |    23,308 
           |     80.10      19.90 |    100.00 
-----------+----------------------+----------
    40-<50 |    17,937      4,533 |    22,470 
           |     79.83      20.17 |    100.00 
-----------+----------------------+----------
    50-<60 |    18,616      4,651 |    23,267 
           |     80.01      19.99 |    100.00 
-----------+----------------------+----------
    60-<70 |    15,142      3,697 |    18,839 
           |     80.38      19.62 |    100.00 
-----------+----------------------+----------
    70-<80 |    11,420      2,928 |    14,348 
           |     79.59      20.41 |    100.00 
-----------+----------------------+----------
       80+ |     6,803      1,720 |     8,523 
           |     79.82      20.18 |    100.00 
-----------+----------------------+----------
     Total |   109,999     27,460 |   137,459 
           |     80.02      19.98 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    21,304      5,400 |    26,704 
           |     79.78      20.22 |    100.00 
-----------+----------------------+----------
    30-<40 |    18,641      4,667 |    23,308 
           |     79.98      20.02 |    100.00 
-----------+----------------------+----------
    40-<50 |    17,970      4,500 |    22,470 
           |     79.97      20.03 |    100.00 
-----------+----------------------+----------
    50-<60 |    18,609      4,658 |    23,267 
           |     79.98      20.02 |    100.00 
-----------+----------------------+----------
    60-<70 |    15,029      3,810 |    18,839 
           |     79.78      20.22 |    100.00 
-----------+----------------------+----------
    70-<80 |    11,541      2,807 |    14,348 
           |     80.44      19.56 |    100.00 
-----------+----------------------+----------
       80+ |     6,843      1,680 |     8,523 
           |     80.29      19.71 |    100.00 
-----------+----------------------+----------
     Total |   109,937     27,522 |   137,459 
           |     79.98      20.02 |    100.00 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |                        Diabetes
       age | No diabet  T1DM, con  T1DM, unc  T2DM, con  T2DM, unc |     Total
-----------+-------------------------------------------------------+----------
    18-<30 |    20,669        675        152      4,229        951 |    26,704 
           |     77.40       2.53       0.57      15.84       3.56 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 |    18,007        582        125      3,727        847 |    23,308 
           |     77.26       2.50       0.54      15.99       3.63 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 |    17,292        558        112      3,676        810 |    22,470 
           |     76.96       2.48       0.50      16.36       3.60 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 |    17,965        558        116      3,795        810 |    23,267 
           |     77.21       2.40       0.50      16.31       3.48 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 |    14,561        441         99      3,010        718 |    18,839 
           |     77.29       2.34       0.53      15.98       3.81 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 |    11,088        342         84      2,317        508 |    14,348 
           |     77.28       2.38       0.59      16.15       3.54 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |     6,540        201         52      1,394        325 |     8,523 
           |     76.73       2.36       0.61      16.36       3.81 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |   106,122      3,357        740     22,148      4,969 |   137,459 
           |     77.20       2.44       0.54      16.11       3.61 |    100.00 


   Grouped |  Diabetes
       age | Diabetes, |     Total
-----------+-----------+----------
    18-<30 |        28 |    26,704 
           |      0.10 |    100.00 
-----------+-----------+----------
    30-<40 |        20 |    23,308 
           |      0.09 |    100.00 
-----------+-----------+----------
    40-<50 |        22 |    22,470 
           |      0.10 |    100.00 
-----------+-----------+----------
    50-<60 |        23 |    23,267 
           |      0.10 |    100.00 
-----------+-----------+----------
    60-<70 |        10 |    18,839 
           |      0.05 |    100.00 
-----------+-----------+----------
    70-<80 |         9 |    14,348 
           |      0.06 |    100.00 
-----------+-----------+----------
       80+ |        11 |     8,523 
           |      0.13 |    100.00 
-----------+-----------+----------
     Total |       123 |   137,459 
           |      0.09 |    100.00 
31

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Chronic liver disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    21,315      5,389 |    26,704 
           |     79.82      20.18 |    100.00 
-----------+----------------------+----------
    30-<40 |    18,638      4,670 |    23,308 
           |     79.96      20.04 |    100.00 
-----------+----------------------+----------
    40-<50 |    17,904      4,566 |    22,470 
           |     79.68      20.32 |    100.00 
-----------+----------------------+----------
    50-<60 |    18,657      4,610 |    23,267 
           |     80.19      19.81 |    100.00 
-----------+----------------------+----------
    60-<70 |    15,087      3,752 |    18,839 
           |     80.08      19.92 |    100.00 
-----------+----------------------+----------
    70-<80 |    11,471      2,877 |    14,348 
           |     79.95      20.05 |    100.00 
-----------+----------------------+----------
       80+ |     6,815      1,708 |     8,523 
           |     79.96      20.04 |    100.00 
-----------+----------------------+----------
     Total |   109,887     27,572 |   137,459 
           |     79.94      20.06 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Neurological disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    21,362      5,342 |    26,704 
           |     80.00      20.00 |    100.00 
-----------+----------------------+----------
    30-<40 |    18,500      4,808 |    23,308 
           |     79.37      20.63 |    100.00 
-----------+----------------------+----------
    40-<50 |    18,053      4,417 |    22,470 
           |     80.34      19.66 |    100.00 
-----------+----------------------+----------
    50-<60 |    18,530      4,737 |    23,267 
           |     79.64      20.36 |    100.00 
-----------+----------------------+----------
    60-<70 |    15,075      3,764 |    18,839 
           |     80.02      19.98 |    100.00 
-----------+----------------------+----------
    70-<80 |    11,530      2,818 |    14,348 
           |     80.36      19.64 |    100.00 
-----------+----------------------+----------
       80+ |     6,807      1,716 |     8,523 
           |     79.87      20.13 |    100.00 
-----------+----------------------+----------
     Total |   109,857     27,602 |   137,459 
           |     79.92      20.08 |    100.00 
25

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Stroke or dementia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    21,497      5,207 |    26,704 
           |     80.50      19.50 |    100.00 
-----------+----------------------+----------
    30-<40 |    18,769      4,539 |    23,308 
           |     80.53      19.47 |    100.00 
-----------+----------------------+----------
    40-<50 |    17,956      4,514 |    22,470 
           |     79.91      20.09 |    100.00 
-----------+----------------------+----------
    50-<60 |    18,675      4,592 |    23,267 
           |     80.26      19.74 |    100.00 
-----------+----------------------+----------
    60-<70 |    14,984      3,855 |    18,839 
           |     79.54      20.46 |    100.00 
-----------+----------------------+----------
    70-<80 |    11,484      2,864 |    14,348 
           |     80.04      19.96 |    100.00 
-----------+----------------------+----------
       80+ |     6,828      1,695 |     8,523 
           |     80.11      19.89 |    100.00 
-----------+----------------------+----------
     Total |   110,193     27,266 |   137,459 
           |     80.16      19.84 |    100.00 
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Autoimmune disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    21,305      5,399 |    26,704 
           |     79.78      20.22 |    100.00 
-----------+----------------------+----------
    30-<40 |    18,687      4,621 |    23,308 
           |     80.17      19.83 |    100.00 
-----------+----------------------+----------
    40-<50 |    18,041      4,429 |    22,470 
           |     80.29      19.71 |    100.00 
-----------+----------------------+----------
    50-<60 |    18,565      4,702 |    23,267 
           |     79.79      20.21 |    100.00 
-----------+----------------------+----------
    60-<70 |    15,049      3,790 |    18,839 
           |     79.88      20.12 |    100.00 
-----------+----------------------+----------
    70-<80 |    11,525      2,823 |    14,348 
           |     80.32      19.68 |    100.00 
-----------+----------------------+----------
       80+ |     6,774      1,749 |     8,523 
           |     79.48      20.52 |    100.00 
-----------+----------------------+----------
     Total |   109,946     27,513 |   137,459 
           |     79.98      20.02 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
   Grouped |      algorithm)
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    21,343      5,361 |    26,704 
           |     79.92      20.08 |    100.00 
-----------+----------------------+----------
    30-<40 |    18,624      4,684 |    23,308 
           |     79.90      20.10 |    100.00 
-----------+----------------------+----------
    40-<50 |    18,029      4,441 |    22,470 
           |     80.24      19.76 |    100.00 
-----------+----------------------+----------
    50-<60 |    18,623      4,644 |    23,267 
           |     80.04      19.96 |    100.00 
-----------+----------------------+----------
    60-<70 |    15,085      3,754 |    18,839 
           |     80.07      19.93 |    100.00 
-----------+----------------------+----------
    70-<80 |    11,473      2,875 |    14,348 
           |     79.96      20.04 |    100.00 
-----------+----------------------+----------
       80+ |     6,845      1,678 |     8,523 
           |     80.31      19.69 |    100.00 
-----------+----------------------+----------
     Total |   110,022     27,437 |   137,459 
           |     80.04      19.96 |    100.00 
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Other solid organ
   Grouped |      transplant
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    21,398      5,306 |    26,704 
           |     80.13      19.87 |    100.00 
-----------+----------------------+----------
    30-<40 |    18,666      4,642 |    23,308 
           |     80.08      19.92 |    100.00 
-----------+----------------------+----------
    40-<50 |    17,963      4,507 |    22,470 
           |     79.94      20.06 |    100.00 
-----------+----------------------+----------
    50-<60 |    18,684      4,583 |    23,267 
           |     80.30      19.70 |    100.00 
-----------+----------------------+----------
    60-<70 |    15,072      3,767 |    18,839 
           |     80.00      20.00 |    100.00 
-----------+----------------------+----------
    70-<80 |    11,442      2,906 |    14,348 
           |     79.75      20.25 |    100.00 
-----------+----------------------+----------
       80+ |     6,804      1,719 |     8,523 
           |     79.83      20.17 |    100.00 
-----------+----------------------+----------
     Total |   110,029     27,430 |   137,459 
           |     80.04      19.96 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |       Asplenia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    21,292      5,412 |    26,704 
           |     79.73      20.27 |    100.00 
-----------+----------------------+----------
    30-<40 |    18,628      4,680 |    23,308 
           |     79.92      20.08 |    100.00 
-----------+----------------------+----------
    40-<50 |    17,939      4,531 |    22,470 
           |     79.84      20.16 |    100.00 
-----------+----------------------+----------
    50-<60 |    18,673      4,594 |    23,267 
           |     80.26      19.74 |    100.00 
-----------+----------------------+----------
    60-<70 |    15,011      3,828 |    18,839 
           |     79.68      20.32 |    100.00 
-----------+----------------------+----------
    70-<80 |    11,491      2,857 |    14,348 
           |     80.09      19.91 |    100.00 
-----------+----------------------+----------
       80+ |     6,816      1,707 |     8,523 
           |     79.97      20.03 |    100.00 
-----------+----------------------+----------
     Total |   109,850     27,609 |   137,459 
           |     79.91      20.09 |    100.00 
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |          Non-haematological cancer
       age |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
    18-<30 |    21,413         94        416      4,781 |    26,704 
           |     80.19       0.35       1.56      17.90 |    100.00 
-----------+--------------------------------------------+----------
    30-<40 |    18,822         86        336      4,064 |    23,308 
           |     80.75       0.37       1.44      17.44 |    100.00 
-----------+--------------------------------------------+----------
    40-<50 |    18,128         96        332      3,914 |    22,470 
           |     80.68       0.43       1.48      17.42 |    100.00 
-----------+--------------------------------------------+----------
    50-<60 |    18,740        115        386      4,026 |    23,267 
           |     80.54       0.49       1.66      17.30 |    100.00 
-----------+--------------------------------------------+----------
    60-<70 |    15,081         70        307      3,381 |    18,839 
           |     80.05       0.37       1.63      17.95 |    100.00 
-----------+--------------------------------------------+----------
    70-<80 |    11,478         59        231      2,580 |    14,348 
           |     80.00       0.41       1.61      17.98 |    100.00 
-----------+--------------------------------------------+----------
       80+ |     6,782         34        147      1,560 |     8,523 
           |     79.57       0.40       1.72      18.30 |    100.00 
-----------+--------------------------------------------+----------
     Total |   110,444        554      2,155     24,306 |   137,459 
           |     80.35       0.40       1.57      17.68 |    100.00 
25

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |            Haematological cancer
       age |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
    18-<30 |    21,483        107        417      4,697 |    26,704 
           |     80.45       0.40       1.56      17.59 |    100.00 
-----------+--------------------------------------------+----------
    30-<40 |    18,713         99        322      4,174 |    23,308 
           |     80.29       0.42       1.38      17.91 |    100.00 
-----------+--------------------------------------------+----------
    40-<50 |    18,063         88        337      3,982 |    22,470 
           |     80.39       0.39       1.50      17.72 |    100.00 
-----------+--------------------------------------------+----------
    50-<60 |    18,613         90        347      4,217 |    23,267 
           |     80.00       0.39       1.49      18.12 |    100.00 
-----------+--------------------------------------------+----------
    60-<70 |    15,224         81        241      3,293 |    18,839 
           |     80.81       0.43       1.28      17.48 |    100.00 
-----------+--------------------------------------------+----------
    70-<80 |    11,588         49        199      2,512 |    14,348 
           |     80.76       0.34       1.39      17.51 |    100.00 
-----------+--------------------------------------------+----------
       80+ |     6,762         36        136      1,589 |     8,523 
           |     79.34       0.42       1.60      18.64 |    100.00 
-----------+--------------------------------------------+----------
     Total |   110,446        550      1,999     24,464 |   137,459 
           |     80.35       0.40       1.45      17.80 |    100.00 
37

**TABLE OF agegroup reduced_kidney_function_cat REDACTED DUE TO SMALL N**

14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    End-stage renal
   Grouped |        disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    17,122      9,582 |    26,704 
           |     64.12      35.88 |    100.00 
-----------+----------------------+----------
    30-<40 |    14,808      8,500 |    23,308 
           |     63.53      36.47 |    100.00 
-----------+----------------------+----------
    40-<50 |    14,411      8,059 |    22,470 
           |     64.13      35.87 |    100.00 
-----------+----------------------+----------
    50-<60 |    14,880      8,387 |    23,267 
           |     63.95      36.05 |    100.00 
-----------+----------------------+----------
    60-<70 |    12,071      6,768 |    18,839 
           |     64.07      35.93 |    100.00 
-----------+----------------------+----------
    70-<80 |     9,161      5,187 |    14,348 
           |     63.85      36.15 |    100.00 
-----------+----------------------+----------
       80+ |     5,397      3,126 |     8,523 
           |     63.32      36.68 |    100.00 
-----------+----------------------+----------
     Total |    87,850     49,609 |   137,459 
           |     63.91      36.09 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
   Grouped |     hypertension
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    21,392      5,312 |    26,704 
           |     80.11      19.89 |    100.00 
-----------+----------------------+----------
    30-<40 |    18,559      4,749 |    23,308 
           |     79.63      20.37 |    100.00 
-----------+----------------------+----------
    40-<50 |    18,034      4,436 |    22,470 
           |     80.26      19.74 |    100.00 
-----------+----------------------+----------
    50-<60 |    18,673      4,594 |    23,267 
           |     80.26      19.74 |    100.00 
-----------+----------------------+----------
    60-<70 |    15,079      3,760 |    18,839 
           |     80.04      19.96 |    100.00 
-----------+----------------------+----------
    70-<80 |    11,518      2,830 |    14,348 
           |     80.28      19.72 |    100.00 
-----------+----------------------+----------
       80+ |     6,838      1,685 |     8,523 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
     Total |   110,093     27,366 |   137,459 
           |     80.09      19.91 |    100.00 

. 
. 
. *Relationships with sex
. foreach var of varlist asthma                                           ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>            ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension                     /// 
>    
>                                                                              
>    {
  2.                                                 
.         safetab male `var', row 
  3. }
12

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Asthma category
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    64,697      5,647 |    70,344 
           |     91.97       8.03 |    100.00 
-----------+----------------------+----------
         1 |    61,774      5,341 |    67,115 
           |     92.04       7.96 |    100.00 
-----------+----------------------+----------
     Total |   126,471     10,988 |   137,459 
           |     92.01       7.99 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    56,269     14,075 |    70,344 
           |     79.99      20.01 |    100.00 
-----------+----------------------+----------
         1 |    53,730     13,385 |    67,115 
           |     80.06      19.94 |    100.00 
-----------+----------------------+----------
     Total |   109,999     27,460 |   137,459 
           |     80.02      19.98 |    100.00 
29

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    56,365     13,979 |    70,344 
           |     80.13      19.87 |    100.00 
-----------+----------------------+----------
         1 |    53,572     13,543 |    67,115 
           |     79.82      20.18 |    100.00 
-----------+----------------------+----------
     Total |   109,937     27,522 |   137,459 
           |     79.98      20.02 |    100.00 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |                        Diabetes
      Male | No diabet  T1DM, con  T1DM, unc  T2DM, con  T2DM, unc |     Total
-----------+-------------------------------------------------------+----------
         0 |    54,282      1,725        397     11,331      2,544 |    70,344 
           |     77.17       2.45       0.56      16.11       3.62 |    100.00 
-----------+-------------------------------------------------------+----------
         1 |    51,840      1,632        343     10,817      2,425 |    67,115 
           |     77.24       2.43       0.51      16.12       3.61 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |   106,122      3,357        740     22,148      4,969 |   137,459 
           |     77.20       2.44       0.54      16.11       3.61 |    100.00 


           |  Diabetes
      Male | Diabetes, |     Total
-----------+-----------+----------
         0 |        65 |    70,344 
           |      0.09 |    100.00 
-----------+-----------+----------
         1 |        58 |    67,115 
           |      0.09 |    100.00 
-----------+-----------+----------
     Total |       123 |   137,459 
           |      0.09 |    100.00 
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Chronic liver disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    56,154     14,190 |    70,344 
           |     79.83      20.17 |    100.00 
-----------+----------------------+----------
         1 |    53,733     13,382 |    67,115 
           |     80.06      19.94 |    100.00 
-----------+----------------------+----------
     Total |   109,887     27,572 |   137,459 
           |     79.94      20.06 |    100.00 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Neurological disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    56,212     14,132 |    70,344 
           |     79.91      20.09 |    100.00 
-----------+----------------------+----------
         1 |    53,645     13,470 |    67,115 
           |     79.93      20.07 |    100.00 
-----------+----------------------+----------
     Total |   109,857     27,602 |   137,459 
           |     79.92      20.08 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Stroke or dementia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    56,425     13,919 |    70,344 
           |     80.21      19.79 |    100.00 
-----------+----------------------+----------
         1 |    53,768     13,347 |    67,115 
           |     80.11      19.89 |    100.00 
-----------+----------------------+----------
     Total |   110,193     27,266 |   137,459 
           |     80.16      19.84 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Autoimmune disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    56,217     14,127 |    70,344 
           |     79.92      20.08 |    100.00 
-----------+----------------------+----------
         1 |    53,729     13,386 |    67,115 
           |     80.06      19.94 |    100.00 
-----------+----------------------+----------
     Total |   109,946     27,513 |   137,459 
           |     79.98      20.02 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
           |      algorithm)
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    56,373     13,971 |    70,344 
           |     80.14      19.86 |    100.00 
-----------+----------------------+----------
         1 |    53,649     13,466 |    67,115 
           |     79.94      20.06 |    100.00 
-----------+----------------------+----------
     Total |   110,022     27,437 |   137,459 
           |     80.04      19.96 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Other solid organ
           |      transplant
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    56,225     14,119 |    70,344 
           |     79.93      20.07 |    100.00 
-----------+----------------------+----------
         1 |    53,804     13,311 |    67,115 
           |     80.17      19.83 |    100.00 
-----------+----------------------+----------
     Total |   110,029     27,430 |   137,459 
           |     80.04      19.96 |    100.00 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Asplenia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    56,296     14,048 |    70,344 
           |     80.03      19.97 |    100.00 
-----------+----------------------+----------
         1 |    53,554     13,561 |    67,115 
           |     79.79      20.21 |    100.00 
-----------+----------------------+----------
     Total |   109,850     27,609 |   137,459 
           |     79.91      20.09 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |          Non-haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 |    56,455        302      1,095     12,492 |    70,344 
           |     80.26       0.43       1.56      17.76 |    100.00 
-----------+--------------------------------------------+----------
         1 |    53,989        252      1,060     11,814 |    67,115 
           |     80.44       0.38       1.58      17.60 |    100.00 
-----------+--------------------------------------------+----------
     Total |   110,444        554      2,155     24,306 |   137,459 
           |     80.35       0.40       1.57      17.68 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |            Haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 |    56,486        290      1,059     12,509 |    70,344 
           |     80.30       0.41       1.51      17.78 |    100.00 
-----------+--------------------------------------------+----------
         1 |    53,960        260        940     11,955 |    67,115 
           |     80.40       0.39       1.40      17.81 |    100.00 
-----------+--------------------------------------------+----------
     Total |   110,446        550      1,999     24,464 |   137,459 
           |     80.35       0.40       1.45      17.80 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Reduced kidney
           |       function
      Male |      None  Stage 3a/ |     Total
-----------+----------------------+----------
         0 |    68,784      1,560 |    70,344 
           |     97.78       2.22 |    100.00 
-----------+----------------------+----------
         1 |    67,082         33 |    67,115 
           |     99.95       0.05 |    100.00 
-----------+----------------------+----------
     Total |   135,866      1,593 |   137,459 
           |     98.84       1.16 |    100.00 
10

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    End-stage renal
           |        disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    45,051     25,293 |    70,344 
           |     64.04      35.96 |    100.00 
-----------+----------------------+----------
         1 |    42,799     24,316 |    67,115 
           |     63.77      36.23 |    100.00 
-----------+----------------------+----------
     Total |    87,850     49,609 |   137,459 
           |     63.91      36.09 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
           |     hypertension
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    56,221     14,123 |    70,344 
           |     79.92      20.08 |    100.00 
-----------+----------------------+----------
         1 |    53,872     13,243 |    67,115 
           |     80.27      19.73 |    100.00 
-----------+----------------------+----------
     Total |   110,093     27,366 |   137,459 
           |     80.09      19.91 |    100.00 

. 
. *Relationships with smoking
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>            ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension                         
>    ///
>                                         {
  2.         
.         safetab smoke `var', row 
  3. }
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |    Asthma category
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     5,189        449 |     5,638 
             |     92.04       7.96 |    100.00 
-------------+----------------------+----------
      Former |     2,549        209 |     2,758 
             |     92.42       7.58 |    100.00 
-------------+----------------------+----------
     Current |    15,164      1,319 |    16,483 
             |     92.00       8.00 |    100.00 
-------------+----------------------+----------
       Total |    22,902      1,977 |    24,879 
             |     92.05       7.95 |    100.00 
34

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Chronic Respiratory
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     4,509      1,129 |     5,638 
             |     79.98      20.02 |    100.00 
-------------+----------------------+----------
      Former |     2,180        578 |     2,758 
             |     79.04      20.96 |    100.00 
-------------+----------------------+----------
     Current |    13,229      3,254 |    16,483 
             |     80.26      19.74 |    100.00 
-------------+----------------------+----------
       Total |    19,918      4,961 |    24,879 
             |     80.06      19.94 |    100.00 
30

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    Chronic Cardiac
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     4,549      1,089 |     5,638 
             |     80.68      19.32 |    100.00 
-------------+----------------------+----------
      Former |     2,182        576 |     2,758 
             |     79.12      20.88 |    100.00 
-------------+----------------------+----------
     Current |    13,182      3,301 |    16,483 
             |     79.97      20.03 |    100.00 
-------------+----------------------+----------
       Total |    19,913      4,966 |    24,879 
             |     80.04      19.96 |    100.00 
14

**TABLE OF smoke diabcat REDACTED DUE TO SMALL N**

28

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Chronic liver disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     4,559      1,079 |     5,638 
             |     80.86      19.14 |    100.00 
-------------+----------------------+----------
      Former |     2,213        545 |     2,758 
             |     80.24      19.76 |    100.00 
-------------+----------------------+----------
     Current |    13,187      3,296 |    16,483 
             |     80.00      20.00 |    100.00 
-------------+----------------------+----------
       Total |    19,959      4,920 |    24,879 
             |     80.22      19.78 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Neurological disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     4,523      1,115 |     5,638 
             |     80.22      19.78 |    100.00 
-------------+----------------------+----------
      Former |     2,235        523 |     2,758 
             |     81.04      18.96 |    100.00 
-------------+----------------------+----------
     Current |    13,183      3,300 |    16,483 
             |     79.98      20.02 |    100.00 
-------------+----------------------+----------
       Total |    19,941      4,938 |    24,879 
             |     80.15      19.85 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Stroke or dementia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     4,514      1,124 |     5,638 
             |     80.06      19.94 |    100.00 
-------------+----------------------+----------
      Former |     2,200        558 |     2,758 
             |     79.77      20.23 |    100.00 
-------------+----------------------+----------
     Current |    13,218      3,265 |    16,483 
             |     80.19      19.81 |    100.00 
-------------+----------------------+----------
       Total |    19,932      4,947 |    24,879 
             |     80.12      19.88 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Autoimmune disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     4,505      1,133 |     5,638 
             |     79.90      20.10 |    100.00 
-------------+----------------------+----------
      Former |     2,172        586 |     2,758 
             |     78.75      21.25 |    100.00 
-------------+----------------------+----------
     Current |    13,163      3,320 |    16,483 
             |     79.86      20.14 |    100.00 
-------------+----------------------+----------
       Total |    19,840      5,039 |    24,879 
             |     79.75      20.25 |    100.00 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Immunosuppressed
             |     (combination
     Smoking |      algorithm)
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     4,549      1,089 |     5,638 
             |     80.68      19.32 |    100.00 
-------------+----------------------+----------
      Former |     2,229        529 |     2,758 
             |     80.82      19.18 |    100.00 
-------------+----------------------+----------
     Current |    13,192      3,291 |    16,483 
             |     80.03      19.97 |    100.00 
-------------+----------------------+----------
       Total |    19,970      4,909 |    24,879 
             |     80.27      19.73 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Other solid organ
     Smoking |      transplant
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     4,474      1,164 |     5,638 
             |     79.35      20.65 |    100.00 
-------------+----------------------+----------
      Former |     2,209        549 |     2,758 
             |     80.09      19.91 |    100.00 
-------------+----------------------+----------
     Current |    13,159      3,324 |    16,483 
             |     79.83      20.17 |    100.00 
-------------+----------------------+----------
       Total |    19,842      5,037 |    24,879 
             |     79.75      20.25 |    100.00 
15

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |       Asplenia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     4,504      1,134 |     5,638 
             |     79.89      20.11 |    100.00 
-------------+----------------------+----------
      Former |     2,195        563 |     2,758 
             |     79.59      20.41 |    100.00 
-------------+----------------------+----------
     Current |    13,155      3,328 |    16,483 
             |     79.81      20.19 |    100.00 
-------------+----------------------+----------
       Total |    19,854      5,025 |    24,879 
             |     79.80      20.20 |    100.00 
24

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |          Non-haematological cancer
      status |     Never  Last year  2-5 years   5+ years |     Total
-------------+--------------------------------------------+----------
       Never |     4,536         31         91        980 |     5,638 
             |     80.45       0.55       1.61      17.38 |    100.00 
-------------+--------------------------------------------+----------
      Former |     2,196         12         37        513 |     2,758 
             |     79.62       0.44       1.34      18.60 |    100.00 
-------------+--------------------------------------------+----------
     Current |    13,284         57        277      2,865 |    16,483 
             |     80.59       0.35       1.68      17.38 |    100.00 
-------------+--------------------------------------------+----------
       Total |    20,016        100        405      4,358 |    24,879 
             |     80.45       0.40       1.63      17.52 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |            Haematological cancer
      status |     Never  Last year  2-5 years   5+ years |     Total
-------------+--------------------------------------------+----------
       Never |     4,548         22         69        999 |     5,638 
             |     80.67       0.39       1.22      17.72 |    100.00 
-------------+--------------------------------------------+----------
      Former |     2,208          9         34        507 |     2,758 
             |     80.06       0.33       1.23      18.38 |    100.00 
-------------+--------------------------------------------+----------
     Current |    13,297         60        250      2,876 |    16,483 
             |     80.67       0.36       1.52      17.45 |    100.00 
-------------+--------------------------------------------+----------
       Total |    20,053         91        353      4,382 |    24,879 
             |     80.60       0.37       1.42      17.61 |    100.00 
34

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    Reduced kidney
     Smoking |       function
      status |      None  Stage 3a/ |     Total
-------------+----------------------+----------
       Never |     5,569         69 |     5,638 
             |     98.78       1.22 |    100.00 
-------------+----------------------+----------
      Former |     2,737         21 |     2,758 
             |     99.24       0.76 |    100.00 
-------------+----------------------+----------
     Current |    16,312        171 |    16,483 
             |     98.96       1.04 |    100.00 
-------------+----------------------+----------
       Total |    24,618        261 |    24,879 
             |     98.95       1.05 |    100.00 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    End-stage renal
     Smoking |        disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     3,612      2,026 |     5,638 
             |     64.07      35.93 |    100.00 
-------------+----------------------+----------
      Former |     1,766        992 |     2,758 
             |     64.03      35.97 |    100.00 
-------------+----------------------+----------
     Current |    10,558      5,925 |    16,483 
             |     64.05      35.95 |    100.00 
-------------+----------------------+----------
       Total |    15,936      8,943 |    24,879 
             |     64.05      35.95 |    100.00 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     4,564      1,074 |     5,638 
             |     80.95      19.05 |    100.00 
-------------+----------------------+----------
      Former |     2,182        576 |     2,758 
             |     79.12      20.88 |    100.00 
-------------+----------------------+----------
     Current |    13,213      3,270 |    16,483 
             |     80.16      19.84 |    100.00 
-------------+----------------------+----------
       Total |    19,959      4,920 |    24,879 
             |     80.22      19.78 |    100.00 

. 
. 
. /* SENSE CHECK OUTCOMES======================================================
> =*/
. 
. 
. safecount if covidadmission==1 & covid_death==1
  12,476

. 
. sum positive_SGSS

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
positive_S~S |    137,459    .0401938    .1964142          0          1

. sum positive_SGSS if date_positive_SGSS<=22697

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
positive_S~S |      5,525           1           0          1          1

. 
. safetab positive_SGSS covid_primary_care_codes, row col miss
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |  Indicator positive
 Indicator |   primary care code
  positive |    COVID infection
covid test |         0          1 |     Total
-----------+----------------------+----------
         0 |    26,513    105,421 |   131,934 
           |     20.10      79.90 |    100.00 
           |     96.08      95.96 |     95.98 
-----------+----------------------+----------
         1 |     1,082      4,443 |     5,525 
           |     19.58      80.42 |    100.00 
           |      3.92       4.04 |      4.02 
-----------+----------------------+----------
     Total |    27,595    109,864 |   137,459 
           |     20.08      79.92 |    100.00 
           |    100.00     100.00 |    100.00 

. safetab positive_SGSS covid_primary_care_codes if date_positive_SGSS<=22697 &
>  date_covid_primary_care_codes<=22697, row col miss
107

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           | Indicator
           |  positive
           |  primary
           | care code
 Indicator |   COVID
  positive | infection
covid test |         1 |     Total
-----------+-----------+----------
         1 |     4,443 |     4,443 
           |    100.00 |    100.00 
           |    100.00 |    100.00 
-----------+-----------+----------
     Total |     4,443 |     4,443 
           |    100.00 |    100.00 
           |    100.00 |    100.00 

. gen diff=date_positive_SGSS-date_covid_primary_care_codes 
(133,016 missing values generated)

. sum diff, d

                            diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -118           -331
 5%          -48           -283
10%          -10           -242       Obs               4,443
25%           54           -223       Sum of Wgt.       4,443

50%          162                      Mean           163.0308
                        Largest       Std. Dev.      133.3166
75%          272            423
90%          343            424       Variance       17773.32
95%          373            427       Skewness      -.0909186
99%          409            427       Kurtosis       2.191265

. 
. tab reported if kids_cat4!=0 & age<=65

      Reported |
     Infection |
        Source |      Freq.     Percent        Cum.
---------------+-----------------------------------
          SGSS |     85,326       99.70       99.70
     test_code |         84        0.10       99.80
 sequalae_code |         82        0.10       99.90
diagnosis_code |         87        0.10      100.00
---------------+-----------------------------------
         Total |     85,579      100.00

. tab reported if kids_cat4==0 & age<=65

      Reported |
     Infection |
        Source |      Freq.     Percent        Cum.
---------------+-----------------------------------
          SGSS |        282      100.00      100.00
---------------+-----------------------------------
         Total |        282      100.00

. 
. 
. /* DEATHS by STP=======================================================*/
. tab  stp covid_death, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     8,124      5,619 |    13,743 
           |      9.94      10.08 |     10.00 
-----------+----------------------+----------
         2 |     8,124      5,498 |    13,622 
           |      9.94       9.86 |      9.91 
-----------+----------------------+----------
         3 |     8,132      5,552 |    13,684 
           |      9.95       9.96 |      9.95 
-----------+----------------------+----------
         4 |     8,103      5,649 |    13,752 
           |      9.92      10.13 |     10.00 
-----------+----------------------+----------
         5 |     8,140      5,653 |    13,793 
           |      9.96      10.14 |     10.03 
-----------+----------------------+----------
         6 |     8,263      5,499 |    13,762 
           |     10.11       9.86 |     10.01 
-----------+----------------------+----------
         7 |     8,185      5,635 |    13,820 
           |     10.02      10.11 |     10.05 
-----------+----------------------+----------
         8 |     8,292      5,530 |    13,822 
           |     10.15       9.92 |     10.06 
-----------+----------------------+----------
         9 |     8,178      5,567 |    13,745 
           |     10.01       9.99 |     10.00 
-----------+----------------------+----------
        10 |     8,173      5,543 |    13,716 
           |     10.00       9.94 |      9.98 
-----------+----------------------+----------
     Total |    81,714     55,745 |   137,459 
           |    100.00     100.00 |    100.00 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/02_an_data_checks.log
  log type:  text
 closed on:  15 Mar 2023, 13:54:05
-------------------------------------------------------------------------------
