-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/03a_an_descriptive_tables.log
  log type:  text
 opened on:  15 Mar 2023, 13:54:23

. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  3. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. safetab htdiag_or_highbp, m
 16. safetab imd 
 17. safetab imd, m
 18. safetab ethnicity
 19. safetab ethnicity, m
 20. safetab stp
 21. safetab tot_adults_hh
 22. safetab household_size
 23. safetab household_size imd, col chi
 24. 
. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat   ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 25.                                                 
. safetab `var'
 26. }
 27. safetab shield
 28. 
. 
. *Exposure 
. foreach var in kids_cat4 gp_number_kids {
 29. safetab `var'
 30. }
 31. 
. * Outcomes
. foreach var in  non_covid_death  ///
>  covid_tpp_prob {
 32. safetab `var'
 33. }
 34. 
. 
. * Outcomes by exposure
. foreach var in non_covid_death  ///
>  covid_tpp_prob {
 35. safetab `var'
 36. safetab `var' kids_cat4, col row
 37. safetab `var' gp_number_kids, col row
 38. 
. }
 39. 
. 
. **********************************
. *  Number (%) with each exposure  *
. **********************************
. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                     
>    kids_cat4, col
 40.         safetab male                                                      
>       kids_cat4, col
 41.         safetab bmicat                                                    
>       kids_cat4, col m 
 42.         safetab smoke                                                     
>       kids_cat4, col m
 43.         safetab obese4cat                                                 
>       kids_cat4, col m 
 44.         safetab shield                                                    
>       kids_cat4, col m 
 45.         safetab tot_adults_hh                                           ki
> ds_cat4, col m 
 46.         safetab household_size                                          ki
> ds_cat4, col m 
 47.         safetab imd                                                       
>       kids_cat4, col m
 48.         safetab ethnicity                                                 
>       kids_cat4, col m
 49.         safetab stp                                                       
>       kids_cat4, col
 50.         
.         
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 51.         safetab `var'           kids_cat4, col
 52. }
 53.         
. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    107,238    41.26402    13.53624         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |     26,704       24.90       24.90
     30-<40 |     23,308       21.73       46.64
     40-<50 |     22,470       20.95       67.59
     50-<60 |     23,267       21.70       89.29
     60-<70 |     11,489       10.71      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,238      100.00      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     54,876       51.17       51.17
          1 |     52,362       48.83      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      9,807       11.80       11.80
  Normal (18.5-24.9) |     24,197       29.10       40.90
Overweight (25-29.9) |     19,230       23.13       64.03
   Obese I (30-34.9) |     14,673       17.65       81.68
  Obese II (35-39.9) |      9,135       10.99       92.67
     Obese III (40+) |      6,096        7.33      100.00
---------------------+-----------------------------------
               Total |     83,138      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      9,807        9.15        9.15
  Normal (18.5-24.9) |     24,197       22.56       31.71
Overweight (25-29.9) |     19,230       17.93       49.64
   Obese I (30-34.9) |     14,673       13.68       63.32
  Obese II (35-39.9) |      9,135        8.52       71.84
     Obese III (40+) |      6,096        5.68       77.53
        Unknown (.u) |     24,100       22.47      100.00
---------------------+-----------------------------------
               Total |    107,238      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     77,334       72.11       72.11
   Obese I (30-34.9) |     14,673       13.68       85.80
  Obese II (35-39.9) |      9,135        8.52       94.32
     Obese III (40+) |      6,096        5.68      100.00
---------------------+-----------------------------------
               Total |    107,238      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      4,394       22.56       22.56
      Former |      2,168       11.13       33.69
     Current |     12,913       66.31      100.00
-------------+-----------------------------------
       Total |     19,475      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      4,394        4.10        4.10
      Former |      2,168        2.02        6.12
     Current |     12,913       12.04       18.16
Unknown (.u) |     87,763       81.84      100.00
-------------+-----------------------------------
       Total |    107,238      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |     24,122       24.89       24.89
      Elevated |     16,554       17.08       41.98
 High, stage I |     39,023       40.27       82.25
High, stage II |     17,201       17.75      100.00
---------------+-----------------------------------
         Total |     96,900      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |     24,122       22.49       22.49
      Elevated |     16,554       15.44       37.93
 High, stage I |     39,023       36.39       74.32
High, stage II |     17,201       16.04       90.36
       Unknown |     10,338        9.64      100.00
---------------+-----------------------------------
         Total |    107,238      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     72,020       67.16       67.16
          1 |     35,218       32.84      100.00
------------+-----------------------------------
      Total |    107,238      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     72,020       67.16       67.16
          1 |     35,218       32.84      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     74,900       69.84       69.84
               4 |     21,722       20.26       90.10
 5 most deprived |     10,616        9.90      100.00
-----------------+-----------------------------------
           Total |    107,238      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     74,900       69.84       69.84
               4 |     21,722       20.26       90.10
 5 most deprived |     10,616        9.90      100.00
-----------------+-----------------------------------
           Total |    107,238      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     85,933       80.13       80.13
Asian or Asian British |     10,742       10.02       90.15
                 Other |     10,563        9.85      100.00
-----------------------+-----------------------------------
                 Total |    107,238      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     85,933       80.13       80.13
Asian or Asian British |     10,742       10.02       90.15
                 Other |     10,563        9.85      100.00
-----------------------+-----------------------------------
                 Total |    107,238      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     10,744       10.02       10.02
          2 |     10,646        9.93       19.95
          3 |     10,626        9.91       29.86
          4 |     10,674        9.95       39.81
          5 |     10,700        9.98       49.79
          6 |     10,767       10.04       59.83
          7 |     10,774       10.05       69.87
          8 |     10,775       10.05       79.92
          9 |     10,806       10.08       90.00
         10 |     10,726       10.00      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         76        0.07        0.07
          2 |         97        0.09        0.16
          3 |    107,065       99.84      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

**TABLE OF household_size REDACTED DUE TO SMALL N**

19

**TABLE OF household_size imd REDACTED DUE TO SMALL N**

0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,900       80.10       80.10
          1 |     21,338       19.90      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     98,701       92.04       92.04
          1 |      8,537        7.96      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,699       79.91       79.91
          1 |     21,539       20.09      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     82,830       77.24       77.24
  T1DM, controlled |      2,625        2.45       79.69
T1DM, uncontrolled |        556        0.52       80.21
  T2DM, controlled |     17,287       16.12       96.33
T2DM, uncontrolled |      3,842        3.58       99.91
Diabetes, no HbA1c |         98        0.09      100.00
-------------------+-----------------------------------
             Total |    107,238      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     86,302       80.48       80.48
    Last year |        433        0.40       80.88
2-5 years ago |      1,654        1.54       82.42
     5+ years |     18,849       17.58      100.00
--------------+-----------------------------------
        Total |    107,238      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     86,119       80.31       80.31
    Last year |        432        0.40       80.71
2-5 years ago |      1,562        1.46       82.17
     5+ years |     19,125       17.83      100.00
--------------+-----------------------------------
        Total |    107,238      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,817       80.02       80.02
          1 |     21,421       19.98      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,921       80.12       80.12
          1 |     21,317       19.88      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,704       79.92       79.92
          1 |     21,534       20.08      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,707       79.92       79.92
          1 |     21,531       20.08      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,638       79.86       79.86
          1 |     21,600       20.14      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     86,061       80.25       80.25
          1 |     21,177       19.75      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

**TABLE OF egfr_cat REDACTED DUE TO SMALL N**

0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |    106,827       99.62       99.62
Stage 3a/3b egfr 30-60       |        411        0.38      100.00
-----------------------------+-----------------------------------
                       Total |    107,238      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,529       63.90       63.90
          1 |     38,709       36.10      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,827       80.03       80.03
          1 |     21,411       19.97      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,784       79.99       79.99
          1 |     21,454       20.01      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,412       15.30       15.30
          1 |     90,826       84.70      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

 Exposure (v2) |
   with 4-cats |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        347        0.32        0.32
only <12 years |        929        0.87        1.19
    only 12-18 |        198        0.18        1.37
         mixed |    105,764       98.63      100.00
---------------+-----------------------------------
         Total |    107,238      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
    1 child <12 |        269       28.96       28.96
 2 children <12 |        208       22.39       51.35
 3 children <12 |        159       17.12       68.46
4+ children <12 |        293       31.54      100.00
----------------+-----------------------------------
          Total |        929      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,377       73.09       73.09
          1 |     28,861       26.91      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,377       19.93       19.93
          1 |     85,861       80.07      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,377       73.09       73.09
          1 |     28,861       26.91      100.00
------------+-----------------------------------
      Total |    107,238      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |          Exposure (v2) with 4-cats
     death |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       247        693        146     77,291 |    78,377 
           |      0.32       0.88       0.19      98.61 |    100.00 
           |     71.18      74.60      73.74      73.08 |     73.09 
-----------+--------------------------------------------+----------
         1 |       100        236         52     28,473 |    28,861 
           |      0.35       0.82       0.18      98.66 |    100.00 
           |     28.82      25.40      26.26      26.92 |     26.91 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |      0.32       0.87       0.18      98.63 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |      Number kids under 12 years in hh
     death | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |       197        154        123        219 |       693 
           |     28.43      22.22      17.75      31.60 |    100.00 
           |     73.23      74.04      77.36      74.74 |     74.60 
-----------+--------------------------------------------+----------
         1 |        72         54         36         74 |       236 
           |     30.51      22.88      15.25      31.36 |    100.00 
           |     26.77      25.96      22.64      25.26 |     25.40 
-----------+--------------------------------------------+----------
     Total |       269        208        159        293 |       929 
           |     28.96      22.39      17.12      31.54 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,377       19.93       19.93
          1 |     85,861       80.07      100.00
------------+-----------------------------------
      Total |    107,238      100.00
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |          Exposure (v2) with 4-cats
      case |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        65        176         46     21,090 |    21,377 
           |      0.30       0.82       0.22      98.66 |    100.00 
           |     18.73      18.95      23.23      19.94 |     19.93 
-----------+--------------------------------------------+----------
         1 |       282        753        152     84,674 |    85,861 
           |      0.33       0.88       0.18      98.62 |    100.00 
           |     81.27      81.05      76.77      80.06 |     80.07 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |      0.32       0.87       0.18      98.63 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |      Number kids under 12 years in hh
      case | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |        54         38         28         56 |       176 
           |     30.68      21.59      15.91      31.82 |    100.00 
           |     20.07      18.27      17.61      19.11 |     18.95 
-----------+--------------------------------------------+----------
         1 |       215        170        131        237 |       753 
           |     28.55      22.58      17.40      31.47 |    100.00 
           |     79.93      81.73      82.39      80.89 |     81.05 
-----------+--------------------------------------------+----------
     Total |       269        208        159        293 |       929 
           |     28.96      22.39      17.12      31.54 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |          Exposure (v2) with 4-cats
       age |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
    18-<30 |        95        248         48     26,313 |    26,704 
           |     27.38      26.70      24.24      24.88 |     24.90 
-----------+--------------------------------------------+----------
    30-<40 |        83        205         37     22,983 |    23,308 
           |     23.92      22.07      18.69      21.73 |     21.73 
-----------+--------------------------------------------+----------
    40-<50 |        60        170         35     22,205 |    22,470 
           |     17.29      18.30      17.68      20.99 |     20.95 
-----------+--------------------------------------------+----------
    50-<60 |        74        218         51     22,924 |    23,267 
           |     21.33      23.47      25.76      21.67 |     21.70 
-----------+--------------------------------------------+----------
    60-<70 |        35         88         27     11,339 |    11,489 
           |     10.09       9.47      13.64      10.72 |     10.71 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
      Male |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       165        491         98     54,122 |    54,876 
           |     47.55      52.85      49.49      51.17 |     51.17 
-----------+--------------------------------------------+----------
         1 |       182        438        100     51,642 |    52,362 
           |     52.45      47.15      50.51      48.83 |     48.83 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |          Exposure (v2) with 4-cats
         Grouped BMI |      none  only <12   only 12-1      mixed |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |        22         91         19      9,675 |     9,807 
                     |      6.34       9.80       9.60       9.15 |      9.15 
---------------------+--------------------------------------------+----------
  Normal (18.5-24.9) |        84        211         48     23,854 |    24,197 
                     |     24.21      22.71      24.24      22.55 |     22.56 
---------------------+--------------------------------------------+----------
Overweight (25-29.9) |        65        158         31     18,976 |    19,230 
                     |     18.73      17.01      15.66      17.94 |     17.93 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) |        48        147         23     14,455 |    14,673 
                     |     13.83      15.82      11.62      13.67 |     13.68 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |        37         86         20      8,992 |     9,135 
                     |     10.66       9.26      10.10       8.50 |      8.52 
---------------------+--------------------------------------------+----------
     Obese III (40+) |        20         38         11      6,027 |     6,096 
                     |      5.76       4.09       5.56       5.70 |      5.68 
---------------------+--------------------------------------------+----------
        Unknown (.u) |        71        198         46     23,785 |    24,100 
                     |     20.46      21.31      23.23      22.49 |     22.47 
---------------------+--------------------------------------------+----------
               Total |       347        929        198    105,764 |   107,238 
                     |    100.00     100.00     100.00     100.00 |    100.00 
16

**TABLE OF smoke kids_cat4 REDACTED DUE TO SMALL N**

20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Evidence of obesity |          Exposure (v2) with 4-cats
      (4 categories) |      none  only <12   only 12-1      mixed |     Total
---------------------+--------------------------------------------+----------
No record of obesity |       242        658        144     76,290 |    77,334 
                     |     69.74      70.83      72.73      72.13 |     72.11 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) |        48        147         23     14,455 |    14,673 
                     |     13.83      15.82      11.62      13.67 |     13.68 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |        37         86         20      8,992 |     9,135 
                     |     10.66       9.26      10.10       8.50 |      8.52 
---------------------+--------------------------------------------+----------
     Obese III (40+) |        20         38         11      6,027 |     6,096 
                     |      5.76       4.09       5.56       5.70 |      5.68 
---------------------+--------------------------------------------+----------
               Total |       347        929        198    105,764 |   107,238 
                     |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Probable |          Exposure (v2) with 4-cats
 shielding |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        57        143         27     16,185 |    16,412 
           |     16.43      15.39      13.64      15.30 |     15.30 
-----------+--------------------------------------------+----------
         1 |       290        786        171     89,579 |    90,826 
           |     83.57      84.61      86.36      84.70 |     84.70 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
24

**TABLE OF tot_adults_hh kids_cat4 REDACTED DUE TO SMALL N**

25

**TABLE OF household_size kids_cat4 REDACTED DUE TO SMALL N**

14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |
     Deprivation |          Exposure (v2) with 4-cats
           (IMD) |      none  only <12   only 12-1      mixed |     Total
-----------------+--------------------------------------------+----------
1 least deprived |       255        656        139     73,850 |    74,900 
                 |     73.49      70.61      70.20      69.83 |     69.84 
-----------------+--------------------------------------------+----------
               4 |        59        190         36     21,437 |    21,722 
                 |     17.00      20.45      18.18      20.27 |     20.26 
-----------------+--------------------------------------------+----------
 5 most deprived |        33         83         23     10,477 |    10,616 
                 |      9.51       8.93      11.62       9.91 |      9.90 
-----------------+--------------------------------------------+----------
           Total |       347        929        198    105,764 |   107,238 
                 |    100.00     100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |          Exposure (v2) with 4-cats
            Ethnicity |      none  only <12   only 12-1      mixed |     Total
----------------------+--------------------------------------------+----------
                White |       269        740        157     84,767 |    85,933 
                      |     77.52      79.66      79.29      80.15 |     80.13 
----------------------+--------------------------------------------+----------
Asian or Asian Britis |        39         93         18     10,592 |    10,742 
                      |     11.24      10.01       9.09      10.01 |     10.02 
----------------------+--------------------------------------------+----------
                Other |        39         96         23     10,405 |    10,563 
                      |     11.24      10.33      11.62       9.84 |      9.85 
----------------------+--------------------------------------------+----------
                Total |       347        929        198    105,764 |   107,238 
                      |    100.00     100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |
      tion |
Partnershi |          Exposure (v2) with 4-cats
         p |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         1 |        35         68         19     10,622 |    10,744 
           |     10.09       7.32       9.60      10.04 |     10.02 
-----------+--------------------------------------------+----------
         2 |        27         89         19     10,511 |    10,646 
           |      7.78       9.58       9.60       9.94 |      9.93 
-----------+--------------------------------------------+----------
         3 |        24         92         20     10,490 |    10,626 
           |      6.92       9.90      10.10       9.92 |      9.91 
-----------+--------------------------------------------+----------
         4 |        43         95         14     10,522 |    10,674 
           |     12.39      10.23       7.07       9.95 |      9.95 
-----------+--------------------------------------------+----------
         5 |        37        104         15     10,544 |    10,700 
           |     10.66      11.19       7.58       9.97 |      9.98 
-----------+--------------------------------------------+----------
         6 |        39         95         25     10,608 |    10,767 
           |     11.24      10.23      12.63      10.03 |     10.04 
-----------+--------------------------------------------+----------
         7 |        41        105         18     10,610 |    10,774 
           |     11.82      11.30       9.09      10.03 |     10.05 
-----------+--------------------------------------------+----------
         8 |        37         90         16     10,632 |    10,775 
           |     10.66       9.69       8.08      10.05 |     10.05 
-----------+--------------------------------------------+----------
         9 |        33         90         18     10,665 |    10,806 
           |      9.51       9.69       9.09      10.08 |     10.08 
-----------+--------------------------------------------+----------
        10 |        31        101         34     10,560 |    10,726 
           |      8.93      10.87      17.17       9.98 |     10.00 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
Respirator |          Exposure (v2) with 4-cats
y Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       271        750        150     84,729 |    85,900 
           |     78.10      80.73      75.76      80.11 |     80.10 
-----------+--------------------------------------------+----------
         1 |        76        179         48     21,035 |    21,338 
           |     21.90      19.27      24.24      19.89 |     19.90 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Asthma |          Exposure (v2) with 4-cats
  category |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       317        854        185     97,345 |    98,701 
           |     91.35      91.93      93.43      92.04 |     92.04 
-----------+--------------------------------------------+----------
         1 |        30         75         13      8,419 |     8,537 
           |      8.65       8.07       6.57       7.96 |      7.96 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
   Cardiac |          Exposure (v2) with 4-cats
  Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       277        744        161     84,517 |    85,699 
           |     79.83      80.09      81.31      79.91 |     79.91 
-----------+--------------------------------------------+----------
         1 |        70        185         37     21,247 |    21,539 
           |     20.17      19.91      18.69      20.09 |     20.09 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
18

**TABLE OF diabcat kids_cat4 REDACTED DUE TO SMALL N**

28

**TABLE OF cancer_exhaem_cat kids_cat4 REDACTED DUE TO SMALL N**

26

**TABLE OF cancer_haem_cat kids_cat4 REDACTED DUE TO SMALL N**

23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |
        on |          Exposure (v2) with 4-cats
algorithm) |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       287        741        165     84,624 |    85,817 
           |     82.71      79.76      83.33      80.01 |     80.02 
-----------+--------------------------------------------+----------
         1 |        60        188         33     21,140 |    21,421 
           |     17.29      20.24      16.67      19.99 |     19.98 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |
     organ |          Exposure (v2) with 4-cats
transplant |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       274        737        159     84,751 |    85,921 
           |     78.96      79.33      80.30      80.13 |     80.12 
-----------+--------------------------------------------+----------
         1 |        73        192         39     21,013 |    21,317 
           |     21.04      20.67      19.70      19.87 |     19.88 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
  Asplenia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       283        748        160     84,513 |    85,704 
           |     81.56      80.52      80.81      79.91 |     79.92 
-----------+--------------------------------------------+----------
         1 |        64        181         38     21,251 |    21,534 
           |     18.44      19.48      19.19      20.09 |     20.08 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
     liver |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       280        749        157     84,521 |    85,707 
           |     80.69      80.62      79.29      79.91 |     79.92 
-----------+--------------------------------------------+----------
         1 |        67        180         41     21,243 |    21,531 
           |     19.31      19.38      20.71      20.09 |     20.08 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Neurologic |          Exposure (v2) with 4-cats
al disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       270        734        162     84,472 |    85,638 
           |     77.81      79.01      81.82      79.87 |     79.86 
-----------+--------------------------------------------+----------
         1 |        77        195         36     21,292 |    21,600 
           |     22.19      20.99      18.18      20.13 |     20.14 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Stroke or |          Exposure (v2) with 4-cats
  dementia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       278        749        164     84,870 |    86,061 
           |     80.12      80.62      82.83      80.24 |     80.25 
-----------+--------------------------------------------+----------
         1 |        69        180         34     20,894 |    21,177 
           |     19.88      19.38      17.17      19.76 |     19.75 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

**TABLE OF egfr_cat kids_cat4 REDACTED DUE TO SMALL N**

34

**TABLE OF reduced_kidney_function kids_cat4 REDACTED DUE TO SMALL N**

15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |
     renal |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       215        594        121     67,599 |    68,529 
           |     61.96      63.94      61.11      63.91 |     63.90 
-----------+--------------------------------------------+----------
         1 |       132        335         77     38,165 |    38,709 
           |     38.04      36.06      38.89      36.09 |     36.10 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |
hypertensi |          Exposure (v2) with 4-cats
        on |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       279        735        159     84,654 |    85,827 
           |     80.40      79.12      80.30      80.04 |     80.03 
-----------+--------------------------------------------+----------
         1 |        68        194         39     21,110 |    21,411 
           |     19.60      20.88      19.70      19.96 |     19.97 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Autoimmune |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       286        743        154     84,601 |    85,784 
           |     82.42      79.98      77.78      79.99 |     79.99 
-----------+--------------------------------------------+----------
         1 |        61        186         44     21,163 |    21,454 
           |     17.58      20.02      22.22      20.01 |     20.01 
-----------+--------------------------------------------+----------
     Total |       347        929        198    105,764 |   107,238 
           |    100.00     100.00     100.00     100.00 |    100.00 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     30,221    75.74121    7.507651         66        109
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |      7,350       24.32       24.32
     70-<80 |     14,348       47.48       71.80
        80+ |      8,523       28.20      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,806        5.98        5.98
          1 |     28,415       94.02      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,468       51.18       51.18
          1 |     14,753       48.82      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      2,822       11.77       11.77
  Normal (18.5-24.9) |      7,013       29.26       41.03
Overweight (25-29.9) |      5,389       22.48       63.52
   Obese I (30-34.9) |      4,340       18.11       81.62
  Obese II (35-39.9) |      2,664       11.11       92.74
     Obese III (40+) |      1,741        7.26      100.00
---------------------+-----------------------------------
               Total |     23,969      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      2,822        9.34        9.34
  Normal (18.5-24.9) |      7,013       23.21       32.54
Overweight (25-29.9) |      5,389       17.83       50.38
   Obese I (30-34.9) |      4,340       14.36       64.74
  Obese II (35-39.9) |      2,664        8.82       73.55
     Obese III (40+) |      1,741        5.76       79.31
        Unknown (.u) |      6,252       20.69      100.00
---------------------+-----------------------------------
               Total |     30,221      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     21,476       71.06       71.06
   Obese I (30-34.9) |      4,340       14.36       85.42
  Obese II (35-39.9) |      2,664        8.82       94.24
     Obese III (40+) |      1,741        5.76      100.00
---------------------+-----------------------------------
               Total |     30,221      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      1,244       23.02       23.02
      Former |        590       10.92       33.94
     Current |      3,570       66.06      100.00
-------------+-----------------------------------
       Total |      5,404      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      1,244        4.12        4.12
      Former |        590        1.95        6.07
     Current |      3,570       11.81       17.88
Unknown (.u) |     24,817       82.12      100.00
-------------+-----------------------------------
       Total |     30,221      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      6,708       24.64       24.64
      Elevated |      4,703       17.28       41.92
 High, stage I |     10,899       40.04       81.96
High, stage II |      4,912       18.04      100.00
---------------+-----------------------------------
         Total |     27,222      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      6,708       22.20       22.20
      Elevated |      4,703       15.56       37.76
 High, stage I |     10,899       36.06       73.82
High, stage II |      4,912       16.25       90.08
       Unknown |      2,999        9.92      100.00
---------------+-----------------------------------
         Total |     30,221      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,243       66.98       66.98
          1 |      9,978       33.02      100.00
------------+-----------------------------------
      Total |     30,221      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,243       66.98       66.98
          1 |      9,978       33.02      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     21,125       69.90       69.90
               4 |      6,076       20.11       90.01
 5 most deprived |      3,020        9.99      100.00
-----------------+-----------------------------------
           Total |     30,221      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     21,125       69.90       69.90
               4 |      6,076       20.11       90.01
 5 most deprived |      3,020        9.99      100.00
-----------------+-----------------------------------
           Total |     30,221      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     24,180       80.01       80.01
Asian or Asian British |      2,940        9.73       89.74
                 Other |      3,101       10.26      100.00
-----------------------+-----------------------------------
                 Total |     30,221      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     24,180       80.01       80.01
Asian or Asian British |      2,940        9.73       89.74
                 Other |      3,101       10.26      100.00
-----------------------+-----------------------------------
                 Total |     30,221      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,999        9.92        9.92
          2 |      2,976        9.85       19.77
          3 |      3,058       10.12       29.89
          4 |      3,078       10.18       40.07
          5 |      3,093       10.23       50.31
          6 |      2,995        9.91       60.22
          7 |      3,046       10.08       70.30
          8 |      3,047       10.08       80.38
          9 |      2,939        9.73       90.11
         10 |      2,990        9.89      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         19        0.06        0.06
          2 |         23        0.08        0.14
          3 |     30,179       99.86      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

**TABLE OF household_size REDACTED DUE TO SMALL N**

19

**TABLE OF household_size imd REDACTED DUE TO SMALL N**

0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,099       79.74       79.74
          1 |      6,122       20.26      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,770       91.89       91.89
          1 |      2,451        8.11      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,238       80.20       80.20
          1 |      5,983       19.80      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     23,292       77.07       77.07
  T1DM, controlled |        732        2.42       79.49
T1DM, uncontrolled |        184        0.61       80.10
  T2DM, controlled |      4,861       16.08       96.19
T2DM, uncontrolled |      1,127        3.73       99.92
Diabetes, no HbA1c |         25        0.08      100.00
-------------------+-----------------------------------
             Total |     30,221      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     24,142       79.88       79.88
    Last year |        121        0.40       80.29
2-5 years ago |        501        1.66       81.94
     5+ years |      5,457       18.06      100.00
--------------+-----------------------------------
        Total |     30,221      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     24,327       80.50       80.50
    Last year |        118        0.39       80.89
2-5 years ago |        437        1.45       82.33
     5+ years |      5,339       17.67      100.00
--------------+-----------------------------------
        Total |     30,221      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,205       80.09       80.09
          1 |      6,016       19.91      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,108       79.77       79.77
          1 |      6,113       20.23      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,146       79.90       79.90
          1 |      6,075       20.10      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,180       80.01       80.01
          1 |      6,041       19.99      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,219       80.14       80.14
          1 |      6,002       19.86      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,132       79.85       79.85
          1 |      6,089       20.15      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
         30 |         39        0.14        0.14
         45 |      1,143        3.98        4.12
         60 |     27,525       95.88      100.00
------------+-----------------------------------
      Total |     28,707      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |     29,039       96.09       96.09
Stage 3a/3b egfr 30-60       |      1,182        3.91      100.00
-----------------------------+-----------------------------------
                       Total |     30,221      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,321       63.93       63.93
          1 |     10,900       36.07      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,266       80.30       80.30
          1 |      5,955       19.70      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,162       79.95       79.95
          1 |      6,059       20.05      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,592       15.19       15.19
          1 |     25,629       84.81      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

 Exposure (v2) |
   with 4-cats |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |         88        0.29        0.29
only <12 years |        266        0.88        1.17
    only 12-18 |         60        0.20        1.37
         mixed |     29,807       98.63      100.00
---------------+-----------------------------------
         Total |     30,221      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
    1 child <12 |         88       33.08       33.08
 2 children <12 |         52       19.55       52.63
 3 children <12 |         49       18.42       71.05
4+ children <12 |         77       28.95      100.00
----------------+-----------------------------------
          Total |        266      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,184       73.41       73.41
          1 |      8,037       26.59      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,953       19.70       19.70
          1 |     24,268       80.30      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,184       73.41       73.41
          1 |      8,037       26.59      100.00
------------+-----------------------------------
      Total |     30,221      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |          Exposure (v2) with 4-cats
     death |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        65        188         45     21,886 |    22,184 
           |      0.29       0.85       0.20      98.66 |    100.00 
           |     73.86      70.68      75.00      73.43 |     73.41 
-----------+--------------------------------------------+----------
         1 |        23         78         15      7,921 |     8,037 
           |      0.29       0.97       0.19      98.56 |    100.00 
           |     26.14      29.32      25.00      26.57 |     26.59 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |      0.29       0.88       0.20      98.63 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |      Number kids under 12 years in hh
     death | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |        66         32         32         58 |       188 
           |     35.11      17.02      17.02      30.85 |    100.00 
           |     75.00      61.54      65.31      75.32 |     70.68 
-----------+--------------------------------------------+----------
         1 |        22         20         17         19 |        78 
           |     28.21      25.64      21.79      24.36 |    100.00 
           |     25.00      38.46      34.69      24.68 |     29.32 
-----------+--------------------------------------------+----------
     Total |        88         52         49         77 |       266 
           |     33.08      19.55      18.42      28.95 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,953       19.70       19.70
          1 |     24,268       80.30      100.00
------------+-----------------------------------
      Total |     30,221      100.00
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |          Exposure (v2) with 4-cats
      case |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |         9         59         10      5,875 |     5,953 
           |      0.15       0.99       0.17      98.69 |    100.00 
           |     10.23      22.18      16.67      19.71 |     19.70 
-----------+--------------------------------------------+----------
         1 |        79        207         50     23,932 |    24,268 
           |      0.33       0.85       0.21      98.62 |    100.00 
           |     89.77      77.82      83.33      80.29 |     80.30 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |      0.29       0.88       0.20      98.63 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |      Number kids under 12 years in hh
      case | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |        21         13          8         17 |        59 
           |     35.59      22.03      13.56      28.81 |    100.00 
           |     23.86      25.00      16.33      22.08 |     22.18 
-----------+--------------------------------------------+----------
         1 |        67         39         41         60 |       207 
           |     32.37      18.84      19.81      28.99 |    100.00 
           |     76.14      75.00      83.67      77.92 |     77.82 
-----------+--------------------------------------------+----------
     Total |        88         52         49         77 |       266 
           |     33.08      19.55      18.42      28.95 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |          Exposure (v2) with 4-cats
       age |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
    60-<70 |        26         55         17      7,252 |     7,350 
           |     29.55      20.68      28.33      24.33 |     24.32 
-----------+--------------------------------------------+----------
    70-<80 |        39        135         32     14,142 |    14,348 
           |     44.32      50.75      53.33      47.45 |     47.48 
-----------+--------------------------------------------+----------
       80+ |        23         76         11      8,413 |     8,523 
           |     26.14      28.57      18.33      28.22 |     28.20 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
      Male |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        42        131         28     15,267 |    15,468 
           |     47.73      49.25      46.67      51.22 |     51.18 
-----------+--------------------------------------------+----------
         1 |        46        135         32     14,540 |    14,753 
           |     52.27      50.75      53.33      48.78 |     48.82 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

**TABLE OF bmicat kids_cat4 REDACTED DUE TO SMALL N**

16

**TABLE OF smoke kids_cat4 REDACTED DUE TO SMALL N**

20

**TABLE OF obese4cat kids_cat4 REDACTED DUE TO SMALL N**

17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Probable |          Exposure (v2) with 4-cats
 shielding |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        14         31         13      4,534 |     4,592 
           |     15.91      11.65      21.67      15.21 |     15.19 
-----------+--------------------------------------------+----------
         1 |        74        235         47     25,273 |    25,629 
           |     84.09      88.35      78.33      84.79 |     84.81 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 
24

**TABLE OF tot_adults_hh kids_cat4 REDACTED DUE TO SMALL N**

25

**TABLE OF household_size kids_cat4 REDACTED DUE TO SMALL N**

14

**TABLE OF imd kids_cat4 REDACTED DUE TO SMALL N**

20

**TABLE OF ethnicity kids_cat4 REDACTED DUE TO SMALL N**

14

**TABLE OF stp kids_cat4 REDACTED DUE TO SMALL N**

38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
Respirator |          Exposure (v2) with 4-cats
y Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        71        222         52     23,754 |    24,099 
           |     80.68      83.46      86.67      79.69 |     79.74 
-----------+--------------------------------------------+----------
         1 |        17         44          8      6,053 |     6,122 
           |     19.32      16.54      13.33      20.31 |     20.26 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

**TABLE OF asthma kids_cat4 REDACTED DUE TO SMALL N**

34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
   Cardiac |          Exposure (v2) with 4-cats
  Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        64        204         47     23,923 |    24,238 
           |     72.73      76.69      78.33      80.26 |     80.20 
-----------+--------------------------------------------+----------
         1 |        24         62         13      5,884 |     5,983 
           |     27.27      23.31      21.67      19.74 |     19.80 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 
18

**TABLE OF diabcat kids_cat4 REDACTED DUE TO SMALL N**

28

**TABLE OF cancer_exhaem_cat kids_cat4 REDACTED DUE TO SMALL N**

26

**TABLE OF cancer_haem_cat kids_cat4 REDACTED DUE TO SMALL N**

23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |
        on |          Exposure (v2) with 4-cats
algorithm) |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        62        203         39     23,901 |    24,205 
           |     70.45      76.32      65.00      80.19 |     80.09 
-----------+--------------------------------------------+----------
         1 |        26         63         21      5,906 |     6,016 
           |     29.55      23.68      35.00      19.81 |     19.91 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |
     organ |          Exposure (v2) with 4-cats
transplant |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        70        218         46     23,774 |    24,108 
           |     79.55      81.95      76.67      79.76 |     79.77 
-----------+--------------------------------------------+----------
         1 |        18         48         14      6,033 |     6,113 
           |     20.45      18.05      23.33      20.24 |     20.23 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
  Asplenia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        75        210         53     23,808 |    24,146 
           |     85.23      78.95      88.33      79.87 |     79.90 
-----------+--------------------------------------------+----------
         1 |        13         56          7      5,999 |     6,075 
           |     14.77      21.05      11.67      20.13 |     20.10 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
     liver |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        72        227         51     23,830 |    24,180 
           |     81.82      85.34      85.00      79.95 |     80.01 
-----------+--------------------------------------------+----------
         1 |        16         39          9      5,977 |     6,041 
           |     18.18      14.66      15.00      20.05 |     19.99 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Neurologic |          Exposure (v2) with 4-cats
al disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        70        212         51     23,886 |    24,219 
           |     79.55      79.70      85.00      80.14 |     80.14 
-----------+--------------------------------------------+----------
         1 |        18         54          9      5,921 |     6,002 
           |     20.45      20.30      15.00      19.86 |     19.86 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Stroke or |          Exposure (v2) with 4-cats
  dementia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        66        211         49     23,806 |    24,132 
           |     75.00      79.32      81.67      79.87 |     79.85 
-----------+--------------------------------------------+----------
         1 |        22         55         11      6,001 |     6,089 
           |     25.00      20.68      18.33      20.13 |     20.15 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

**TABLE OF egfr_cat kids_cat4 REDACTED DUE TO SMALL N**

34

**TABLE OF reduced_kidney_function kids_cat4 REDACTED DUE TO SMALL N**

15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |
     renal |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        58        169         38     19,056 |    19,321 
           |     65.91      63.53      63.33      63.93 |     63.93 
-----------+--------------------------------------------+----------
         1 |        30         97         22     10,751 |    10,900 
           |     34.09      36.47      36.67      36.07 |     36.07 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |
hypertensi |          Exposure (v2) with 4-cats
        on |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        77        215         50     23,924 |    24,266 
           |     87.50      80.83      83.33      80.26 |     80.30 
-----------+--------------------------------------------+----------
         1 |        11         51         10      5,883 |     5,955 
           |     12.50      19.17      16.67      19.74 |     19.70 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Autoimmune |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        70        218         47     23,827 |    24,162 
           |     79.55      81.95      78.33      79.94 |     79.95 
-----------+--------------------------------------------+----------
         1 |        18         48         13      5,980 |     6,059 
           |     20.45      18.05      21.67      20.06 |     20.05 
-----------+--------------------------------------------+----------
     Total |        88        266         60     29,807 |    30,221 
           |    100.00     100.00     100.00     100.00 |    100.00 

. * Close the log file
. log close
      name:  <unnamed>
       log:  /workspace/logs/03a_an_descriptive_tables.log
  log type:  text
 closed on:  15 Mar 2023, 13:54:29
-------------------------------------------------------------------------------
