-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/03b_an_descriptive_table_1.log
  log type:  text
 opened on:  19 May 2022, 11:41:36

. 
. program define generaterow
  1. syntax, variable(varname) condition(string) outcome(string)
  2.         
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontent ("`variable'") _tab ("`condition'") _tab
  3.         
.         cou
  4.         local overalldenom=r(N)
  5.         
.         cou if `variable' `condition'
  6.         local rowdenom = r(N)
  7.         local colpct = 100*(r(N)/`overalldenom')
  8.         file write tablecontent (`rowdenom')  _tab %3.1f (`colpct') _tab
  9. 
.         cou if kids_cat4==0 
 10.         local coldenom = r(N)
 11.         cou if kids_cat4==0 & `variable' `condition'
 12.         local pct = 100*(r(N)/`coldenom')
 13.         file write tablecontent (r(N)) _tab %4.2f  (`pct')  _tab
 14.         
.         cou if kids_cat4==1 
 15.         local coldenom = r(N)
 16.         cou if kids_cat4==1 & `variable' `condition'
 17.         local pct = 100*(r(N)/`coldenom')
 18.         file write tablecontent (r(N)) _tab %4.2f  (`pct')  _tab
 19.         
.         cou if kids_cat4==2 
 20.         local coldenom = r(N)
 21.         cou if kids_cat4==2 & `variable' `condition'
 22.         local pct = 100*(r(N)/`coldenom')
 23.         file write tablecontent (r(N)) _tab %4.2f  (`pct')  _tab
 24. 
.         cou if kids_cat4==3 
 25.         local coldenom = r(N)
 26.         cou if kids_cat4==3 & `variable' `condition'
 27.         local pct = 100*(r(N)/`coldenom')
 28.         file write tablecontent (r(N)) _tab %4.2f  (`pct')  _n
 29.         
. end

. 
. *****************************************************************************
> **
. *Generic code to output one section (varible) within table (calls above)
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) start(real) end(real) [missing] outcome(string)
  2. 
.         foreach varlevel of numlist `start'/`end'{ 
  3.                 generaterow, variable(`variable') condition("==`varlevel'"
> ) outcome(kids_cat4)
  4.         }
  5.         if "`missing'"!="" generaterow, variable(`variable') condition(">=
> .") outcome(kids_cat4)
  6. 
. end

. 
. *****************************************************************************
> **
. 
. *Set up output file
. 
. forvalues x=0/1 {
  2. 
. cap file close tablecontent
  3. file open tablecontent using ./output/03b_an_descriptive_table_1_kids_cat4
> _ageband`x'`dataset'.txt, write text replace
  4. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  5. 
. gen byte cons=1
  6. tabulatevariable, variable(cons) start(1) end(1) outcome(kids_cat4)
  7. file write tablecontent _n 
  8. 
. tabulatevariable, variable(agegroup) start(1) end(7) outcome(kids_cat4) 
  9. file write tablecontent _n 
 10. 
. tabulatevariable, variable(male) start(0) end(1) outcome(kids_cat4)
 11. file write tablecontent _n 
 12. 
. tabulatevariable, variable(bmicat) start(1) end(6) missing outcome(kids_cat4)
 13. file write tablecontent _n 
 14. 
. tabulatevariable, variable(smoke) start(1) end(3) missing outcome(kids_cat4) 
 15. file write tablecontent _n 
 16. 
. tabulatevariable, variable(ethnicity) start(1) end(5) missing outcome(kids_ca
> t4)
 17. file write tablecontent _n 
 18. 
. tabulatevariable, variable(imd) start(1) end(5) outcome(kids_cat4)
 19. file write tablecontent _n 
 20. 
. tabulatevariable, variable(tot_adults_hh) start(1) end(3) outcome(kids_cat4)
 21. file write tablecontent _n 
 22. 
. tabulatevariable, variable(bpcat) start(1) end(4) missing outcome(kids_cat4)
 23. tabulatevariable, variable(htdiag_or_highbp) start(1) end(1) outcome(kids_
> cat4)                 
 24. file write tablecontent _n  
 25. 
. **COMORBIDITIES
. *RESPIRATORY
. tabulatevariable, variable(chronic_respiratory_disease) start(1) end(1) outco
> me(kids_cat4)
 26. *ASTHMA
. tabulatevariable, variable(asthma) start(1) end(1) outcome(kids_cat4) /*ever 
> asthma*/
 27. *CARDIAC
. tabulatevariable, variable(chronic_cardiac_disease) start(1) end(1) outcome(k
> ids_cat4)
 28. file write tablecontent _n
 29. *DIABETES
. tabulatevariable, variable(diabcat) start(1) end(6) outcome(kids_cat4) 
 30. file write tablecontent _n
 31. *CANCER EX HAEM
. tabulatevariable, variable(cancer_haem_cat) start(2) end(4) outcome(kids_cat4
> ) /*<1, 1-4.9, 5+ years ago*/
 32. file write tablecontent _n
 33. *CANCER HAEM
. tabulatevariable, variable(cancer_exhaem_cat) start(2) end(4) outcome(kids_ca
> t4) /*<1, 1-4.9, 5+ years ago*/
 34. file write tablecontent _n
 35. *REDUCED KIDNEY FUNCTION
. tabulatevariable, variable(reduced_kidney_function_cat) start(2) end(3) outco
> me(kids_cat4)
 36. *ESRD
. tabulatevariable, variable(esrd) start(1) end(1) outcome(kids_cat4)
 37. *LIVER
. tabulatevariable, variable(chronic_liver_disease) start(1) end(1) outcome(kid
> s_cat4)
 38. *STROKE/DEMENTIA
. tabulatevariable, variable(stroke_dementia) start(1) end(1) outcome(kids_cat4
> )
 39. *OTHER NEURO
. tabulatevariable, variable(other_neuro) start(1) end(1) outcome(kids_cat4)
 40. *OTHER ORGAN TRANSPLANT
. tabulatevariable, variable(other_transplant) start(1) end(1) outcome(kids_cat
> 4)
 41. *SPLEEN
. tabulatevariable, variable(asplenia) start(1) end(1) outcome(kids_cat4)
 42. *RA_SLE_PSORIASIS
. tabulatevariable, variable(ra_sle_psoriasis) start(1) end(1) outcome(kids_cat
> 4)
 43. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(other_immuno) start(1) end(1) outcome(kids_cat4)
 44. *SHEILDING
. tabulatevariable, variable(shield) start(1) end(1) outcome(kids_cat4)
 45. *anycomorbidity
. tabulatevariable, variable(anycomorb) start(1) end(1) outcome(kids_cat4)
 46. 
. file close tablecontent
 47. 
. }
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband0.txt not foun
> d)
  107,238
  107,238
  347
  347
  929
  929
  198
  198
  105,764
  105,764
  107,238
  26,704
  347
  95
  929
  248
  198
  48
  105,764
  26,313
  107,238
  23,308
  347
  83
  929
  205
  198
  37
  105,764
  22,983
  107,238
  22,470
  347
  60
  929
  170
  198
  35
  105,764
  22,205
  107,238
  23,267
  347
  74
  929
  218
  198
  51
  105,764
  22,924
  107,238
  11,489
  347
  35
  929
  88
  198
  27
  105,764
  11,339
  107,238
  0
  347
  0
  929
  0
  198
  0
  105,764
  0
  107,238
  0
  347
  0
  929
  0
  198
  0
  105,764
  0
  107,238
  54,876
  347
  165
  929
  491
  198
  98
  105,764
  54,122
  107,238
  52,362
  347
  182
  929
  438
  198
  100
  105,764
  51,642
  107,238
  9,807
  347
  22
  929
  91
  198
  19
  105,764
  9,675
  107,238
  24,197
  347
  84
  929
  211
  198
  48
  105,764
  23,854
  107,238
  19,230
  347
  65
  929
  158
  198
  31
  105,764
  18,976
  107,238
  14,673
  347
  48
  929
  147
  198
  23
  105,764
  14,455
  107,238
  9,135
  347
  37
  929
  86
  198
  20
  105,764
  8,992
  107,238
  6,096
  347
  20
  929
  38
  198
  11
  105,764
  6,027
  107,238
  24,100
  347
  71
  929
  198
  198
  46
  105,764
  23,785
  107,238
  4,394
  347
  18
  929
  34
  198
  6
  105,764
  4,336
  107,238
  2,168
  347
  7
  929
  20
  198
  2
  105,764
  2,139
  107,238
  12,913
  347
  45
  929
  114
  198
  16
  105,764
  12,738
  107,238
  87,763
  347
  277
  929
  761
  198
  174
  105,764
  86,551
  107,238
  85,933
  347
  269
  929
  740
  198
  157
  105,764
  84,767
  107,238
  0
  347
  0
  929
  0
  198
  0
  105,764
  0
  107,238
  10,742
  347
  39
  929
  93
  198
  18
  105,764
  10,592
  107,238
  0
  347
  0
  929
  0
  198
  0
  105,764
  0
  107,238
  10,563
  347
  39
  929
  96
  198
  23
  105,764
  10,405
  107,238
  0
  347
  0
  929
  0
  198
  0
  105,764
  0
  107,238
  74,900
  347
  255
  929
  656
  198
  139
  105,764
  73,850
  107,238
  0
  347
  0
  929
  0
  198
  0
  105,764
  0
  107,238
  0
  347
  0
  929
  0
  198
  0
  105,764
  0
  107,238
  21,722
  347
  59
  929
  190
  198
  36
  105,764
  21,437
  107,238
  10,616
  347
  33
  929
  83
  198
  23
  105,764
  10,477
  107,238
  76
  347
  53
  929
  15
  198
  7
  105,764
  1
  107,238
  97
  347
  61
  929
  23
  198
  13
  105,764
  0
  107,238
  107,065
  347
  233
  929
  891
  198
  178
  105,764
  105,763
  107,238
  24,122
  347
  66
  929
  224
  198
  38
  105,764
  23,794
  107,238
  16,554
  347
  62
  929
  143
  198
  26
  105,764
  16,323
  107,238
  39,023
  347
  127
  929
  306
  198
  82
  105,764
  38,508
  107,238
  17,201
  347
  59
  929
  151
  198
  32
  105,764
  16,959
  107,238
  10,338
  347
  33
  929
  105
  198
  20
  105,764
  10,180
  107,238
  35,218
  347
  118
  929
  310
  198
  65
  105,764
  34,725
  107,238
  21,338
  347
  76
  929
  179
  198
  48
  105,764
  21,035
  107,238
  8,537
  347
  30
  929
  75
  198
  13
  105,764
  8,419
  107,238
  21,539
  347
  70
  929
  185
  198
  37
  105,764
  21,247
  107,238
  82,830
  347
  259
  929
  701
  198
  154
  105,764
  81,716
  107,238
  2,625
  347
  11
  929
  22
  198
  5
  105,764
  2,587
  107,238
  556
  347
  3
  929
  11
  198
  2
  105,764
  540
  107,238
  17,287
  347
  63
  929
  160
  198
  33
  105,764
  17,031
  107,238
  3,842
  347
  11
  929
  34
  198
  4
  105,764
  3,793
  107,238
  98
  347
  0
  929
  1
  198
  0
  105,764
  97
  107,238
  432
  347
  3
  929
  3
  198
  0
  105,764
  426
  107,238
  1,562
  347
  4
  929
  15
  198
  1
  105,764
  1,542
  107,238
  19,125
  347
  52
  929
  174
  198
  25
  105,764
  18,874
  107,238
  433
  347
  2
  929
  1
  198
  3
  105,764
  427
  107,238
  1,654
  347
  5
  929
  11
  198
  5
  105,764
  1,633
  107,238
  18,849
  347
  53
  929
  164
  198
  38
  105,764
  18,594
  107,238
  411
  347
  1
  929
  1
  198
  1
  105,764
  408
  107,238
  0
  347
  0
  929
  0
  198
  0
  105,764
  0
  107,238
  38,709
  347
  132
  929
  335
  198
  77
  105,764
  38,165
  107,238
  21,531
  347
  67
  929
  180
  198
  41
  105,764
  21,243
  107,238
  21,177
  347
  69
  929
  180
  198
  34
  105,764
  20,894
  107,238
  21,600
  347
  77
  929
  195
  198
  36
  105,764
  21,292
  107,238
  21,317
  347
  73
  929
  192
  198
  39
  105,764
  21,013
  107,238
  21,534
  347
  64
  929
  181
  198
  38
  105,764
  21,251
  107,238
  21,454
  347
  61
  929
  186
  198
  44
  105,764
  21,163
  107,238
  21,421
  347
  60
  929
  188
  198
  33
  105,764
  21,140
  107,238
  90,826
  347
  290
  929
  786
  198
  171
  105,764
  89,579
  107,238
  103,063
  347
  336
  929
  897
  198
  190
  105,764
  101,640
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband1.txt not foun
> d)
  30,221
  30,221
  88
  88
  266
  266
  60
  60
  29,807
  29,807
  30,221
  0
  88
  0
  266
  0
  60
  0
  29,807
  0
  30,221
  0
  88
  0
  266
  0
  60
  0
  29,807
  0
  30,221
  0
  88
  0
  266
  0
  60
  0
  29,807
  0
  30,221
  0
  88
  0
  266
  0
  60
  0
  29,807
  0
  30,221
  7,350
  88
  26
  266
  55
  60
  17
  29,807
  7,252
  30,221
  14,348
  88
  39
  266
  135
  60
  32
  29,807
  14,142
  30,221
  8,523
  88
  23
  266
  76
  60
  11
  29,807
  8,413
  30,221
  15,468
  88
  42
  266
  131
  60
  28
  29,807
  15,267
  30,221
  14,753
  88
  46
  266
  135
  60
  32
  29,807
  14,540
  30,221
  2,822
  88
  7
  266
  18
  60
  10
  29,807
  2,787
  30,221
  7,013
  88
  26
  266
  63
  60
  8
  29,807
  6,916
  30,221
  5,389
  88
  17
  266
  52
  60
  15
  29,807
  5,305
  30,221
  4,340
  88
  9
  266
  38
  60
  4
  29,807
  4,289
  30,221
  2,664
  88
  8
  266
  30
  60
  6
  29,807
  2,620
  30,221
  1,741
  88
  4
  266
  17
  60
  8
  29,807
  1,712
  30,221
  6,252
  88
  17
  266
  48
  60
  9
  29,807
  6,178
  30,221
  1,244
  88
  6
  266
  9
  60
  3
  29,807
  1,226
  30,221
  590
  88
  1
  266
  3
  60
  0
  29,807
  586
  30,221
  3,570
  88
  11
  266
  25
  60
  4
  29,807
  3,530
  30,221
  24,817
  88
  70
  266
  229
  60
  53
  29,807
  24,465
  30,221
  24,180
  88
  69
  266
  212
  60
  46
  29,807
  23,853
  30,221
  0
  88
  0
  266
  0
  60
  0
  29,807
  0
  30,221
  2,940
  88
  11
  266
  27
  60
  5
  29,807
  2,897
  30,221
  0
  88
  0
  266
  0
  60
  0
  29,807
  0
  30,221
  3,101
  88
  8
  266
  27
  60
  9
  29,807
  3,057
  30,221
  0
  88
  0
  266
  0
  60
  0
  29,807
  0
  30,221
  21,125
  88
  57
  266
  188
  60
  40
  29,807
  20,840
  30,221
  0
  88
  0
  266
  0
  60
  0
  29,807
  0
  30,221
  0
  88
  0
  266
  0
  60
  0
  29,807
  0
  30,221
  6,076
  88
  20
  266
  53
  60
  17
  29,807
  5,986
  30,221
  3,020
  88
  11
  266
  25
  60
  3
  29,807
  2,981
  30,221
  19
  88
  15
  266
  2
  60
  1
  29,807
  1
  30,221
  23
  88
  10
  266
  10
  60
  3
  29,807
  0
  30,221
  30,179
  88
  63
  266
  254
  60
  56
  29,807
  29,806
  30,221
  6,708
  88
  21
  266
  55
  60
  14
  29,807
  6,618
  30,221
  4,703
  88
  10
  266
  44
  60
  7
  29,807
  4,642
  30,221
  10,899
  88
  27
  266
  92
  60
  23
  29,807
  10,757
  30,221
  4,912
  88
  16
  266
  53
  60
  10
  29,807
  4,833
  30,221
  2,999
  88
  14
  266
  22
  60
  6
  29,807
  2,957
  30,221
  9,978
  88
  27
  266
  97
  60
  18
  29,807
  9,836
  30,221
  6,122
  88
  17
  266
  44
  60
  8
  29,807
  6,053
  30,221
  2,451
  88
  11
  266
  27
  60
  2
  29,807
  2,411
  30,221
  5,983
  88
  24
  266
  62
  60
  13
  29,807
  5,884
  30,221
  23,292
  88
  68
  266
  206
  60
  46
  29,807
  22,972
  30,221
  732
  88
  2
  266
  6
  60
  2
  29,807
  722
  30,221
  184
  88
  0
  266
  4
  60
  0
  29,807
  180
  30,221
  4,861
  88
  16
  266
  37
  60
  10
  29,807
  4,798
  30,221
  1,127
  88
  2
  266
  12
  60
  2
  29,807
  1,111
  30,221
  25
  88
  0
  266
  1
  60
  0
  29,807
  24
  30,221
  118
  88
  0
  266
  2
  60
  0
  29,807
  116
  30,221
  437
  88
  1
  266
  4
  60
  1
  29,807
  431
  30,221
  5,339
  88
  15
  266
  50
  60
  9
  29,807
  5,265
  30,221
  121
  88
  0
  266
  1
  60
  0
  29,807
  120
  30,221
  501
  88
  2
  266
  4
  60
  1
  29,807
  494
  30,221
  5,457
  88
  18
  266
  59
  60
  9
  29,807
  5,371
  30,221
  1,182
  88
  7
  266
  12
  60
  4
  29,807
  1,159
  30,221
  0
  88
  0
  266
  0
  60
  0
  29,807
  0
  30,221
  10,900
  88
  30
  266
  97
  60
  22
  29,807
  10,751
  30,221
  6,041
  88
  16
  266
  39
  60
  9
  29,807
  5,977
  30,221
  6,089
  88
  22
  266
  55
  60
  11
  29,807
  6,001
  30,221
  6,002
  88
  18
  266
  54
  60
  9
  29,807
  5,921
  30,221
  6,113
  88
  18
  266
  48
  60
  14
  29,807
  6,033
  30,221
  6,075
  88
  13
  266
  56
  60
  7
  29,807
  5,999
  30,221
  6,059
  88
  18
  266
  48
  60
  13
  29,807
  5,980
  30,221
  6,016
  88
  26
  266
  63
  60
  21
  29,807
  5,906
  30,221
  25,629
  88
  74
  266
  235
  60
  47
  29,807
  25,273
  30,221
  29,051
  88
  85
  266
  256
  60
  52
  29,807
  28,658

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/03b_an_descriptive_table_1.log
  log type:  text
 closed on:  19 May 2022, 11:41:40
-------------------------------------------------------------------------------
