-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/04a_an_descriptive_tables.log
  log type:  text
 opened on:  15 Mar 2023, 13:55:42

. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  3. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. ta shield
 16. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd            ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 17.                                                 
. safetab `var'
 18. }
 19. 
. safetab imd 
 20. safetab imd, m
 21. safetab ethnicity
 22. safetab ethnicity, m
 23. safetab stp
 24. 
. 
. * Outcomes
. safetab non_covid_death
 25. safetab covid_death
 26. safetab covid_tpp_prob
 27. 
. * Outcome dates
. sum date*, format
 28. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist covid_tpp_prob covid_death non_covid_death {
 29. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                     
>    `outvar', col
 30.         safetab male                                                      
>       `outvar', col
 31.         safetab bmicat                                                    
>       `outvar', col m 
 32.         safetab smoke                                                     
>       `outvar', col m
 33.         safetab obese4cat                                                 
>       `outvar', col m 
 34.         safetab shield                                                    
>       `outvar', col m 
 35. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 esrd ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 36.         safetab `var'           `outvar', col
 37. }
 38.         
.         safetab imd                                                          
>    `outvar', col m
 39.         safetab ethnicity                                                 
>       `outvar', col m
 40.         *safetab urban                                                    
>       `outvar', col
.         safetab stp                                                          
>    `outvar', col
 41. }
 42. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    107,238    41.26402    13.53624         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |     26,704       24.90       24.90
     30-<40 |     23,308       21.73       46.64
     40-<50 |     22,470       20.95       67.59
     50-<60 |     23,267       21.70       89.29
     60-<70 |     11,489       10.71      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,238      100.00      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     54,876       51.17       51.17
          1 |     52,362       48.83      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      9,807       11.80       11.80
  Normal (18.5-24.9) |     24,197       29.10       40.90
Overweight (25-29.9) |     19,230       23.13       64.03
   Obese I (30-34.9) |     14,673       17.65       81.68
  Obese II (35-39.9) |      9,135       10.99       92.67
     Obese III (40+) |      6,096        7.33      100.00
---------------------+-----------------------------------
               Total |     83,138      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      9,807        9.15        9.15
  Normal (18.5-24.9) |     24,197       22.56       31.71
Overweight (25-29.9) |     19,230       17.93       49.64
   Obese I (30-34.9) |     14,673       13.68       63.32
  Obese II (35-39.9) |      9,135        8.52       71.84
     Obese III (40+) |      6,096        5.68       77.53
        Unknown (.u) |     24,100       22.47      100.00
---------------------+-----------------------------------
               Total |    107,238      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     77,334       72.11       72.11
   Obese I (30-34.9) |     14,673       13.68       85.80
  Obese II (35-39.9) |      9,135        8.52       94.32
     Obese III (40+) |      6,096        5.68      100.00
---------------------+-----------------------------------
               Total |    107,238      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      4,394       22.56       22.56
      Former |      2,168       11.13       33.69
     Current |     12,913       66.31      100.00
-------------+-----------------------------------
       Total |     19,475      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      4,394        4.10        4.10
      Former |      2,168        2.02        6.12
     Current |     12,913       12.04       18.16
Unknown (.u) |     87,763       81.84      100.00
-------------+-----------------------------------
       Total |    107,238      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |     24,122       24.89       24.89
      Elevated |     16,554       17.08       41.98
 High, stage I |     39,023       40.27       82.25
High, stage II |     17,201       17.75      100.00
---------------+-----------------------------------
         Total |     96,900      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |     24,122       22.49       22.49
      Elevated |     16,554       15.44       37.93
 High, stage I |     39,023       36.39       74.32
High, stage II |     17,201       16.04       90.36
       Unknown |     10,338        9.64      100.00
---------------+-----------------------------------
         Total |    107,238      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     72,020       67.16       67.16
          1 |     35,218       32.84      100.00
------------+-----------------------------------
      Total |    107,238      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,412       15.30       15.30
          1 |     90,826       84.70      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,900       80.10       80.10
          1 |     21,338       19.90      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     98,701       92.04       92.04
          1 |      8,537        7.96      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,699       79.91       79.91
          1 |     21,539       20.09      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     82,830       77.24       77.24
  T1DM, controlled |      2,625        2.45       79.69
T1DM, uncontrolled |        556        0.52       80.21
  T2DM, controlled |     17,287       16.12       96.33
T2DM, uncontrolled |      3,842        3.58       99.91
Diabetes, no HbA1c |         98        0.09      100.00
-------------------+-----------------------------------
             Total |    107,238      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     86,302       80.48       80.48
    Last year |        433        0.40       80.88
2-5 years ago |      1,654        1.54       82.42
     5+ years |     18,849       17.58      100.00
--------------+-----------------------------------
        Total |    107,238      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     86,119       80.31       80.31
    Last year |        432        0.40       80.71
2-5 years ago |      1,562        1.46       82.17
     5+ years |     19,125       17.83      100.00
--------------+-----------------------------------
        Total |    107,238      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,817       80.02       80.02
          1 |     21,421       19.98      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,921       80.12       80.12
          1 |     21,317       19.88      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,704       79.92       79.92
          1 |     21,534       20.08      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,707       79.92       79.92
          1 |     21,531       20.08      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,638       79.86       79.86
          1 |     21,600       20.14      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     86,061       80.25       80.25
          1 |     21,177       19.75      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

**TABLE OF egfr_cat REDACTED DUE TO SMALL N**

0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |    106,827       99.62       99.62
Stage 3a/3b egfr 30-60       |        411        0.38      100.00
-----------------------------+-----------------------------------
                       Total |    107,238      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,529       63.90       63.90
          1 |     38,709       36.10      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,827       80.03       80.03
          1 |     21,411       19.97      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     85,784       79.99       79.99
          1 |     21,454       20.01      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     74,900       69.84       69.84
               4 |     21,722       20.26       90.10
 5 most deprived |     10,616        9.90      100.00
-----------------+-----------------------------------
           Total |    107,238      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     74,900       69.84       69.84
               4 |     21,722       20.26       90.10
 5 most deprived |     10,616        9.90      100.00
-----------------+-----------------------------------
           Total |    107,238      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     85,933       80.13       80.13
Asian or Asian British |     10,742       10.02       90.15
                 Other |     10,563        9.85      100.00
-----------------------+-----------------------------------
                 Total |    107,238      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     85,933       80.13       80.13
Asian or Asian British |     10,742       10.02       90.15
                 Other |     10,563        9.85      100.00
-----------------------+-----------------------------------
                 Total |    107,238      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     10,744       10.02       10.02
          2 |     10,646        9.93       19.95
          3 |     10,626        9.91       29.86
          4 |     10,674        9.95       39.81
          5 |     10,700        9.98       49.79
          6 |     10,767       10.04       59.83
          7 |     10,774       10.05       69.87
          8 |     10,775       10.05       79.92
          9 |     10,806       10.08       90.00
         10 |     10,726       10.00      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,377       73.09       73.09
          1 |     28,861       26.91      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,809       59.50       59.50
          1 |     43,429       40.50      100.00
------------+-----------------------------------
      Total |    107,238      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,377       19.93       19.93
          1 |     85,861       80.07      100.00
------------+-----------------------------------
      Total |    107,238      100.00

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_posit~S |      4,298   02jan2022    50.73113  18jan2021  21feb2022
date_covid~r |      4,381   02jan2022    49.55064  08jan2021  21feb2022
date_covid~b |     85,861   22jul2021    123.5657  21dec2020  21feb2022
date_covid~n |     32,049   15jun2021    119.0684  20dec2020  21feb2022
date_covid~s |     85,651   22jul2021    123.4312  21dec2020  21feb2022
-------------+---------------------------------------------------------
date_covid~h |     43,429   22jul2021    123.2154  21dec2020  21feb2022
date_non_c~h |     28,861   23jul2021    123.5955  21dec2020  21feb2022
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     5,269     21,435 |    26,704 
           |     24.65      24.96 |     24.90 
-----------+----------------------+----------
    30-<40 |     4,666     18,642 |    23,308 
           |     21.83      21.71 |     21.73 
-----------+----------------------+----------
    40-<50 |     4,500     17,970 |    22,470 
           |     21.05      20.93 |     20.95 
-----------+----------------------+----------
    50-<60 |     4,641     18,626 |    23,267 
           |     21.71      21.69 |     21.70 
-----------+----------------------+----------
    60-<70 |     2,301      9,188 |    11,489 
           |     10.76      10.70 |     10.71 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,963     43,913 |    54,876 
           |     51.28      51.14 |     51.17 
-----------+----------------------+----------
         1 |    10,414     41,948 |    52,362 
           |     48.72      48.86 |     48.83 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     1,995      7,812 |     9,807 
                     |      9.33       9.10 |      9.15 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     4,794     19,403 |    24,197 
                     |     22.43      22.60 |     22.56 
---------------------+----------------------+----------
Overweight (25-29.9) |     3,788     15,442 |    19,230 
                     |     17.72      17.98 |     17.93 
---------------------+----------------------+----------
   Obese I (30-34.9) |     2,856     11,817 |    14,673 
                     |     13.36      13.76 |     13.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,827      7,308 |     9,135 
                     |      8.55       8.51 |      8.52 
---------------------+----------------------+----------
     Obese III (40+) |     1,256      4,840 |     6,096 
                     |      5.88       5.64 |      5.68 
---------------------+----------------------+----------
        Unknown (.u) |     4,861     19,239 |    24,100 
                     |     22.74      22.41 |     22.47 
---------------------+----------------------+----------
               Total |    21,377     85,861 |   107,238 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       880      3,514 |     4,394 
             |      4.12       4.09 |      4.10 
-------------+----------------------+----------
      Former |       431      1,737 |     2,168 
             |      2.02       2.02 |      2.02 
-------------+----------------------+----------
     Current |     2,541     10,372 |    12,913 
             |     11.89      12.08 |     12.04 
-------------+----------------------+----------
Unknown (.u) |    17,525     70,238 |    87,763 
             |     81.98      81.80 |     81.84 
-------------+----------------------+----------
       Total |    21,377     85,861 |   107,238 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    15,438     61,896 |    77,334 
                     |     72.22      72.09 |     72.11 
---------------------+----------------------+----------
   Obese I (30-34.9) |     2,856     11,817 |    14,673 
                     |     13.36      13.76 |     13.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,827      7,308 |     9,135 
                     |      8.55       8.51 |      8.52 
---------------------+----------------------+----------
     Obese III (40+) |     1,256      4,840 |     6,096 
                     |      5.88       5.64 |      5.68 
---------------------+----------------------+----------
               Total |    21,377     85,861 |   107,238 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,228     13,184 |    16,412 
           |     15.10      15.36 |     15.30 
-----------+----------------------+----------
         1 |    18,149     72,677 |    90,826 
           |     84.90      84.64 |     84.70 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,180     68,720 |    85,900 
           |     80.37      80.04 |     80.10 
-----------+----------------------+----------
         1 |     4,197     17,141 |    21,338 
           |     19.63      19.96 |     19.90 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    19,682     79,019 |    98,701 
           |     92.07      92.03 |     92.04 
-----------+----------------------+----------
         1 |     1,695      6,842 |     8,537 
           |      7.93       7.97 |      7.96 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,044     68,655 |    85,699 
           |     79.73      79.96 |     79.91 
-----------+----------------------+----------
         1 |     4,333     17,206 |    21,539 
           |     20.27      20.04 |     20.09 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: covid prob
                   |         case
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |    16,526     66,304 |    82,830 
                   |     77.31      77.22 |     77.24 
-------------------+----------------------+----------
  T1DM, controlled |       490      2,135 |     2,625 
                   |      2.29       2.49 |      2.45 
-------------------+----------------------+----------
T1DM, uncontrolled |       107        449 |       556 
                   |      0.50       0.52 |      0.52 
-------------------+----------------------+----------
  T2DM, controlled |     3,453     13,834 |    17,287 
                   |     16.15      16.11 |     16.12 
-------------------+----------------------+----------
T2DM, uncontrolled |       784      3,058 |     3,842 
                   |      3.67       3.56 |      3.58 
-------------------+----------------------+----------
Diabetes, no HbA1c |        17         81 |        98 
                   |      0.08       0.09 |      0.09 
-------------------+----------------------+----------
             Total |    21,377     85,861 |   107,238 
                   |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |    17,180     69,122 |    86,302 
              |     80.37      80.50 |     80.48 
--------------+----------------------+----------
    Last year |        97        336 |       433 
              |      0.45       0.39 |      0.40 
--------------+----------------------+----------
2-5 years ago |       334      1,320 |     1,654 
              |      1.56       1.54 |      1.54 
--------------+----------------------+----------
     5+ years |     3,766     15,083 |    18,849 
              |     17.62      17.57 |     17.58 
--------------+----------------------+----------
        Total |    21,377     85,861 |   107,238 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |    17,203     68,916 |    86,119 
              |     80.47      80.26 |     80.31 
--------------+----------------------+----------
    Last year |        93        339 |       432 
              |      0.44       0.39 |      0.40 
--------------+----------------------+----------
2-5 years ago |       323      1,239 |     1,562 
              |      1.51       1.44 |      1.46 
--------------+----------------------+----------
     5+ years |     3,758     15,367 |    19,125 
              |     17.58      17.90 |     17.83 
--------------+----------------------+----------
        Total |    21,377     85,861 |   107,238 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,125     68,692 |    85,817 
           |     80.11      80.00 |     80.02 
-----------+----------------------+----------
         1 |     4,252     17,169 |    21,421 
           |     19.89      20.00 |     19.98 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,178     68,743 |    85,921 
           |     80.36      80.06 |     80.12 
-----------+----------------------+----------
         1 |     4,199     17,118 |    21,317 
           |     19.64      19.94 |     19.88 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |    16,993     68,711 |    85,704 
           |     79.49      80.03 |     79.92 
-----------+----------------------+----------
         1 |     4,384     17,150 |    21,534 
           |     20.51      19.97 |     20.08 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    16,993     68,714 |    85,707 
           |     79.49      80.03 |     79.92 
-----------+----------------------+----------
         1 |     4,384     17,147 |    21,531 
           |     20.51      19.97 |     20.08 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,023     68,615 |    85,638 
           |     79.63      79.91 |     79.86 
-----------+----------------------+----------
         1 |     4,354     17,246 |    21,600 
           |     20.37      20.09 |     20.14 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,227     68,834 |    86,061 
           |     80.59      80.17 |     80.25 
-----------+----------------------+----------
         1 |     4,150     17,027 |    21,177 
           |     19.41      19.83 |     19.75 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
24

**TABLE OF egfr_cat covid_tpp_prob REDACTED DUE TO SMALL N**

20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,625     54,904 |    68,529 
           |     63.74      63.95 |     63.90 
-----------+----------------------+----------
         1 |     7,752     30,957 |    38,709 
           |     36.26      36.05 |     36.10 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    21,295     85,532 |   106,827 
                      |     99.62      99.62 |     99.62 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        82        329 |       411 
                      |      0.38       0.38 |      0.38 
----------------------+----------------------+----------
                Total |    21,377     85,861 |   107,238 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,040     68,787 |    85,827 
           |     79.71      80.11 |     80.03 
-----------+----------------------+----------
         1 |     4,337     17,074 |    21,411 
           |     20.29      19.89 |     19.97 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,086     68,698 |    85,784 
           |     79.93      80.01 |     79.99 
-----------+----------------------+----------
         1 |     4,291     17,163 |    21,454 
           |     20.07      19.99 |     20.01 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    14,944     59,956 |    74,900 
                 |     69.91      69.83 |     69.84 
-----------------+----------------------+----------
               4 |     4,347     17,375 |    21,722 
                 |     20.33      20.24 |     20.26 
-----------------+----------------------+----------
 5 most deprived |     2,086      8,530 |    10,616 
                 |      9.76       9.93 |      9.90 
-----------------+----------------------+----------
           Total |    21,377     85,861 |   107,238 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |    17,127     68,806 |    85,933 
                      |     80.12      80.14 |     80.13 
----------------------+----------------------+----------
Asian or Asian Britis |     2,131      8,611 |    10,742 
                      |      9.97      10.03 |     10.02 
----------------------+----------------------+----------
                Other |     2,119      8,444 |    10,563 
                      |      9.91       9.83 |      9.85 
----------------------+----------------------+----------
                Total |    21,377     85,861 |   107,238 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     2,223      8,521 |    10,744 
           |     10.40       9.92 |     10.02 
-----------+----------------------+----------
         2 |     2,124      8,522 |    10,646 
           |      9.94       9.93 |      9.93 
-----------+----------------------+----------
         3 |     2,117      8,509 |    10,626 
           |      9.90       9.91 |      9.91 
-----------+----------------------+----------
         4 |     2,085      8,589 |    10,674 
           |      9.75      10.00 |      9.95 
-----------+----------------------+----------
         5 |     2,100      8,600 |    10,700 
           |      9.82      10.02 |      9.98 
-----------+----------------------+----------
         6 |     2,108      8,659 |    10,767 
           |      9.86      10.08 |     10.04 
-----------+----------------------+----------
         7 |     2,151      8,623 |    10,774 
           |     10.06      10.04 |     10.05 
-----------+----------------------+----------
         8 |     2,148      8,627 |    10,775 
           |     10.05      10.05 |     10.05 
-----------+----------------------+----------
         9 |     2,140      8,666 |    10,806 
           |     10.01      10.09 |     10.08 
-----------+----------------------+----------
        10 |     2,181      8,545 |    10,726 
           |     10.20       9.95 |     10.00 
-----------+----------------------+----------
     Total |    21,377     85,861 |   107,238 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped | outcome: covid death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    15,804     10,900 |    26,704 
           |     24.77      25.10 |     24.90 
-----------+----------------------+----------
    30-<40 |    14,030      9,278 |    23,308 
           |     21.99      21.36 |     21.73 
-----------+----------------------+----------
    40-<50 |    13,318      9,152 |    22,470 
           |     20.87      21.07 |     20.95 
-----------+----------------------+----------
    50-<60 |    13,722      9,545 |    23,267 
           |     21.50      21.98 |     21.70 
-----------+----------------------+----------
    60-<70 |     6,935      4,554 |    11,489 
           |     10.87      10.49 |     10.71 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,634     22,242 |    54,876 
           |     51.14      51.21 |     51.17 
-----------+----------------------+----------
         1 |    31,175     21,187 |    52,362 
           |     48.86      48.79 |     48.83 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     | outcome: covid death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     5,765      4,042 |     9,807 
                     |      9.03       9.31 |      9.15 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    14,327      9,870 |    24,197 
                     |     22.45      22.73 |     22.56 
---------------------+----------------------+----------
Overweight (25-29.9) |    11,602      7,628 |    19,230 
                     |     18.18      17.56 |     17.93 
---------------------+----------------------+----------
   Obese I (30-34.9) |     8,642      6,031 |    14,673 
                     |     13.54      13.89 |     13.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |     5,439      3,696 |     9,135 
                     |      8.52       8.51 |      8.52 
---------------------+----------------------+----------
     Obese III (40+) |     3,656      2,440 |     6,096 
                     |      5.73       5.62 |      5.68 
---------------------+----------------------+----------
        Unknown (.u) |    14,378      9,722 |    24,100 
                     |     22.53      22.39 |     22.47 
---------------------+----------------------+----------
               Total |    63,809     43,429 |   107,238 
                     |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking | outcome: covid death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     2,601      1,793 |     4,394 
             |      4.08       4.13 |      4.10 
-------------+----------------------+----------
      Former |     1,261        907 |     2,168 
             |      1.98       2.09 |      2.02 
-------------+----------------------+----------
     Current |     7,655      5,258 |    12,913 
             |     12.00      12.11 |     12.04 
-------------+----------------------+----------
Unknown (.u) |    52,292     35,471 |    87,763 
             |     81.95      81.68 |     81.84 
-------------+----------------------+----------
       Total |    63,809     43,429 |   107,238 
             |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity | outcome: covid death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    46,072     31,262 |    77,334 
                     |     72.20      71.98 |     72.11 
---------------------+----------------------+----------
   Obese I (30-34.9) |     8,642      6,031 |    14,673 
                     |     13.54      13.89 |     13.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |     5,439      3,696 |     9,135 
                     |      8.52       8.51 |      8.52 
---------------------+----------------------+----------
     Obese III (40+) |     3,656      2,440 |     6,096 
                     |      5.73       5.62 |      5.68 
---------------------+----------------------+----------
               Total |    63,809     43,429 |   107,238 
                     |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,746      6,666 |    16,412 
           |     15.27      15.35 |     15.30 
-----------+----------------------+----------
         1 |    54,063     36,763 |    90,826 
           |     84.73      84.65 |     84.70 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator | outcome: covid death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    51,134     34,766 |    85,900 
           |     80.14      80.05 |     80.10 
-----------+----------------------+----------
         1 |    12,675      8,663 |    21,338 
           |     19.86      19.95 |     19.90 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma | outcome: covid death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    58,758     39,943 |    98,701 
           |     92.08      91.97 |     92.04 
-----------+----------------------+----------
         1 |     5,051      3,486 |     8,537 
           |      7.92       8.03 |      7.96 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac | outcome: covid death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    50,866     34,833 |    85,699 
           |     79.72      80.21 |     79.91 
-----------+----------------------+----------
         1 |    12,943      8,596 |    21,539 
           |     20.28      19.79 |     20.09 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   | outcome: covid death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |    49,394     33,436 |    82,830 
                   |     77.41      76.99 |     77.24 
-------------------+----------------------+----------
  T1DM, controlled |     1,571      1,054 |     2,625 
                   |      2.46       2.43 |      2.45 
-------------------+----------------------+----------
T1DM, uncontrolled |       338        218 |       556 
                   |      0.53       0.50 |      0.52 
-------------------+----------------------+----------
  T2DM, controlled |    10,210      7,077 |    17,287 
                   |     16.00      16.30 |     16.12 
-------------------+----------------------+----------
T2DM, uncontrolled |     2,236      1,606 |     3,842 
                   |      3.50       3.70 |      3.58 
-------------------+----------------------+----------
Diabetes, no HbA1c |        60         38 |        98 
                   |      0.09       0.09 |      0.09 
-------------------+----------------------+----------
             Total |    63,809     43,429 |   107,238 
                   |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo | outcome: covid death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |    51,396     34,906 |    86,302 
              |     80.55      80.37 |     80.48 
--------------+----------------------+----------
    Last year |       243        190 |       433 
              |      0.38       0.44 |      0.40 
--------------+----------------------+----------
2-5 years ago |       954        700 |     1,654 
              |      1.50       1.61 |      1.54 
--------------+----------------------+----------
     5+ years |    11,216      7,633 |    18,849 
              |     17.58      17.58 |     17.58 
--------------+----------------------+----------
        Total |    63,809     43,429 |   107,238 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica | outcome: covid death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |    51,299     34,820 |    86,119 
              |     80.39      80.18 |     80.31 
--------------+----------------------+----------
    Last year |       256        176 |       432 
              |      0.40       0.41 |      0.40 
--------------+----------------------+----------
2-5 years ago |       918        644 |     1,562 
              |      1.44       1.48 |      1.46 
--------------+----------------------+----------
     5+ years |    11,336      7,789 |    19,125 
              |     17.77      17.94 |     17.83 
--------------+----------------------+----------
        Total |    63,809     43,429 |   107,238 
              |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on | outcome: covid death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |    51,063     34,754 |    85,817 
           |     80.02      80.02 |     80.02 
-----------+----------------------+----------
         1 |    12,746      8,675 |    21,421 
           |     19.98      19.98 |     19.98 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |   Failure/censoring
     solid |     indicator for
     organ | outcome: covid death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |    51,053     34,868 |    85,921 
           |     80.01      80.29 |     80.12 
-----------+----------------------+----------
         1 |    12,756      8,561 |    21,317 
           |     19.99      19.71 |     19.88 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |    50,992     34,712 |    85,704 
           |     79.91      79.93 |     79.92 
-----------+----------------------+----------
         1 |    12,817      8,717 |    21,534 
           |     20.09      20.07 |     20.08 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    51,027     34,680 |    85,707 
           |     79.97      79.85 |     79.92 
-----------+----------------------+----------
         1 |    12,782      8,749 |    21,531 
           |     20.03      20.15 |     20.08 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic | outcome: covid death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    50,964     34,674 |    85,638 
           |     79.87      79.84 |     79.86 
-----------+----------------------+----------
         1 |    12,845      8,755 |    21,600 
           |     20.13      20.16 |     20.14 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or | outcome: covid death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    51,303     34,758 |    86,061 
           |     80.40      80.03 |     80.25 
-----------+----------------------+----------
         1 |    12,506      8,671 |    21,177 
           |     19.60      19.97 |     19.75 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
21

**TABLE OF egfr_cat covid_death REDACTED DUE TO SMALL N**

17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 End-stage |     indicator for
     renal | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,753     27,776 |    68,529 
           |     63.87      63.96 |     63.90 
-----------+----------------------+----------
         1 |    23,056     15,653 |    38,709 
           |     36.13      36.04 |     36.10 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney | outcome: covid death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    63,564     43,263 |   106,827 
                      |     99.62      99.62 |     99.62 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       245        166 |       411 
                      |      0.38       0.38 |      0.38 
----------------------+----------------------+----------
                Total |    63,809     43,429 |   107,238 
                      |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi | outcome: covid death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |    51,122     34,705 |    85,827 
           |     80.12      79.91 |     80.03 
-----------+----------------------+----------
         1 |    12,687      8,724 |    21,411 
           |     19.88      20.09 |     19.97 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    50,978     34,806 |    85,784 
           |     79.89      80.14 |     79.99 
-----------+----------------------+----------
         1 |    12,831      8,623 |    21,454 
           |     20.11      19.86 |     20.01 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation | outcome: covid death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    44,546     30,354 |    74,900 
                 |     69.81      69.89 |     69.84 
-----------------+----------------------+----------
               4 |    12,952      8,770 |    21,722 
                 |     20.30      20.19 |     20.26 
-----------------+----------------------+----------
 5 most deprived |     6,311      4,305 |    10,616 
                 |      9.89       9.91 |      9.90 
-----------------+----------------------+----------
           Total |    63,809     43,429 |   107,238 
                 |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      | outcome: covid death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |    51,138     34,795 |    85,933 
                      |     80.14      80.12 |     80.13 
----------------------+----------------------+----------
Asian or Asian Britis |     6,427      4,315 |    10,742 
                      |     10.07       9.94 |     10.02 
----------------------+----------------------+----------
                Other |     6,244      4,319 |    10,563 
                      |      9.79       9.94 |      9.85 
----------------------+----------------------+----------
                Total |    63,809     43,429 |   107,238 
                      |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     6,335      4,409 |    10,744 
           |      9.93      10.15 |     10.02 
-----------+----------------------+----------
         2 |     6,388      4,258 |    10,646 
           |     10.01       9.80 |      9.93 
-----------+----------------------+----------
         3 |     6,361      4,265 |    10,626 
           |      9.97       9.82 |      9.91 
-----------+----------------------+----------
         4 |     6,324      4,350 |    10,674 
           |      9.91      10.02 |      9.95 
-----------+----------------------+----------
         5 |     6,271      4,429 |    10,700 
           |      9.83      10.20 |      9.98 
-----------+----------------------+----------
         6 |     6,504      4,263 |    10,767 
           |     10.19       9.82 |     10.04 
-----------+----------------------+----------
         7 |     6,380      4,394 |    10,774 
           |     10.00      10.12 |     10.05 
-----------+----------------------+----------
         8 |     6,431      4,344 |    10,775 
           |     10.08      10.00 |     10.05 
-----------+----------------------+----------
         9 |     6,442      4,364 |    10,806 
           |     10.10      10.05 |     10.08 
-----------+----------------------+----------
        10 |     6,373      4,353 |    10,726 
           |      9.99      10.02 |     10.00 
-----------+----------------------+----------
     Total |    63,809     43,429 |   107,238 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |    19,576      7,128 |    26,704 
           |     24.98      24.70 |     24.90 
-----------+----------------------+----------
    30-<40 |    17,027      6,281 |    23,308 
           |     21.72      21.76 |     21.73 
-----------+----------------------+----------
    40-<50 |    16,512      5,958 |    22,470 
           |     21.07      20.64 |     20.95 
-----------+----------------------+----------
    50-<60 |    16,977      6,290 |    23,267 
           |     21.66      21.79 |     21.70 
-----------+----------------------+----------
    60-<70 |     8,285      3,204 |    11,489 
           |     10.57      11.10 |     10.71 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,236     14,640 |    54,876 
           |     51.34      50.73 |     51.17 
-----------+----------------------+----------
         1 |    38,141     14,221 |    52,362 
           |     48.66      49.27 |     48.83 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     7,177      2,630 |     9,807 
                     |      9.16       9.11 |      9.15 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    17,783      6,414 |    24,197 
                     |     22.69      22.22 |     22.56 
---------------------+----------------------+----------
Overweight (25-29.9) |    13,940      5,290 |    19,230 
                     |     17.79      18.33 |     17.93 
---------------------+----------------------+----------
   Obese I (30-34.9) |    10,800      3,873 |    14,673 
                     |     13.78      13.42 |     13.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |     6,744      2,391 |     9,135 
                     |      8.60       8.28 |      8.52 
---------------------+----------------------+----------
     Obese III (40+) |     4,359      1,737 |     6,096 
                     |      5.56       6.02 |      5.68 
---------------------+----------------------+----------
        Unknown (.u) |    17,574      6,526 |    24,100 
                     |     22.42      22.61 |     22.47 
---------------------+----------------------+----------
               Total |    78,377     28,861 |   107,238 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     3,262      1,132 |     4,394 
             |      4.16       3.92 |      4.10 
-------------+----------------------+----------
      Former |     1,602        566 |     2,168 
             |      2.04       1.96 |      2.02 
-------------+----------------------+----------
     Current |     9,462      3,451 |    12,913 
             |     12.07      11.96 |     12.04 
-------------+----------------------+----------
Unknown (.u) |    64,051     23,712 |    87,763 
             |     81.72      82.16 |     81.84 
-------------+----------------------+----------
       Total |    78,377     28,861 |   107,238 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    56,474     20,860 |    77,334 
                     |     72.05      72.28 |     72.11 
---------------------+----------------------+----------
   Obese I (30-34.9) |    10,800      3,873 |    14,673 
                     |     13.78      13.42 |     13.68 
---------------------+----------------------+----------
  Obese II (35-39.9) |     6,744      2,391 |     9,135 
                     |      8.60       8.28 |      8.52 
---------------------+----------------------+----------
     Obese III (40+) |     4,359      1,737 |     6,096 
                     |      5.56       6.02 |      5.68 
---------------------+----------------------+----------
               Total |    78,377     28,861 |   107,238 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,019      4,393 |    16,412 
           |     15.33      15.22 |     15.30 
-----------+----------------------+----------
         1 |    66,358     24,468 |    90,826 
           |     84.67      84.78 |     84.70 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,756     23,144 |    85,900 
           |     80.07      80.19 |     80.10 
-----------+----------------------+----------
         1 |    15,621      5,717 |    21,338 
           |     19.93      19.81 |     19.90 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,119     26,582 |    98,701 
           |     92.02      92.10 |     92.04 
-----------+----------------------+----------
         1 |     6,258      2,279 |     8,537 
           |      7.98       7.90 |      7.96 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,647     23,052 |    85,699 
           |     79.93      79.87 |     79.91 
-----------+----------------------+----------
         1 |    15,730      5,809 |    21,539 
           |     20.07      20.13 |     20.09 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: non-covid
                   |         death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |    60,468     22,362 |    82,830 
                   |     77.15      77.48 |     77.24 
-------------------+----------------------+----------
  T1DM, controlled |     1,923        702 |     2,625 
                   |      2.45       2.43 |      2.45 
-------------------+----------------------+----------
T1DM, uncontrolled |       405        151 |       556 
                   |      0.52       0.52 |      0.52 
-------------------+----------------------+----------
  T2DM, controlled |    12,660      4,627 |    17,287 
                   |     16.15      16.03 |     16.12 
-------------------+----------------------+----------
T2DM, uncontrolled |     2,851        991 |     3,842 
                   |      3.64       3.43 |      3.58 
-------------------+----------------------+----------
Diabetes, no HbA1c |        70         28 |        98 
                   |      0.09       0.10 |      0.09 
-------------------+----------------------+----------
             Total |    78,377     28,861 |   107,238 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |    63,162     23,140 |    86,302 
              |     80.59      80.18 |     80.48 
--------------+----------------------+----------
    Last year |       314        119 |       433 
              |      0.40       0.41 |      0.40 
--------------+----------------------+----------
2-5 years ago |     1,210        444 |     1,654 
              |      1.54       1.54 |      1.54 
--------------+----------------------+----------
     5+ years |    13,691      5,158 |    18,849 
              |     17.47      17.87 |     17.58 
--------------+----------------------+----------
        Total |    78,377     28,861 |   107,238 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |    62,880     23,239 |    86,119 
              |     80.23      80.52 |     80.31 
--------------+----------------------+----------
    Last year |       313        119 |       432 
              |      0.40       0.41 |      0.40 
--------------+----------------------+----------
2-5 years ago |     1,193        369 |     1,562 
              |      1.52       1.28 |      1.46 
--------------+----------------------+----------
     5+ years |    13,991      5,134 |    19,125 
              |     17.85      17.79 |     17.83 
--------------+----------------------+----------
        Total |    78,377     28,861 |   107,238 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,735     23,082 |    85,817 
           |     80.04      79.98 |     80.02 
-----------+----------------------+----------
         1 |    15,642      5,779 |    21,421 
           |     19.96      20.02 |     19.98 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,821     23,100 |    85,921 
           |     80.15      80.04 |     80.12 
-----------+----------------------+----------
         1 |    15,556      5,761 |    21,317 
           |     19.85      19.96 |     19.88 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,564     23,140 |    85,704 
           |     79.82      80.18 |     79.92 
-----------+----------------------+----------
         1 |    15,813      5,721 |    21,534 
           |     20.18      19.82 |     20.08 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,695     23,012 |    85,707 
           |     79.99      79.73 |     79.92 
-----------+----------------------+----------
         1 |    15,682      5,849 |    21,531 
           |     20.01      20.27 |     20.08 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,581     23,057 |    85,638 
           |     79.85      79.89 |     79.86 
-----------+----------------------+----------
         1 |    15,796      5,804 |    21,600 
           |     20.15      20.11 |     20.14 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,872     23,189 |    86,061 
           |     80.22      80.35 |     80.25 
-----------+----------------------+----------
         1 |    15,505      5,672 |    21,177 
           |     19.78      19.65 |     19.75 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
25

**TABLE OF egfr_cat non_covid_death REDACTED DUE TO SMALL N**

21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    50,089     18,440 |    68,529 
           |     63.91      63.89 |     63.90 
-----------+----------------------+----------
         1 |    28,288     10,421 |    38,709 
           |     36.09      36.11 |     36.10 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    78,077     28,750 |   106,827 
                      |     99.62      99.62 |     99.62 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       300        111 |       411 
                      |      0.38       0.38 |      0.38 
----------------------+----------------------+----------
                Total |    78,377     28,861 |   107,238 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,768     23,059 |    85,827 
           |     80.08      79.90 |     80.03 
-----------+----------------------+----------
         1 |    15,609      5,802 |    21,411 
           |     19.92      20.10 |     19.97 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,765     23,019 |    85,784 
           |     80.08      79.76 |     79.99 
-----------+----------------------+----------
         1 |    15,612      5,842 |    21,454 
           |     19.92      20.24 |     20.01 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    54,795     20,105 |    74,900 
                 |     69.91      69.66 |     69.84 
-----------------+----------------------+----------
               4 |    15,813      5,909 |    21,722 
                 |     20.18      20.47 |     20.26 
-----------------+----------------------+----------
 5 most deprived |     7,769      2,847 |    10,616 
                 |      9.91       9.86 |      9.90 
-----------------+----------------------+----------
           Total |    78,377     28,861 |   107,238 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |    62,851     23,082 |    85,933 
                      |     80.19      79.98 |     80.13 
----------------------+----------------------+----------
Asian or Asian Britis |     7,812      2,930 |    10,742 
                      |      9.97      10.15 |     10.02 
----------------------+----------------------+----------
                Other |     7,714      2,849 |    10,563 
                      |      9.84       9.87 |      9.85 
----------------------+----------------------+----------
                Total |    78,377     28,861 |   107,238 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: non-covid
Partnershi |         death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     7,903      2,841 |    10,744 
           |     10.08       9.84 |     10.02 
-----------+----------------------+----------
         2 |     7,781      2,865 |    10,646 
           |      9.93       9.93 |      9.93 
-----------+----------------------+----------
         3 |     7,718      2,908 |    10,626 
           |      9.85      10.08 |      9.91 
-----------+----------------------+----------
         4 |     7,806      2,868 |    10,674 
           |      9.96       9.94 |      9.95 
-----------+----------------------+----------
         5 |     7,909      2,791 |    10,700 
           |     10.09       9.67 |      9.98 
-----------+----------------------+----------
         6 |     7,856      2,911 |    10,767 
           |     10.02      10.09 |     10.04 
-----------+----------------------+----------
         7 |     7,889      2,885 |    10,774 
           |     10.07      10.00 |     10.05 
-----------+----------------------+----------
         8 |     7,836      2,939 |    10,775 
           |     10.00      10.18 |     10.05 
-----------+----------------------+----------
         9 |     7,877      2,929 |    10,806 
           |     10.05      10.15 |     10.08 
-----------+----------------------+----------
        10 |     7,802      2,924 |    10,726 
           |      9.95      10.13 |     10.00 
-----------+----------------------+----------
     Total |    78,377     28,861 |   107,238 
           |    100.00     100.00 |    100.00 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     30,221    75.74121    7.507651         66        109
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |      7,350       24.32       24.32
     70-<80 |     14,348       47.48       71.80
        80+ |      8,523       28.20      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,806        5.98        5.98
          1 |     28,415       94.02      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,468       51.18       51.18
          1 |     14,753       48.82      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      2,822       11.77       11.77
  Normal (18.5-24.9) |      7,013       29.26       41.03
Overweight (25-29.9) |      5,389       22.48       63.52
   Obese I (30-34.9) |      4,340       18.11       81.62
  Obese II (35-39.9) |      2,664       11.11       92.74
     Obese III (40+) |      1,741        7.26      100.00
---------------------+-----------------------------------
               Total |     23,969      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      2,822        9.34        9.34
  Normal (18.5-24.9) |      7,013       23.21       32.54
Overweight (25-29.9) |      5,389       17.83       50.38
   Obese I (30-34.9) |      4,340       14.36       64.74
  Obese II (35-39.9) |      2,664        8.82       73.55
     Obese III (40+) |      1,741        5.76       79.31
        Unknown (.u) |      6,252       20.69      100.00
---------------------+-----------------------------------
               Total |     30,221      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     21,476       71.06       71.06
   Obese I (30-34.9) |      4,340       14.36       85.42
  Obese II (35-39.9) |      2,664        8.82       94.24
     Obese III (40+) |      1,741        5.76      100.00
---------------------+-----------------------------------
               Total |     30,221      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      1,244       23.02       23.02
      Former |        590       10.92       33.94
     Current |      3,570       66.06      100.00
-------------+-----------------------------------
       Total |      5,404      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      1,244        4.12        4.12
      Former |        590        1.95        6.07
     Current |      3,570       11.81       17.88
Unknown (.u) |     24,817       82.12      100.00
-------------+-----------------------------------
       Total |     30,221      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      6,708       24.64       24.64
      Elevated |      4,703       17.28       41.92
 High, stage I |     10,899       40.04       81.96
High, stage II |      4,912       18.04      100.00
---------------+-----------------------------------
         Total |     27,222      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      6,708       22.20       22.20
      Elevated |      4,703       15.56       37.76
 High, stage I |     10,899       36.06       73.82
High, stage II |      4,912       16.25       90.08
       Unknown |      2,999        9.92      100.00
---------------+-----------------------------------
         Total |     30,221      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,243       66.98       66.98
          1 |      9,978       33.02      100.00
------------+-----------------------------------
      Total |     30,221      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,592       15.19       15.19
          1 |     25,629       84.81      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,099       79.74       79.74
          1 |      6,122       20.26      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,770       91.89       91.89
          1 |      2,451        8.11      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,238       80.20       80.20
          1 |      5,983       19.80      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     23,292       77.07       77.07
  T1DM, controlled |        732        2.42       79.49
T1DM, uncontrolled |        184        0.61       80.10
  T2DM, controlled |      4,861       16.08       96.19
T2DM, uncontrolled |      1,127        3.73       99.92
Diabetes, no HbA1c |         25        0.08      100.00
-------------------+-----------------------------------
             Total |     30,221      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     24,142       79.88       79.88
    Last year |        121        0.40       80.29
2-5 years ago |        501        1.66       81.94
     5+ years |      5,457       18.06      100.00
--------------+-----------------------------------
        Total |     30,221      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     24,327       80.50       80.50
    Last year |        118        0.39       80.89
2-5 years ago |        437        1.45       82.33
     5+ years |      5,339       17.67      100.00
--------------+-----------------------------------
        Total |     30,221      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,205       80.09       80.09
          1 |      6,016       19.91      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,108       79.77       79.77
          1 |      6,113       20.23      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,146       79.90       79.90
          1 |      6,075       20.10      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,180       80.01       80.01
          1 |      6,041       19.99      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,219       80.14       80.14
          1 |      6,002       19.86      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,132       79.85       79.85
          1 |      6,089       20.15      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
         30 |         39        0.14        0.14
         45 |      1,143        3.98        4.12
         60 |     27,525       95.88      100.00
------------+-----------------------------------
      Total |     28,707      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |     29,039       96.09       96.09
Stage 3a/3b egfr 30-60       |      1,182        3.91      100.00
-----------------------------+-----------------------------------
                       Total |     30,221      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,321       63.93       63.93
          1 |     10,900       36.07      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,266       80.30       80.30
          1 |      5,955       19.70      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,162       79.95       79.95
          1 |      6,059       20.05      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     21,125       69.90       69.90
               4 |      6,076       20.11       90.01
 5 most deprived |      3,020        9.99      100.00
-----------------+-----------------------------------
           Total |     30,221      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     21,125       69.90       69.90
               4 |      6,076       20.11       90.01
 5 most deprived |      3,020        9.99      100.00
-----------------+-----------------------------------
           Total |     30,221      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     24,180       80.01       80.01
Asian or Asian British |      2,940        9.73       89.74
                 Other |      3,101       10.26      100.00
-----------------------+-----------------------------------
                 Total |     30,221      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     24,180       80.01       80.01
Asian or Asian British |      2,940        9.73       89.74
                 Other |      3,101       10.26      100.00
-----------------------+-----------------------------------
                 Total |     30,221      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,999        9.92        9.92
          2 |      2,976        9.85       19.77
          3 |      3,058       10.12       29.89
          4 |      3,078       10.18       40.07
          5 |      3,093       10.23       50.31
          6 |      2,995        9.91       60.22
          7 |      3,046       10.08       70.30
          8 |      3,047       10.08       80.38
          9 |      2,939        9.73       90.11
         10 |      2,990        9.89      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,184       73.41       73.41
          1 |      8,037       26.59      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,905       59.25       59.25
          1 |     12,316       40.75      100.00
------------+-----------------------------------
      Total |     30,221      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,953       19.70       19.70
          1 |     24,268       80.30      100.00
------------+-----------------------------------
      Total |     30,221      100.00

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_posit~S |      1,227   03jan2022    47.79268  04mar2021  21feb2022
date_covid~r |      1,215   04jan2022     48.8626  13mar2021  21feb2022
date_covid~b |     24,268   22jul2021     123.016  21dec2020  21feb2022
date_covid~n |      8,867   19jun2021    119.0252  20dec2020  21feb2022
date_covid~s |     24,213   21jul2021    122.8928  21dec2020  21feb2022
-------------+---------------------------------------------------------
date_covid~h |     12,316   21jul2021     123.538  21dec2020  21feb2022
date_non_c~h |      8,037   23jul2021    122.5532  21dec2020  21feb2022
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |     1,479      5,871 |     7,350 
           |     24.84      24.19 |     24.32 
-----------+----------------------+----------
    70-<80 |     2,779     11,569 |    14,348 
           |     46.68      47.67 |     47.48 
-----------+----------------------+----------
       80+ |     1,695      6,828 |     8,523 
           |     28.47      28.14 |     28.20 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,059     12,409 |    15,468 
           |     51.39      51.13 |     51.18 
-----------+----------------------+----------
         1 |     2,894     11,859 |    14,753 
           |     48.61      48.87 |     48.82 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       538      2,284 |     2,822 
                     |      9.04       9.41 |      9.34 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     1,417      5,596 |     7,013 
                     |     23.80      23.06 |     23.21 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,029      4,360 |     5,389 
                     |     17.29      17.97 |     17.83 
---------------------+----------------------+----------
   Obese I (30-34.9) |       878      3,462 |     4,340 
                     |     14.75      14.27 |     14.36 
---------------------+----------------------+----------
  Obese II (35-39.9) |       542      2,122 |     2,664 
                     |      9.10       8.74 |      8.82 
---------------------+----------------------+----------
     Obese III (40+) |       320      1,421 |     1,741 
                     |      5.38       5.86 |      5.76 
---------------------+----------------------+----------
        Unknown (.u) |     1,229      5,023 |     6,252 
                     |     20.65      20.70 |     20.69 
---------------------+----------------------+----------
               Total |     5,953     24,268 |    30,221 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       223      1,021 |     1,244 
             |      3.75       4.21 |      4.12 
-------------+----------------------+----------
      Former |       120        470 |       590 
             |      2.02       1.94 |      1.95 
-------------+----------------------+----------
     Current |       739      2,831 |     3,570 
             |     12.41      11.67 |     11.81 
-------------+----------------------+----------
Unknown (.u) |     4,871     19,946 |    24,817 
             |     81.82      82.19 |     82.12 
-------------+----------------------+----------
       Total |     5,953     24,268 |    30,221 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     4,213     17,263 |    21,476 
                     |     70.77      71.13 |     71.06 
---------------------+----------------------+----------
   Obese I (30-34.9) |       878      3,462 |     4,340 
                     |     14.75      14.27 |     14.36 
---------------------+----------------------+----------
  Obese II (35-39.9) |       542      2,122 |     2,664 
                     |      9.10       8.74 |      8.82 
---------------------+----------------------+----------
     Obese III (40+) |       320      1,421 |     1,741 
                     |      5.38       5.86 |      5.76 
---------------------+----------------------+----------
               Total |     5,953     24,268 |    30,221 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       873      3,719 |     4,592 
           |     14.66      15.32 |     15.19 
-----------+----------------------+----------
         1 |     5,080     20,549 |    25,629 
           |     85.34      84.68 |     84.81 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,769     19,330 |    24,099 
           |     80.11      79.65 |     79.74 
-----------+----------------------+----------
         1 |     1,184      4,938 |     6,122 
           |     19.89      20.35 |     20.26 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     5,460     22,310 |    27,770 
           |     91.72      91.93 |     91.89 
-----------+----------------------+----------
         1 |       493      1,958 |     2,451 
           |      8.28       8.07 |      8.11 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,807     19,431 |    24,238 
           |     80.75      80.07 |     80.20 
-----------+----------------------+----------
         1 |     1,146      4,837 |     5,983 
           |     19.25      19.93 |     19.80 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
23

**TABLE OF diabcat covid_tpp_prob REDACTED DUE TO SMALL N**

33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     4,717     19,425 |    24,142 
              |     79.24      80.04 |     79.88 
--------------+----------------------+----------
    Last year |        31         90 |       121 
              |      0.52       0.37 |      0.40 
--------------+----------------------+----------
2-5 years ago |       101        400 |       501 
              |      1.70       1.65 |      1.66 
--------------+----------------------+----------
     5+ years |     1,104      4,353 |     5,457 
              |     18.55      17.94 |     18.06 
--------------+----------------------+----------
        Total |     5,953     24,268 |    30,221 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     4,805     19,522 |    24,327 
              |     80.72      80.44 |     80.50 
--------------+----------------------+----------
    Last year |        20         98 |       118 
              |      0.34       0.40 |      0.39 
--------------+----------------------+----------
2-5 years ago |        84        353 |       437 
              |      1.41       1.45 |      1.45 
--------------+----------------------+----------
     5+ years |     1,044      4,295 |     5,339 
              |     17.54      17.70 |     17.67 
--------------+----------------------+----------
        Total |     5,953     24,268 |    30,221 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,736     19,469 |    24,205 
           |     79.56      80.22 |     80.09 
-----------+----------------------+----------
         1 |     1,217      4,799 |     6,016 
           |     20.44      19.78 |     19.91 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,733     19,375 |    24,108 
           |     79.51      79.84 |     79.77 
-----------+----------------------+----------
         1 |     1,220      4,893 |     6,113 
           |     20.49      20.16 |     20.23 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,743     19,403 |    24,146 
           |     79.67      79.95 |     79.90 
-----------+----------------------+----------
         1 |     1,210      4,865 |     6,075 
           |     20.33      20.05 |     20.10 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,728     19,452 |    24,180 
           |     79.42      80.15 |     80.01 
-----------+----------------------+----------
         1 |     1,225      4,816 |     6,041 
           |     20.58      19.85 |     19.99 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,805     19,414 |    24,219 
           |     80.72      80.00 |     80.14 
-----------+----------------------+----------
         1 |     1,148      4,854 |     6,002 
           |     19.28      20.00 |     19.86 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,706     19,426 |    24,132 
           |     79.05      80.05 |     79.85 
-----------+----------------------+----------
         1 |     1,247      4,842 |     6,089 
           |     20.95      19.95 |     20.15 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        30 |         6         33 |        39 
           |      0.11       0.14 |      0.14 
-----------+----------------------+----------
        45 |       211        932 |     1,143 
           |      3.73       4.04 |      3.98 
-----------+----------------------+----------
        60 |     5,433     22,092 |    27,525 
           |     96.16      95.81 |     95.88 
-----------+----------------------+----------
     Total |     5,650     23,057 |    28,707 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,781     15,540 |    19,321 
           |     63.51      64.03 |     63.93 
-----------+----------------------+----------
         1 |     2,172      8,728 |    10,900 
           |     36.49      35.97 |     36.07 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     5,736     23,303 |    29,039 
                      |     96.35      96.02 |     96.09 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       217        965 |     1,182 
                      |      3.65       3.98 |      3.91 
----------------------+----------------------+----------
                Total |     5,953     24,268 |    30,221 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,766     19,500 |    24,266 
           |     80.06      80.35 |     80.30 
-----------+----------------------+----------
         1 |     1,187      4,768 |     5,955 
           |     19.94      19.65 |     19.70 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,761     19,401 |    24,162 
           |     79.98      79.94 |     79.95 
-----------+----------------------+----------
         1 |     1,192      4,867 |     6,059 
           |     20.02      20.06 |     20.05 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     4,191     16,934 |    21,125 
                 |     70.40      69.78 |     69.90 
-----------------+----------------------+----------
               4 |     1,175      4,901 |     6,076 
                 |     19.74      20.20 |     20.11 
-----------------+----------------------+----------
 5 most deprived |       587      2,433 |     3,020 
                 |      9.86      10.03 |      9.99 
-----------------+----------------------+----------
           Total |     5,953     24,268 |    30,221 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     4,782     19,398 |    24,180 
                      |     80.33      79.93 |     80.01 
----------------------+----------------------+----------
Asian or Asian Britis |       582      2,358 |     2,940 
                      |      9.78       9.72 |      9.73 
----------------------+----------------------+----------
                Other |       589      2,512 |     3,101 
                      |      9.89      10.35 |     10.26 
----------------------+----------------------+----------
                Total |     5,953     24,268 |    30,221 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       582      2,417 |     2,999 
           |      9.78       9.96 |      9.92 
-----------+----------------------+----------
         2 |       591      2,385 |     2,976 
           |      9.93       9.83 |      9.85 
-----------+----------------------+----------
         3 |       588      2,470 |     3,058 
           |      9.88      10.18 |     10.12 
-----------+----------------------+----------
         4 |       624      2,454 |     3,078 
           |     10.48      10.11 |     10.18 
-----------+----------------------+----------
         5 |       614      2,479 |     3,093 
           |     10.31      10.22 |     10.23 
-----------+----------------------+----------
         6 |       580      2,415 |     2,995 
           |      9.74       9.95 |      9.91 
-----------+----------------------+----------
         7 |       602      2,444 |     3,046 
           |     10.11      10.07 |     10.08 
-----------+----------------------+----------
         8 |       579      2,468 |     3,047 
           |      9.73      10.17 |     10.08 
-----------+----------------------+----------
         9 |       611      2,328 |     2,939 
           |     10.26       9.59 |      9.73 
-----------+----------------------+----------
        10 |       582      2,408 |     2,990 
           |      9.78       9.92 |      9.89 
-----------+----------------------+----------
     Total |     5,953     24,268 |    30,221 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped | outcome: covid death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |     4,361      2,989 |     7,350 
           |     24.36      24.27 |     24.32 
-----------+----------------------+----------
    70-<80 |     8,483      5,865 |    14,348 
           |     47.38      47.62 |     47.48 
-----------+----------------------+----------
       80+ |     5,061      3,462 |     8,523 
           |     28.27      28.11 |     28.20 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,168      6,300 |    15,468 
           |     51.20      51.15 |     51.18 
-----------+----------------------+----------
         1 |     8,737      6,016 |    14,753 
           |     48.80      48.85 |     48.82 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     | outcome: covid death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     1,678      1,144 |     2,822 
                     |      9.37       9.29 |      9.34 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     4,084      2,929 |     7,013 
                     |     22.81      23.78 |     23.21 
---------------------+----------------------+----------
Overweight (25-29.9) |     3,218      2,171 |     5,389 
                     |     17.97      17.63 |     17.83 
---------------------+----------------------+----------
   Obese I (30-34.9) |     2,583      1,757 |     4,340 
                     |     14.43      14.27 |     14.36 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,578      1,086 |     2,664 
                     |      8.81       8.82 |      8.82 
---------------------+----------------------+----------
     Obese III (40+) |     1,065        676 |     1,741 
                     |      5.95       5.49 |      5.76 
---------------------+----------------------+----------
        Unknown (.u) |     3,699      2,553 |     6,252 
                     |     20.66      20.73 |     20.69 
---------------------+----------------------+----------
               Total |    17,905     12,316 |    30,221 
                     |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking | outcome: covid death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       753        491 |     1,244 
             |      4.21       3.99 |      4.12 
-------------+----------------------+----------
      Former |       358        232 |       590 
             |      2.00       1.88 |      1.95 
-------------+----------------------+----------
     Current |     2,153      1,417 |     3,570 
             |     12.02      11.51 |     11.81 
-------------+----------------------+----------
Unknown (.u) |    14,641     10,176 |    24,817 
             |     81.77      82.62 |     82.12 
-------------+----------------------+----------
       Total |    17,905     12,316 |    30,221 
             |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity | outcome: covid death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    12,679      8,797 |    21,476 
                     |     70.81      71.43 |     71.06 
---------------------+----------------------+----------
   Obese I (30-34.9) |     2,583      1,757 |     4,340 
                     |     14.43      14.27 |     14.36 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,578      1,086 |     2,664 
                     |      8.81       8.82 |      8.82 
---------------------+----------------------+----------
     Obese III (40+) |     1,065        676 |     1,741 
                     |      5.95       5.49 |      5.76 
---------------------+----------------------+----------
               Total |    17,905     12,316 |    30,221 
                     |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,676      1,916 |     4,592 
           |     14.95      15.56 |     15.19 
-----------+----------------------+----------
         1 |    15,229     10,400 |    25,629 
           |     85.05      84.44 |     84.81 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator | outcome: covid death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,278      9,821 |    24,099 
           |     79.74      79.74 |     79.74 
-----------+----------------------+----------
         1 |     3,627      2,495 |     6,122 
           |     20.26      20.26 |     20.26 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma | outcome: covid death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    16,455     11,315 |    27,770 
           |     91.90      91.87 |     91.89 
-----------+----------------------+----------
         1 |     1,450      1,001 |     2,451 
           |      8.10       8.13 |      8.11 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac | outcome: covid death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,416      9,822 |    24,238 
           |     80.51      79.75 |     80.20 
-----------+----------------------+----------
         1 |     3,489      2,494 |     5,983 
           |     19.49      20.25 |     19.80 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   | outcome: covid death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |    13,789      9,503 |    23,292 
                   |     77.01      77.16 |     77.07 
-------------------+----------------------+----------
  T1DM, controlled |       427        305 |       732 
                   |      2.38       2.48 |      2.42 
-------------------+----------------------+----------
T1DM, uncontrolled |       109         75 |       184 
                   |      0.61       0.61 |      0.61 
-------------------+----------------------+----------
  T2DM, controlled |     2,861      2,000 |     4,861 
                   |     15.98      16.24 |     16.08 
-------------------+----------------------+----------
T2DM, uncontrolled |       703        424 |     1,127 
                   |      3.93       3.44 |      3.73 
-------------------+----------------------+----------
Diabetes, no HbA1c |        16          9 |        25 
                   |      0.09       0.07 |      0.08 
-------------------+----------------------+----------
             Total |    17,905     12,316 |    30,221 
                   |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo | outcome: covid death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |    14,264      9,878 |    24,142 
              |     79.66      80.20 |     79.88 
--------------+----------------------+----------
    Last year |        59         62 |       121 
              |      0.33       0.50 |      0.40 
--------------+----------------------+----------
2-5 years ago |       281        220 |       501 
              |      1.57       1.79 |      1.66 
--------------+----------------------+----------
     5+ years |     3,301      2,156 |     5,457 
              |     18.44      17.51 |     18.06 
--------------+----------------------+----------
        Total |    17,905     12,316 |    30,221 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica | outcome: covid death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |    14,403      9,924 |    24,327 
              |     80.44      80.58 |     80.50 
--------------+----------------------+----------
    Last year |        67         51 |       118 
              |      0.37       0.41 |      0.39 
--------------+----------------------+----------
2-5 years ago |       256        181 |       437 
              |      1.43       1.47 |      1.45 
--------------+----------------------+----------
     5+ years |     3,179      2,160 |     5,339 
              |     17.75      17.54 |     17.67 
--------------+----------------------+----------
        Total |    17,905     12,316 |    30,221 
              |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on | outcome: covid death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,317      9,888 |    24,205 
           |     79.96      80.29 |     80.09 
-----------+----------------------+----------
         1 |     3,588      2,428 |     6,016 
           |     20.04      19.71 |     19.91 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |   Failure/censoring
     solid |     indicator for
     organ | outcome: covid death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,290      9,818 |    24,108 
           |     79.81      79.72 |     79.77 
-----------+----------------------+----------
         1 |     3,615      2,498 |     6,113 
           |     20.19      20.28 |     20.23 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,303      9,843 |    24,146 
           |     79.88      79.92 |     79.90 
-----------+----------------------+----------
         1 |     3,602      2,473 |     6,075 
           |     20.12      20.08 |     20.10 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,263      9,917 |    24,180 
           |     79.66      80.52 |     80.01 
-----------+----------------------+----------
         1 |     3,642      2,399 |     6,041 
           |     20.34      19.48 |     19.99 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic | outcome: covid death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,409      9,810 |    24,219 
           |     80.47      79.65 |     80.14 
-----------+----------------------+----------
         1 |     3,496      2,506 |     6,002 
           |     19.53      20.35 |     19.86 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or | outcome: covid death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,252      9,880 |    24,132 
           |     79.60      80.22 |     79.85 
-----------+----------------------+----------
         1 |     3,653      2,436 |     6,089 
           |     20.40      19.78 |     20.15 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Calculated | outcome: covid death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        30 |        28         11 |        39 
           |      0.16       0.09 |      0.14 
-----------+----------------------+----------
        45 |       671        472 |     1,143 
           |      3.94       4.03 |      3.98 
-----------+----------------------+----------
        60 |    16,310     11,215 |    27,525 
           |     95.89      95.87 |     95.88 
-----------+----------------------+----------
     Total |    17,009     11,698 |    28,707 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 End-stage |     indicator for
     renal | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    11,449      7,872 |    19,321 
           |     63.94      63.92 |     63.93 
-----------+----------------------+----------
         1 |     6,456      4,444 |    10,900 
           |     36.06      36.08 |     36.07 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney | outcome: covid death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    17,206     11,833 |    29,039 
                      |     96.10      96.08 |     96.09 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       699        483 |     1,182 
                      |      3.90       3.92 |      3.91 
----------------------+----------------------+----------
                Total |    17,905     12,316 |    30,221 
                      |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi | outcome: covid death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,350      9,916 |    24,266 
           |     80.15      80.51 |     80.30 
-----------+----------------------+----------
         1 |     3,555      2,400 |     5,955 
           |     19.85      19.49 |     19.70 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,370      9,792 |    24,162 
           |     80.26      79.51 |     79.95 
-----------+----------------------+----------
         1 |     3,535      2,524 |     6,059 
           |     19.74      20.49 |     20.05 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation | outcome: covid death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    12,500      8,625 |    21,125 
                 |     69.81      70.03 |     69.90 
-----------------+----------------------+----------
               4 |     3,598      2,478 |     6,076 
                 |     20.09      20.12 |     20.11 
-----------------+----------------------+----------
 5 most deprived |     1,807      1,213 |     3,020 
                 |     10.09       9.85 |      9.99 
-----------------+----------------------+----------
           Total |    17,905     12,316 |    30,221 
                 |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      | outcome: covid death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |    14,326      9,854 |    24,180 
                      |     80.01      80.01 |     80.01 
----------------------+----------------------+----------
Asian or Asian Britis |     1,727      1,213 |     2,940 
                      |      9.65       9.85 |      9.73 
----------------------+----------------------+----------
                Other |     1,852      1,249 |     3,101 
                      |     10.34      10.14 |     10.26 
----------------------+----------------------+----------
                Total |    17,905     12,316 |    30,221 
                      |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,789      1,210 |     2,999 
           |      9.99       9.82 |      9.92 
-----------+----------------------+----------
         2 |     1,736      1,240 |     2,976 
           |      9.70      10.07 |      9.85 
-----------+----------------------+----------
         3 |     1,771      1,287 |     3,058 
           |      9.89      10.45 |     10.12 
-----------+----------------------+----------
         4 |     1,779      1,299 |     3,078 
           |      9.94      10.55 |     10.18 
-----------+----------------------+----------
         5 |     1,869      1,224 |     3,093 
           |     10.44       9.94 |     10.23 
-----------+----------------------+----------
         6 |     1,759      1,236 |     2,995 
           |      9.82      10.04 |      9.91 
-----------+----------------------+----------
         7 |     1,805      1,241 |     3,046 
           |     10.08      10.08 |     10.08 
-----------+----------------------+----------
         8 |     1,861      1,186 |     3,047 
           |     10.39       9.63 |     10.08 
-----------+----------------------+----------
         9 |     1,736      1,203 |     2,939 
           |      9.70       9.77 |      9.73 
-----------+----------------------+----------
        10 |     1,800      1,190 |     2,990 
           |     10.05       9.66 |      9.89 
-----------+----------------------+----------
     Total |    17,905     12,316 |    30,221 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |     5,378      1,972 |     7,350 
           |     24.24      24.54 |     24.32 
-----------+----------------------+----------
    70-<80 |    10,560      3,788 |    14,348 
           |     47.60      47.13 |     47.48 
-----------+----------------------+----------
       80+ |     6,246      2,277 |     8,523 
           |     28.16      28.33 |     28.20 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    11,378      4,090 |    15,468 
           |     51.29      50.89 |     51.18 
-----------+----------------------+----------
         1 |    10,806      3,947 |    14,753 
           |     48.71      49.11 |     48.82 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     2,044        778 |     2,822 
                     |      9.21       9.68 |      9.34 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     5,157      1,856 |     7,013 
                     |     23.25      23.09 |     23.21 
---------------------+----------------------+----------
Overweight (25-29.9) |     3,971      1,418 |     5,389 
                     |     17.90      17.64 |     17.83 
---------------------+----------------------+----------
   Obese I (30-34.9) |     3,238      1,102 |     4,340 
                     |     14.60      13.71 |     14.36 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,922        742 |     2,664 
                     |      8.66       9.23 |      8.82 
---------------------+----------------------+----------
     Obese III (40+) |     1,262        479 |     1,741 
                     |      5.69       5.96 |      5.76 
---------------------+----------------------+----------
        Unknown (.u) |     4,590      1,662 |     6,252 
                     |     20.69      20.68 |     20.69 
---------------------+----------------------+----------
               Total |    22,184      8,037 |    30,221 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       912        332 |     1,244 
             |      4.11       4.13 |      4.12 
-------------+----------------------+----------
      Former |       430        160 |       590 
             |      1.94       1.99 |      1.95 
-------------+----------------------+----------
     Current |     2,609        961 |     3,570 
             |     11.76      11.96 |     11.81 
-------------+----------------------+----------
Unknown (.u) |    18,233      6,584 |    24,817 
             |     82.19      81.92 |     82.12 
-------------+----------------------+----------
       Total |    22,184      8,037 |    30,221 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    15,762      5,714 |    21,476 
                     |     71.05      71.10 |     71.06 
---------------------+----------------------+----------
   Obese I (30-34.9) |     3,238      1,102 |     4,340 
                     |     14.60      13.71 |     14.36 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,922        742 |     2,664 
                     |      8.66       9.23 |      8.82 
---------------------+----------------------+----------
     Obese III (40+) |     1,262        479 |     1,741 
                     |      5.69       5.96 |      5.76 
---------------------+----------------------+----------
               Total |    22,184      8,037 |    30,221 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,403      1,189 |     4,592 
           |     15.34      14.79 |     15.19 
-----------+----------------------+----------
         1 |    18,781      6,848 |    25,629 
           |     84.66      85.21 |     84.81 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,730      6,369 |    24,099 
           |     79.92      79.25 |     79.74 
-----------+----------------------+----------
         1 |     4,454      1,668 |     6,122 
           |     20.08      20.75 |     20.26 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    20,404      7,366 |    27,770 
           |     91.98      91.65 |     91.89 
-----------+----------------------+----------
         1 |     1,780        671 |     2,451 
           |      8.02       8.35 |      8.11 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,789      6,449 |    24,238 
           |     80.19      80.24 |     80.20 
-----------+----------------------+----------
         1 |     4,395      1,588 |     5,983 
           |     19.81      19.76 |     19.80 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: non-covid
                   |         death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |    17,101      6,191 |    23,292 
                   |     77.09      77.03 |     77.07 
-------------------+----------------------+----------
  T1DM, controlled |       546        186 |       732 
                   |      2.46       2.31 |      2.42 
-------------------+----------------------+----------
T1DM, uncontrolled |       135         49 |       184 
                   |      0.61       0.61 |      0.61 
-------------------+----------------------+----------
  T2DM, controlled |     3,582      1,279 |     4,861 
                   |     16.15      15.91 |     16.08 
-------------------+----------------------+----------
T2DM, uncontrolled |       803        324 |     1,127 
                   |      3.62       4.03 |      3.73 
-------------------+----------------------+----------
Diabetes, no HbA1c |        17          8 |        25 
                   |      0.08       0.10 |      0.08 
-------------------+----------------------+----------
             Total |    22,184      8,037 |    30,221 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |    17,741      6,401 |    24,142 
              |     79.97      79.64 |     79.88 
--------------+----------------------+----------
    Last year |        93         28 |       121 
              |      0.42       0.35 |      0.40 
--------------+----------------------+----------
2-5 years ago |       375        126 |       501 
              |      1.69       1.57 |      1.66 
--------------+----------------------+----------
     5+ years |     3,975      1,482 |     5,457 
              |     17.92      18.44 |     18.06 
--------------+----------------------+----------
        Total |    22,184      8,037 |    30,221 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |    17,865      6,462 |    24,327 
              |     80.53      80.40 |     80.50 
--------------+----------------------+----------
    Last year |        88         30 |       118 
              |      0.40       0.37 |      0.39 
--------------+----------------------+----------
2-5 years ago |       334        103 |       437 
              |      1.51       1.28 |      1.45 
--------------+----------------------+----------
     5+ years |     3,897      1,442 |     5,339 
              |     17.57      17.94 |     17.67 
--------------+----------------------+----------
        Total |    22,184      8,037 |    30,221 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,769      6,436 |    24,205 
           |     80.10      80.08 |     80.09 
-----------+----------------------+----------
         1 |     4,415      1,601 |     6,016 
           |     19.90      19.92 |     19.91 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,690      6,418 |    24,108 
           |     79.74      79.86 |     79.77 
-----------+----------------------+----------
         1 |     4,494      1,619 |     6,113 
           |     20.26      20.14 |     20.23 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,738      6,408 |    24,146 
           |     79.96      79.73 |     79.90 
-----------+----------------------+----------
         1 |     4,446      1,629 |     6,075 
           |     20.04      20.27 |     20.10 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,812      6,368 |    24,180 
           |     80.29      79.23 |     80.01 
-----------+----------------------+----------
         1 |     4,372      1,669 |     6,041 
           |     19.71      20.77 |     19.99 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,730      6,489 |    24,219 
           |     79.92      80.74 |     80.14 
-----------+----------------------+----------
         1 |     4,454      1,548 |     6,002 
           |     20.08      19.26 |     19.86 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,756      6,376 |    24,132 
           |     80.04      79.33 |     79.85 
-----------+----------------------+----------
         1 |     4,428      1,661 |     6,089 
           |     19.96      20.67 |     20.15 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Calculated |         death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        30 |        26         13 |        39 
           |      0.12       0.17 |      0.14 
-----------+----------------------+----------
        45 |       841        302 |     1,143 
           |      3.99       3.95 |      3.98 
-----------+----------------------+----------
        60 |    20,202      7,323 |    27,525 
           |     95.88      95.88 |     95.88 
-----------+----------------------+----------
     Total |    21,069      7,638 |    28,707 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,205      5,116 |    19,321 
           |     64.03      63.66 |     63.93 
-----------+----------------------+----------
         1 |     7,979      2,921 |    10,900 
           |     35.97      36.34 |     36.07 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    21,317      7,722 |    29,039 
                      |     96.09      96.08 |     96.09 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       867        315 |     1,182 
                      |      3.91       3.92 |      3.91 
----------------------+----------------------+----------
                Total |    22,184      8,037 |    30,221 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,807      6,459 |    24,266 
           |     80.27      80.37 |     80.30 
-----------+----------------------+----------
         1 |     4,377      1,578 |     5,955 
           |     19.73      19.63 |     19.70 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,711      6,451 |    24,162 
           |     79.84      80.27 |     79.95 
-----------+----------------------+----------
         1 |     4,473      1,586 |     6,059 
           |     20.16      19.73 |     20.05 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    15,546      5,579 |    21,125 
                 |     70.08      69.42 |     69.90 
-----------------+----------------------+----------
               4 |     4,432      1,644 |     6,076 
                 |     19.98      20.46 |     20.11 
-----------------+----------------------+----------
 5 most deprived |     2,206        814 |     3,020 
                 |      9.94      10.13 |      9.99 
-----------------+----------------------+----------
           Total |    22,184      8,037 |    30,221 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |    17,737      6,443 |    24,180 
                      |     79.95      80.17 |     80.01 
----------------------+----------------------+----------
Asian or Asian Britis |     2,149        791 |     2,940 
                      |      9.69       9.84 |      9.73 
----------------------+----------------------+----------
                Other |     2,298        803 |     3,101 
                      |     10.36       9.99 |     10.26 
----------------------+----------------------+----------
                Total |    22,184      8,037 |    30,221 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: non-covid
Partnershi |         death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     2,177        822 |     2,999 
           |      9.81      10.23 |      9.92 
-----------+----------------------+----------
         2 |     2,142        834 |     2,976 
           |      9.66      10.38 |      9.85 
-----------+----------------------+----------
         3 |     2,267        791 |     3,058 
           |     10.22       9.84 |     10.12 
-----------+----------------------+----------
         4 |     2,273        805 |     3,078 
           |     10.25      10.02 |     10.18 
-----------+----------------------+----------
         5 |     2,249        844 |     3,093 
           |     10.14      10.50 |     10.23 
-----------+----------------------+----------
         6 |     2,229        766 |     2,995 
           |     10.05       9.53 |      9.91 
-----------+----------------------+----------
         7 |     2,246        800 |     3,046 
           |     10.12       9.95 |     10.08 
-----------+----------------------+----------
         8 |     2,238        809 |     3,047 
           |     10.09      10.07 |     10.08 
-----------+----------------------+----------
         9 |     2,182        757 |     2,939 
           |      9.84       9.42 |      9.73 
-----------+----------------------+----------
        10 |     2,181        809 |     2,990 
           |      9.83      10.07 |      9.89 
-----------+----------------------+----------
     Total |    22,184      8,037 |    30,221 
           |    100.00     100.00 |    100.00 

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  /workspace/logs/04a_an_descriptive_tables.log
  log type:  text
 closed on:  15 Mar 2023, 13:55:52
-------------------------------------------------------------------------------
