-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/04b_an_descriptive_table_2.log
  log type:  text
 opened on:  15 Mar 2023, 13:56:27

. 
. 
. *****************************************************************************
> **
. *Generic code to output one row of table
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) condition(string)
  2. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontent ("`variable'") _tab ("`condition'") _tab
  3. 
.         cou
  4.         local overalldenom=r(N)
  5. 
.         cou if `variable' `condition'
  6.         local rowdenom = r(N)
  7.         local colpct = 100*(r(N)/`overalldenom')
  8.         file write tablecontent (`rowdenom')  (" (") %3.1f (`colpct') (")"
> ) _tab
  9.         
.         foreach outcome in covid_tpp_prob  covidadmission  covid_death non_co
> vid_death {
 10.         cou if `outcome'==1 & `variable' `condition'
 11.         local pct = 100*(r(N)/`rowdenom')
 12.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab 
 13. 
. }
 14.         file write tablecontent _n 
 15. end

. 
. *****************************************************************************
> **
. *Generic code to output one section (varible) within table (calls above)
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) start(real) end(real) [missing] 
  2. 
.         foreach varlevel of numlist `start'/`end'{
  3.                 generaterow, variable(`variable') condition("==`varlevel'"
> ) 
  4.         }
  5.         if "`missing'"!="" generaterow, variable(`variable') condition(">=
> .") 
  6. 
. end

. 
. *****************************************************************************
> **
. 
. 
. forvalues x=0/1 {
  2. 
. *Set up output file
. cap file close tablecontent
  3. file open tablecontent using ./output/04b_an_descriptive_table_2_ageband`x
> '.txt, write text replace
  4. 
. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  5. 
. gen byte cons=1
  6. tabulatevariable, variable(cons) start(1) end(1) 
  7. file write tablecontent _n
  8. 
. tabulatevariable, variable(agegroup) start(1) end(7) 
  9. file write tablecontent _n
 10. 
. tabulatevariable, variable(male) start(0) end(1) 
 11. file write tablecontent _n
 12. 
. tabulatevariable, variable(bmicat) start(1) end(6) missing 
 13. file write tablecontent _n
 14. 
. tabulatevariable, variable(smoke) start(1) end(3) missing 
 15. file write tablecontent _n
 16. 
. tabulatevariable, variable(ethnicity) start(1) end(5) missing 
 17. file write tablecontent _n
 18. 
. tabulatevariable, variable(imd) start(1) end(5) 
 19. file write tablecontent _n
 20. 
. tabulatevariable, variable(tot_adults_hh) start(1) end(3) 
 21. file write tablecontent _n
 22. 
. tabulatevariable, variable(bpcat) start(1) end(4) missing 
 23. tabulatevariable, variable(htdiag_or_highbp) start(1) end(1) 
 24. file write tablecontent _n
 25. 
. **COMORBIDITIES
. *RESPIRATORY
. tabulatevariable, variable(chronic_respiratory_disease) start(1) end(1) 
 26. *ASTHMA
. tabulatevariable, variable(asthma) start(1) end(1)  /*ever asthma*/
 27. *CARDIAC
. tabulatevariable, variable(chronic_cardiac_disease) start(1) end(1) 
 28. file write tablecontent _n
 29. *DIABETES
. tabulatevariable, variable(diabcat) start(1) end(6) 
 30. file write tablecontent _n
 31. *CANCER EX HAEM
. tabulatevariable, variable(cancer_haem_cat) start(2) end(4)  /*<1, 1-4.9, 5+ 
> years ago*/
 32. file write tablecontent _n
 33. *CANCER HAEM
. tabulatevariable, variable(cancer_exhaem_cat) start(2) end(4)  /*<1, 1-4.9, 5
> + years ago*/
 34. file write tablecontent _n
 35. *REDUCED KIDNEY FUNCTION
. tabulatevariable, variable(reduced_kidney_function_cat) start(2) end(3) 
 36. *ESRD
. tabulatevariable, variable(esrd) start(1) end(1) 
 37. *LIVER
. tabulatevariable, variable(chronic_liver_disease) start(1) end(1) 
 38. *STROKE/DEMENTIA
. tabulatevariable, variable(stroke_dementia) start(1) end(1) 
 39. *OTHER NEURO
. tabulatevariable, variable(other_neuro) start(1) end(1) 
 40. *ORGAN TRANSPLANT
. tabulatevariable, variable(other_transplant) start(1) end(1) 
 41. *SPLEEN
. tabulatevariable, variable(asplenia) start(1) end(1) 
 42. *RA_SLE_PSORIASIS
. tabulatevariable, variable(ra_sle_psoriasis) start(1) end(1) 
 43. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(other_immuno) start(1) end(1) 
 44. 
. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(shield) start(1) end(1) 
 45. 
. file close tablecontent
 46. 
. }
(note: file ./output/04b_an_descriptive_table_2_ageband0.txt not found)
  107,238
  107,238
  85,861
  32,049
  43,429
  28,861
  107,238
  26,704
  21,435
  8,004
  10,900
  7,128
  107,238
  23,308
  18,642
  6,879
  9,278
  6,281
  107,238
  22,470
  17,970
  6,828
  9,152
  5,958
  107,238
  23,267
  18,626
  6,926
  9,545
  6,290
  107,238
  11,489
  9,188
  3,412
  4,554
  3,204
  107,238
  0
  0
  0
  0
  0
  107,238
  0
  0
  0
  0
  0
  107,238
  54,876
  43,913
  16,401
  22,242
  14,640
  107,238
  52,362
  41,948
  15,648
  21,187
  14,221
  107,238
  9,807
  7,812
  2,912
  4,042
  2,630
  107,238
  24,197
  19,403
  7,215
  9,870
  6,414
  107,238
  19,230
  15,442
  5,851
  7,628
  5,290
  107,238
  14,673
  11,817
  4,319
  6,031
  3,873
  107,238
  9,135
  7,308
  2,664
  3,696
  2,391
  107,238
  6,096
  4,840
  1,850
  2,440
  1,737
  107,238
  24,100
  19,239
  7,238
  9,722
  6,526
  107,238
  4,394
  3,514
  1,334
  1,793
  1,132
  107,238
  2,168
  1,737
  633
  907
  566
  107,238
  12,913
  10,372
  3,936
  5,258
  3,451
  107,238
  87,763
  70,238
  26,146
  35,471
  23,712
  107,238
  85,933
  68,806
  25,702
  34,795
  23,082
  107,238
  0
  0
  0
  0
  0
  107,238
  10,742
  8,611
  3,257
  4,315
  2,930
  107,238
  0
  0
  0
  0
  0
  107,238
  10,563
  8,444
  3,090
  4,319
  2,849
  107,238
  0
  0
  0
  0
  0
  107,238
  74,900
  59,956
  22,354
  30,354
  20,105
  107,238
  0
  0
  0
  0
  0
  107,238
  0
  0
  0
  0
  0
  107,238
  21,722
  17,375
  6,540
  8,770
  5,909
  107,238
  10,616
  8,530
  3,155
  4,305
  2,847
  107,238
  76
  57
  23
  30
  23
  107,238
  97
  79
  31
  39
  28
  107,238
  107,065
  85,725
  31,995
  43,360
  28,810
  107,238
  24,122
  19,251
  7,149
  9,744
  6,615
  107,238
  16,554
  13,255
  4,986
  6,785
  4,438
  107,238
  39,023
  31,276
  11,641
  15,727
  10,461
  107,238
  17,201
  13,755
  5,164
  6,971
  4,609
  107,238
  10,338
  8,324
  3,109
  4,202
  2,738
  107,238
  35,218
  28,144
  10,523
  14,333
  9,522
  107,238
  21,338
  17,141
  6,309
  8,663
  5,717
  107,238
  8,537
  6,842
  2,516
  3,486
  2,279
  107,238
  21,539
  17,206
  6,420
  8,596
  5,809
  107,238
  82,830
  66,304
  24,794
  33,436
  22,362
  107,238
  2,625
  2,135
  776
  1,054
  702
  107,238
  556
  449
  153
  218
  151
  107,238
  17,287
  13,834
  5,114
  7,077
  4,627
  107,238
  3,842
  3,058
  1,174
  1,606
  991
  107,238
  98
  81
  38
  38
  28
  107,238
  432
  339
  128
  176
  119
  107,238
  1,562
  1,239
  514
  644
  369
  107,238
  19,125
  15,367
  5,713
  7,789
  5,134
  107,238
  433
  336
  133
  190
  119
  107,238
  1,654
  1,320
  495
  700
  444
  107,238
  18,849
  15,083
  5,555
  7,633
  5,158
  107,238
  411
  329
  120
  166
  111
  107,238
  0
  0
  0
  0
  0
  107,238
  38,709
  30,957
  11,524
  15,653
  10,421
  107,238
  21,531
  17,147
  6,430
  8,749
  5,849
  107,238
  21,177
  17,027
  6,286
  8,671
  5,672
  107,238
  21,600
  17,246
  6,556
  8,755
  5,804
  107,238
  21,317
  17,118
  6,364
  8,561
  5,761
  107,238
  21,534
  17,150
  6,374
  8,717
  5,721
  107,238
  21,454
  17,163
  6,534
  8,623
  5,842
  107,238
  21,421
  17,169
  6,385
  8,675
  5,779
  107,238
  90,826
  72,677
  27,095
  36,763
  24,468
(note: file ./output/04b_an_descriptive_table_2_ageband1.txt not found)
  30,221
  30,221
  24,268
  8,867
  12,316
  8,037
  30,221
  0
  0
  0
  0
  0
  30,221
  0
  0
  0
  0
  0
  30,221
  0
  0
  0
  0
  0
  30,221
  0
  0
  0
  0
  0
  30,221
  7,350
  5,871
  2,117
  2,989
  1,972
  30,221
  14,348
  11,569
  4,223
  5,865
  3,788
  30,221
  8,523
  6,828
  2,527
  3,462
  2,277
  30,221
  15,468
  12,409
  4,515
  6,300
  4,090
  30,221
  14,753
  11,859
  4,352
  6,016
  3,947
  30,221
  2,822
  2,284
  821
  1,144
  778
  30,221
  7,013
  5,596
  2,065
  2,929
  1,856
  30,221
  5,389
  4,360
  1,563
  2,171
  1,418
  30,221
  4,340
  3,462
  1,289
  1,757
  1,102
  30,221
  2,664
  2,122
  754
  1,086
  742
  30,221
  1,741
  1,421
  536
  676
  479
  30,221
  6,252
  5,023
  1,839
  2,553
  1,662
  30,221
  1,244
  1,021
  373
  491
  332
  30,221
  590
  470
  165
  232
  160
  30,221
  3,570
  2,831
  1,044
  1,417
  961
  30,221
  24,817
  19,946
  7,285
  10,176
  6,584
  30,221
  24,180
  19,398
  7,098
  9,854
  6,443
  30,221
  0
  0
  0
  0
  0
  30,221
  2,940
  2,358
  883
  1,213
  791
  30,221
  0
  0
  0
  0
  0
  30,221
  3,101
  2,512
  886
  1,249
  803
  30,221
  0
  0
  0
  0
  0
  30,221
  21,125
  16,934
  6,250
  8,625
  5,579
  30,221
  0
  0
  0
  0
  0
  30,221
  0
  0
  0
  0
  0
  30,221
  6,076
  4,901
  1,740
  2,478
  1,644
  30,221
  3,020
  2,433
  877
  1,213
  814
  30,221
  19
  19
  7
  4
  4
  30,221
  23
  21
  7
  9
  8
  30,221
  30,179
  24,228
  8,853
  12,303
  8,025
  30,221
  6,708
  5,365
  2,047
  2,769
  1,767
  30,221
  4,703
  3,771
  1,347
  1,909
  1,202
  30,221
  10,899
  8,792
  3,136
  4,434
  2,923
  30,221
  4,912
  3,967
  1,458
  2,001
  1,310
  30,221
  2,999
  2,373
  879
  1,203
  835
  30,221
  9,978
  8,037
  3,002
  4,049
  2,657
  30,221
  6,122
  4,938
  1,789
  2,495
  1,668
  30,221
  2,451
  1,958
  683
  1,001
  671
  30,221
  5,983
  4,837
  1,723
  2,494
  1,588
  30,221
  23,292
  18,720
  6,828
  9,503
  6,191
  30,221
  732
  569
  220
  305
  186
  30,221
  184
  155
  55
  75
  49
  30,221
  4,861
  3,904
  1,410
  2,000
  1,279
  30,221
  1,127
  900
  347
  424
  324
  30,221
  25
  20
  7
  9
  8
  30,221
  118
  98
  29
  51
  30
  30,221
  437
  353
  131
  181
  103
  30,221
  5,339
  4,295
  1,574
  2,160
  1,442
  30,221
  121
  90
  37
  62
  28
  30,221
  501
  400
  152
  220
  126
  30,221
  5,457
  4,353
  1,600
  2,156
  1,482
  30,221
  1,182
  965
  339
  483
  315
  30,221
  0
  0
  0
  0
  0
  30,221
  10,900
  8,728
  3,189
  4,444
  2,921
  30,221
  6,041
  4,816
  1,831
  2,399
  1,669
  30,221
  6,089
  4,842
  1,783
  2,436
  1,661
  30,221
  6,002
  4,854
  1,768
  2,506
  1,548
  30,221
  6,113
  4,893
  1,794
  2,498
  1,619
  30,221
  6,075
  4,865
  1,764
  2,473
  1,629
  30,221
  6,059
  4,867
  1,816
  2,524
  1,586
  30,221
  6,016
  4,799
  1,792
  2,428
  1,601
  30,221
  25,629
  20,549
  7,514
  10,400
  6,848

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/04b_an_descriptive_table_2.log
  log type:  text
 closed on:  15 Mar 2023, 13:56:30
-------------------------------------------------------------------------------
