-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_death_1stVac
> cCensor.log
  log type:  text
 opened on:  15 Mar 2023, 14:03:48

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. forvalues period=0/5 {
  3. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  4. 
. /*Censor at date of second vacc_7ds
> gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
> replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>seco
> nd_vacc_plus_7d
> stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)*/
.         
. *Censor at date of first vacc_7ds
. gen second_vacc_plus_7d=covid_vacc_date+7
  5. replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>s
> econd_vacc_plus_7d
  6. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. *Omicron period +7 days: 27th December 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  8. stsplit cat_time, at(0,85,154, 216, 263, 372, 500)
  9. recode cat_time 85=1 154=2 216=3 263=4 372=5
 10. recode `outcome' .=0 
 11. tab cat_time
 12. tab cat_time `outcome'
 13. }
 14. if "`outcome'"=="covid_test_ever" {
 15. stsplit cat_time, at(0,85,154, 216, 263, 372, 500)
 16. recode cat_time 85=1 154=2 216=3 263=4 372=5
 17. recode `outcome' .=0 
 18. tab cat_time
 19. tab cat_time `outcome'
 20. }
 21. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. *Omicron period +14 days: 3rd January 2022
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 22. stsplit cat_time, at(0,92,161,222,270, 379, 500)
 23. recode cat_time 92=1 161=2 222=3 270=4 379=5
 24. recode `outcome' .=0 
 25. tab cat_time
 26. tab cat_time `outcome'
 27. }
 28. 
. keep if cat_time==`period'
 29. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 30. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 31. if _rc==0{
 32. estimates
 33. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'_1stVaccCensor", replace
 34.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 35. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 36. 
. }
 37. }
 38. }
(5,307 missing values generated)
(86,066 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
      2,638  observations end on or before enter()
------------------------------------------------------------------------------
    104,600  observations remaining, representing
    104,600  subjects
     42,358  failures in single-failure-per-subject data
   10476681  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(77,735 observations (episodes) created)
(cat_time: 77735 changes made)
(covid_death: 77735 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    104,600       57.37       57.37
          1 |     50,594       27.75       85.11
          2 |     18,528       10.16       95.28
          3 |      3,443        1.89       97.16
          4 |      3,034        1.66       98.83
          5 |      2,136        1.17      100.00
------------+-----------------------------------
      Total |    182,335      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    81,217     23,383 |   104,600 
         1 |    37,955     12,639 |    50,594 
         2 |    13,211      5,317 |    18,528 
         3 |     3,192        251 |     3,443 
         4 |     2,499        535 |     3,034 
         5 |     1,903        233 |     2,136 
-----------+----------------------+----------
     Total |   139,977     42,358 |   182,335 
(80,373 observations deleted)
   1:     30.84 /        1 =      30.8390

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      104,600             Number of obs    =     104,600
No. of failures      =       23,383
Time at risk         =      7076665
                                                Wald chi2(42)    =       28.76
Log pseudolikelihood =   -209201.52             Prob > chi2      =      0.9403

                       (Std. Err. adjusted for 1,371 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.070038   .1644942     0.44   0.660     .7916736     1.44628
 only 12-18  |     1.1674   .2151121     0.84   0.401     .8135274    1.675202
      mixed  |   1.084453   .1514994     0.58   0.562     .8247014    1.426016
             |
        age1 |   .9969821   .0024507    -1.23   0.219     .9921904    1.001797
        age2 |   1.006647   .0078437     0.85   0.395     .9913906    1.022138
        age3 |   .9813306    .022083    -0.84   0.402     .9389893    1.025581
      1.male |   .9988563   .0133633    -0.09   0.932     .9730051    1.025394
             |
   obese4cat |
Obese I ..)  |    1.01806   .0203189     0.90   0.370     .9790045    1.058674
Obese II..)  |   .9951856   .0238471    -0.20   0.840     .9495268     1.04304
Obese II..)  |    1.00703   .0285906     0.25   0.805     .9525245    1.064655
             |
smoke_nomiss |
     Former  |   1.014454   .0445715     0.33   0.744     .9307508    1.105684
    Current  |   1.012336   .0199994     0.62   0.535     .9738873    1.052303
             |
         imd |
          4  |    1.01613   .0164039     0.99   0.322     .9844819    1.048795
5 most de..  |   1.005098   .0226053     0.23   0.821     .9617542    1.050394
             |
tot_adults~h |
          2  |   .9650044   .3271548    -0.11   0.916     .4965418    1.875438
          3  |   .9599906   .2499363    -0.16   0.875     .5763075    1.599115
             |
   ethnicity |
Asian or ..  |   1.007798   .0214334     0.37   0.715     .9666526    1.050694
      Other  |   1.027841   .0228124     1.24   0.216     .9840881    1.073539
             |
1.htdiag_o~p |    1.00005   .0145488     0.00   0.997      .971938    1.028976
1.~y_disease |   1.002365    .016678     0.14   0.887     .9702035    1.035592
    1.asthma |   1.015537   .0227725     0.69   0.492     .9718702    1.061166
1.~c_disease |   .9877616   .0157673    -0.77   0.440     .9573368    1.019153
             |
     diabcat |
T1DM, con..  |   1.018255   .0430889     0.43   0.669     .9372098    1.106309
T1DM, unc..  |   .8707597   .0856582    -1.41   0.159     .7180656    1.055924
T2DM, con..  |   1.014497   .0174207     0.84   0.402     .9809215    1.049222
T2DM, unc..  |   1.074081   .0385921     1.99   0.047     1.001044    1.152447
Diabetes,..  |   1.183481   .2549635     0.78   0.434     .7758582    1.805261
             |
cancer_exh~t |
  Last year  |   1.229474   .1196639     2.12   0.034      1.01595    1.487874
2-5 years..  |   1.099324   .0561719     1.85   0.064     .9945624     1.21512
   5+ years  |   .9947695    .016907    -0.31   0.758     .9621783    1.028465
             |
cancer_hae~t |
  Last year  |   1.017426   .1019579     0.17   0.863     .8359928    1.238235
2-5 years..  |   1.019441   .0550066     0.36   0.721     .9171347    1.133159
   5+ years  |   1.008082    .017487     0.46   0.643     .9743841    1.042945
             |
1.~r_disease |   1.002057    .016277     0.13   0.899      .970657    1.034473
1.stroke_d~a |   .9942635   .0171865    -0.33   0.739     .9611428    1.028526
1.other_ne~o |   1.002143   .0164439     0.13   0.896     .9704257    1.034896
             |
reduced_ki~t |
Stage 3a/..  |   .9267257   .0990229    -0.71   0.476     .7516198    1.142626
      1.esrd |   .9920948   .0128694    -0.61   0.541     .9671893    1.017642
1.other_tr~t |   .9921449   .0163682    -0.48   0.633      .960577     1.02475
  1.asplenia |   1.006015   .0162681     0.37   0.711     .9746297     1.03841
1.ra_sle_p~s |   1.004103   .0160026     0.26   0.797     .9732232    1.035962
1.other_im~o |   .9917353   .0163231    -0.50   0.614     .9602531     1.02425
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod0_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod0_1stVaccCensor.ster saved
(5,307 missing values generated)
(86,066 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
      2,638  observations end on or before enter()
------------------------------------------------------------------------------
    104,600  observations remaining, representing
    104,600  subjects
     42,358  failures in single-failure-per-subject data
   10476681  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(77,735 observations (episodes) created)
(cat_time: 77735 changes made)
(covid_death: 77735 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    104,600       57.37       57.37
          1 |     50,594       27.75       85.11
          2 |     18,528       10.16       95.28
          3 |      3,443        1.89       97.16
          4 |      3,034        1.66       98.83
          5 |      2,136        1.17      100.00
------------+-----------------------------------
      Total |    182,335      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    81,217     23,383 |   104,600 
         1 |    37,955     12,639 |    50,594 
         2 |    13,211      5,317 |    18,528 
         3 |     3,192        251 |     3,443 
         4 |     2,499        535 |     3,034 
         5 |     1,903        233 |     2,136 
-----------+----------------------+----------
     Total |   139,977     42,358 |   182,335 
(134,379 observations deleted)
   1:     11.94 /        1 =      11.9440

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       50,594             Number of obs    =      50,594
No. of failures      =       12,639
Time at risk         =      2356671
                                                Wald chi2(42)    =       45.72
Log pseudolikelihood =   -102705.62             Prob > chi2      =      0.3202

                       (Std. Err. adjusted for 1,285 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.152526   .2030908     0.81   0.420     .8159383    1.627961
 only 12-18  |   .9244924   .2575967    -0.28   0.778     .5354613    1.596168
      mixed  |   .9714675    .153838    -0.18   0.855     .7122544    1.325017
             |
        age1 |    1.00033   .0032136     0.10   0.918     .9940507    1.006648
        age2 |   1.006632   .0100981     0.66   0.510     .9870337     1.02662
        age3 |   .9788431   .0278462    -0.75   0.452     .9257592    1.034971
      1.male |   1.003457   .0180801     0.19   0.848     .9686386    1.039526
             |
   obese4cat |
Obese I ..)  |   .9987264   .0252829    -0.05   0.960     .9503822     1.04953
Obese II..)  |   1.000771   .0335068     0.02   0.982     .9372067    1.068645
Obese II..)  |   .9608004   .0366618    -1.05   0.295     .8915659    1.035411
             |
smoke_nomiss |
     Former  |   1.037605   .0628878     0.61   0.542     .9213867    1.168483
    Current  |   .9954677   .0276624    -0.16   0.870     .9427004    1.051189
             |
         imd |
          4  |    .956501   .0217717    -1.95   0.051     .9147672    1.000139
5 most de..  |   .9954797   .0298567    -0.15   0.880     .9386483    1.055752
             |
tot_adults~h |
          2  |   .7551544   .2814282    -0.75   0.451     .3637584    1.567684
          3  |   .8747035   .2352392    -0.50   0.619     .5163476    1.481766
             |
   ethnicity |
Asian or ..  |    .960898   .0300237    -1.28   0.202     .9038182    1.021583
      Other  |   1.003876   .0288394     0.13   0.893     .9489132    1.062021
             |
1.htdiag_o~p |   .9981503   .0194035    -0.10   0.924     .9608355    1.036914
1.~y_disease |   .9988415     .02211    -0.05   0.958     .9564332     1.04313
    1.asthma |   1.011074   .0329446     0.34   0.735     .9485224    1.077751
1.~c_disease |   .9627475   .0208763    -1.75   0.080     .9226881    1.004546
             |
     diabcat |
T1DM, con..  |   .9697162   .0545444    -0.55   0.585     .8684932    1.082737
T1DM, unc..  |   1.080209   .1320544     0.63   0.528     .8500593     1.37267
T2DM, con..  |     .98678   .0231309    -0.57   0.570       .94247    1.033173
T2DM, unc..  |   .9550716   .0463405    -0.95   0.343     .8684309    1.050356
Diabetes,..  |   1.053402   .3274092     0.17   0.867     .5728371    1.937123
             |
cancer_exh~t |
  Last year  |   .9746125   .1452248    -0.17   0.863     .7277737    1.305172
2-5 years..  |   1.127499   .0802331     1.69   0.092     .9807191    1.296248
   5+ years  |   1.028577   .0233242     1.24   0.214      .983863    1.075322
             |
cancer_hae~t |
  Last year  |   .9994859   .1285225    -0.00   0.997     .7768226    1.285972
2-5 years..  |   1.016207   .0735901     0.22   0.824     .8817411    1.171178
   5+ years  |   1.018451   .0227349     0.82   0.413     .9748522       1.064
             |
1.~r_disease |   1.020336   .0233785     0.88   0.380      .975529    1.067202
1.stroke_d~a |   1.033375   .0229894     1.48   0.140      .989285     1.07943
1.other_ne~o |   1.012849    .022984     0.56   0.574     .9687883    1.058914
             |
reduced_ki~t |
Stage 3a/..  |   1.365125   .1816892     2.34   0.019     1.051678    1.771992
      1.esrd |   .9972196    .018352    -0.15   0.880     .9618913    1.033845
1.other_tr~t |   1.000538   .0232902     0.02   0.982     .9559157    1.047243
  1.asplenia |   .9840141   .0214506    -0.74   0.460     .9428572    1.026968
1.ra_sle_p~s |   .9631612   .0223861    -1.61   0.106     .9202695    1.008052
1.other_im~o |    .987349   .0219984    -0.57   0.568     .9451609     1.03142
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod1_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod1_1stVaccCensor.ster saved
(5,307 missing values generated)
(86,066 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
      2,638  observations end on or before enter()
------------------------------------------------------------------------------
    104,600  observations remaining, representing
    104,600  subjects
     42,358  failures in single-failure-per-subject data
   10476681  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(77,735 observations (episodes) created)
(cat_time: 77735 changes made)
(covid_death: 77735 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    104,600       57.37       57.37
          1 |     50,594       27.75       85.11
          2 |     18,528       10.16       95.28
          3 |      3,443        1.89       97.16
          4 |      3,034        1.66       98.83
          5 |      2,136        1.17      100.00
------------+-----------------------------------
      Total |    182,335      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    81,217     23,383 |   104,600 
         1 |    37,955     12,639 |    50,594 
         2 |    13,211      5,317 |    18,528 
         3 |     3,192        251 |     3,443 
         4 |     2,499        535 |     3,034 
         5 |     1,903        233 |     2,136 
-----------+----------------------+----------
     Total |   139,977     42,358 |   182,335 
(166,445 observations deleted)
   1:      3.65 /        1 =       3.6500

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       18,528             Number of obs    =      18,528
No. of failures      =        5,317
Time at risk         =       511107
                                                Wald chi2(42)    =       53.76
Log pseudolikelihood =   -36834.887             Prob > chi2      =      0.1054

                       (Std. Err. adjusted for 1,143 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5210192    .162219    -2.09   0.036     .2830301     .959124
 only 12-18  |   .2114697   .1087899    -3.02   0.003     .0771526    .5796235
      mixed  |   .4869422   .1291655    -2.71   0.007     .2895271    .8189657
             |
        age1 |   .9926825   .0050997    -1.43   0.153     .9827374    1.002728
        age2 |   1.034537   .0166119     2.11   0.034     1.002485    1.067614
        age3 |   .8982721   .0410673    -2.35   0.019     .8212824     .982479
      1.male |   .9893239   .0289911    -0.37   0.714     .9341033    1.047809
             |
   obese4cat |
Obese I ..)  |   1.063243    .040678     1.60   0.109     .9864318    1.146036
Obese II..)  |   .9637818   .0499378    -0.71   0.476     .8707113    1.066801
Obese II..)  |   1.088482   .0644566     1.43   0.152     .9692056    1.222438
             |
smoke_nomiss |
     Former  |   1.009923   .0962926     0.10   0.918     .8377789     1.21744
    Current  |    1.01947   .0422869     0.46   0.642     .9398684    1.105813
             |
         imd |
          4  |    1.02254   .0360556     0.63   0.527     .9542592    1.095707
5 most de..  |   1.035517   .0470643     0.77   0.443     .9472619    1.131995
             |
tot_adults~h |
          2  |   2.234604   2.675023     0.67   0.502     .2139122    23.34348
          3  |   4.830622    5.25667     1.45   0.148     .5724372    40.76414
             |
   ethnicity |
Asian or ..  |   .9995838   .0438362    -0.01   0.992     .9172554    1.089302
      Other  |   .9984357   .0457349    -0.03   0.973      .912703    1.092221
             |
1.htdiag_o~p |   1.005527   .0301379     0.18   0.854      .948159    1.066365
1.~y_disease |   1.071408   .0357356     2.07   0.039     1.003608    1.143789
    1.asthma |   1.070591   .0522377     1.40   0.162     .9729502    1.178031
1.~c_disease |   .9784596   .0335946    -0.63   0.526     .9147819     1.04657
             |
     diabcat |
T1DM, con..  |   .9686834   .0902665    -0.34   0.733     .8069801    1.162789
T1DM, unc..  |    .972614   .1731646    -0.16   0.876     .6861075     1.37876
T2DM, con..  |   1.026522   .0392009     0.69   0.493     .9524946    1.106303
T2DM, unc..  |   1.071198   .0775071     0.95   0.342     .9295671    1.234409
Diabetes,..  |   1.169423   .6304759     0.29   0.772     .4064994    3.364213
             |
cancer_exh~t |
  Last year  |   1.030258   .2068658     0.15   0.882     .6950768     1.52707
2-5 years..  |   .8486239   .1090634    -1.28   0.202     .6596607    1.091717
   5+ years  |   1.015412   .0365485     0.42   0.671     .9462463    1.089632
             |
cancer_hae~t |
  Last year  |   .7697322   .1733319    -1.16   0.245     .4950649    1.196788
2-5 years..  |   .9203434   .1072473    -0.71   0.476     .7324191    1.156485
   5+ years  |   1.019045   .0358799     0.54   0.592     .9510937    1.091852
             |
1.~r_disease |   .9977976   .0333406    -0.07   0.947     .9345451    1.065331
1.stroke_d~a |   1.090035    .036423     2.58   0.010     1.020935    1.163812
1.other_ne~o |   .9537723   .0313906    -1.44   0.150     .8941902    1.017324
             |
reduced_ki~t |
Stage 3a/..  |   1.068803   .2768466     0.26   0.797     .6433028    1.775743
      1.esrd |   1.004804   .0283658     0.17   0.865     .9507179    1.061967
1.other_tr~t |   .9580098   .0352586    -1.17   0.244     .8913379    1.029669
  1.asplenia |   .9984327    .032482    -0.05   0.962     .9367565     1.06417
1.ra_sle_p~s |   .9801473   .0335923    -0.59   0.558     .9164703    1.048249
1.other_im~o |   1.052436   .0357246     1.51   0.132     .9846958    1.124837
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod2_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod2_1stVaccCensor.ster saved
(5,307 missing values generated)
(86,066 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
      2,638  observations end on or before enter()
------------------------------------------------------------------------------
    104,600  observations remaining, representing
    104,600  subjects
     42,358  failures in single-failure-per-subject data
   10476681  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(77,735 observations (episodes) created)
(cat_time: 77735 changes made)
(covid_death: 77735 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    104,600       57.37       57.37
          1 |     50,594       27.75       85.11
          2 |     18,528       10.16       95.28
          3 |      3,443        1.89       97.16
          4 |      3,034        1.66       98.83
          5 |      2,136        1.17      100.00
------------+-----------------------------------
      Total |    182,335      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    81,217     23,383 |   104,600 
         1 |    37,955     12,639 |    50,594 
         2 |    13,211      5,317 |    18,528 
         3 |     3,192        251 |     3,443 
         4 |     2,499        535 |     3,034 
         5 |     1,903        233 |     2,136 
-----------+----------------------+----------
     Total |   139,977     42,358 |   182,335 
(181,530 observations deleted)
   1:      3.76 /        1 =       3.7560

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,443             Number of obs    =       3,443
No. of failures      =          251
Time at risk         =       155579
                                                Wald chi2(39)    =    24682.83
Log pseudolikelihood =   -1432.0903             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 876 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.04e+09   1.08e+09    19.98   0.000     1.36e+08    7.98e+09
 only 12-18  |   4.99e+08          .        .       .            .           .
      mixed  |   5.49e+08   4.53e+08    24.37   0.000     1.09e+08    2.77e+09
             |
        age1 |   .9926077   .0229609    -0.32   0.748     .9486101    1.038646
        age2 |   .9959662   .0718436    -0.06   0.955     .8646563    1.147217
        age3 |   1.023458   .2082902     0.11   0.909     .6868102    1.525117
      1.male |   .9945203   .1285915    -0.04   0.966     .7718862    1.281369
             |
   obese4cat |
Obese I ..)  |   1.432386   .2218193     2.32   0.020     1.057409    1.940337
Obese II..)  |   .8931296   .2192756    -0.46   0.645     .5519921    1.445094
Obese II..)  |   1.236655   .3338949     0.79   0.431     .7284934    2.099287
             |
smoke_nomiss |
     Former  |   1.296607   .5815851     0.58   0.563     .5382787    3.123271
    Current  |   1.086708   .2134016     0.42   0.672      .739535    1.596861
             |
         imd |
          4  |   1.211682    .192834     1.21   0.228     .8870001    1.655212
5 most de..  |   1.473526   .2758035     2.07   0.038     1.021024    2.126568
             |
tot_adults~h |
          2  |   8.91e-12   8.12e-12   -27.91   0.000     1.49e-12    5.32e-11
          3  |    5609010          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .8616911   .1878744    -0.68   0.495     .5620361     1.32111
      Other  |   .7014606   .1728434    -1.44   0.150     .4327758    1.136956
             |
1.htdiag_o~p |   .8630356   .1232208    -1.03   0.302     .6523753    1.141721
1.~y_disease |   .7807282   .1279129    -1.51   0.131     .5662924    1.076364
    1.asthma |   1.051481   .2606852     0.20   0.840     .6467998    1.709358
1.~c_disease |    .970551   .1521631    -0.19   0.849     .7137841    1.319684
             |
     diabcat |
T1DM, con..  |   .6802475   .3423097    -0.77   0.444     .2537061    1.823908
T1DM, unc..  |   2.635218    1.58356     1.61   0.107      .811542     8.55701
T2DM, con..  |   1.178777   .2032984     0.95   0.340     .8406757    1.652854
T2DM, unc..  |    1.10961   .3816563     0.30   0.762     .5654507    2.177437
Diabetes,..  |   5.99e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   5.85e-19   1.87e-19  -131.00   0.000     3.12e-19    1.10e-18
2-5 years..  |    .405265   .2975757    -1.23   0.219     .0961001    1.709049
   5+ years  |    1.10367   .1878832     0.58   0.562     .7905601     1.54079
             |
cancer_hae~t |
  Last year  |   1.196878   1.220023     0.18   0.860     .1623258    8.824947
2-5 years..  |   .3953697   .2784243    -1.32   0.188     .0994435    1.571919
   5+ years  |   .9271692   .1572729    -0.45   0.656     .6649244    1.292843
             |
1.~r_disease |    1.38758   .2134562     2.13   0.033     1.026396    1.875864
1.stroke_d~a |   .8976365   .1561003    -0.62   0.535     .6383742    1.262193
1.other_ne~o |   .9792491   .1583035    -0.13   0.897     .7133285    1.344302
             |
reduced_ki~t |
Stage 3a/..  |   1.251413    1.02668     0.27   0.785      .250646    6.247996
      1.esrd |   1.131474   .1512321     0.92   0.355     .8707098    1.470333
1.other_tr~t |   .9762338   .1476169    -0.16   0.874     .7258438    1.312999
  1.asplenia |   1.119053   .1676848     0.75   0.453     .8342615    1.501064
1.ra_sle_p~s |   1.115789   .1693569     0.72   0.470     .8286759    1.502378
1.other_im~o |   1.141353   .1828613     0.83   0.409     .8337675    1.562409
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod3_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod3_1stVaccCensor.ster saved
(5,307 missing values generated)
(86,066 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
      2,638  observations end on or before enter()
------------------------------------------------------------------------------
    104,600  observations remaining, representing
    104,600  subjects
     42,358  failures in single-failure-per-subject data
   10476681  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(77,735 observations (episodes) created)
(cat_time: 77735 changes made)
(covid_death: 77735 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    104,600       57.37       57.37
          1 |     50,594       27.75       85.11
          2 |     18,528       10.16       95.28
          3 |      3,443        1.89       97.16
          4 |      3,034        1.66       98.83
          5 |      2,136        1.17      100.00
------------+-----------------------------------
      Total |    182,335      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    81,217     23,383 |   104,600 
         1 |    37,955     12,639 |    50,594 
         2 |    13,211      5,317 |    18,528 
         3 |     3,192        251 |     3,443 
         4 |     2,499        535 |     3,034 
         5 |     1,903        233 |     2,136 
-----------+----------------------+----------
     Total |   139,977     42,358 |   182,335 
(181,939 observations deleted)
   1:      2.40 /        1 =       2.3980

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,034             Number of obs    =       3,034
No. of failures      =          535
Time at risk         =       281713
                                                Wald chi2(41)    =    13797.19
Log pseudolikelihood =   -2951.7662             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 842 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   5.52e+08          .        .       .            .           .
 only 12-18  |   5.62e-06   4.34e-06   -15.64   0.000     1.23e-06    .0000256
      mixed  |   1.11e+09   7.42e+08    31.28   0.000     3.02e+08    4.11e+09
             |
        age1 |   1.010557   .0176072     0.60   0.547     .9766302    1.045663
        age2 |   .9930207   .0542835    -0.13   0.898     .8921284    1.105323
        age3 |   .9736032   .1517707    -0.17   0.864     .7172854    1.321515
      1.male |   .9982968   .0859602    -0.02   0.984     .8432676    1.181827
             |
   obese4cat |
Obese I ..)  |   .9019202   .1182635    -0.79   0.431     .6975173    1.166222
Obese II..)  |   1.072305    .161612     0.46   0.643     .7980493     1.44081
Obese II..)  |   1.449195   .2624471     2.05   0.040     1.016192    2.066704
             |
smoke_nomiss |
     Former  |   1.036162   .3411193     0.11   0.914     .5435007    1.975401
    Current  |   1.117171   .1537774     0.80   0.421     .8530073    1.463143
             |
         imd |
          4  |   1.109822   .1185109     0.98   0.329      .900241    1.368194
5 most de..  |   .7367778   .1252426    -1.80   0.072     .5280116    1.028086
             |
tot_adults~h |
          2  |   4.23e-09   7.71e-09   -10.57   0.000     1.19e-10    1.51e-07
          3  |   84399.86   144841.9     6.61   0.000     2921.202     2438495
             |
   ethnicity |
Asian or ..  |   .9611389   .1404612    -0.27   0.786     .7217573    1.279915
      Other  |    1.06493   .1479674     0.45   0.651     .8110554    1.398273
             |
1.htdiag_o~p |   1.026083   .0970116     0.27   0.785     .8525208    1.234979
1.~y_disease |   1.126375   .1230739     1.09   0.276     .9092348    1.395372
    1.asthma |   .9661501   .1568493    -0.21   0.832     .7028402    1.328106
1.~c_disease |   1.097545    .116339     0.88   0.380     .8916522    1.350981
             |
     diabcat |
T1DM, con..  |   .6857196   .2549809    -1.01   0.310     .3308507    1.421219
T1DM, unc..  |   .8112127    .581313    -0.29   0.770     .1991434    3.304484
T2DM, con..  |   1.240146   .1371912     1.95   0.052     .9984094    1.540413
T2DM, unc..  |   1.030386   .2429642     0.13   0.899      .649064    1.635734
Diabetes,..  |   5.06e-15   3.64e-15   -45.69   0.000     1.23e-15    2.08e-14
             |
cancer_exh~t |
  Last year  |   1.227367   .7254442     0.35   0.729     .3853588    3.909159
2-5 years..  |   .8873496   .3048661    -0.35   0.728     .4525307    1.739969
   5+ years  |   .9616715   .1151879    -0.33   0.744     .7604503    1.216137
             |
cancer_hae~t |
  Last year  |   .4157915   .4291827    -0.85   0.395      .054987    3.144064
2-5 years..  |    .760599    .260412    -0.80   0.424     .3887976    1.487949
   5+ years  |   1.171303   .1290989     1.43   0.151     .9437381    1.453742
             |
1.~r_disease |   1.047477   .1140599     0.43   0.670     .8461686    1.296677
1.stroke_d~a |    .967573   .1057227    -0.30   0.763     .7810457    1.198646
1.other_ne~o |   1.018384   .1183451     0.16   0.875     .8109506    1.278876
             |
reduced_ki~t |
Stage 3a/..  |   2.014162   1.672801     0.84   0.399     .3955075    10.25732
      1.esrd |   .8305308    .076245    -2.02   0.043     .6937661    .9942565
1.other_tr~t |   1.121032   .1135764     1.13   0.259     .9191352    1.367278
  1.asplenia |   .8936229    .101252    -0.99   0.321     .7156635    1.115834
1.ra_sle_p~s |   .9829131   .1099009    -0.15   0.877     .7894799     1.22374
1.other_im~o |    .973629   .1093965    -0.24   0.812     .7811832    1.213484
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod4_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod4_1stVaccCensor.ster saved
(5,307 missing values generated)
(86,066 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
      2,638  observations end on or before enter()
------------------------------------------------------------------------------
    104,600  observations remaining, representing
    104,600  subjects
     42,358  failures in single-failure-per-subject data
   10476681  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(77,735 observations (episodes) created)
(cat_time: 77735 changes made)
(covid_death: 77735 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    104,600       57.37       57.37
          1 |     50,594       27.75       85.11
          2 |     18,528       10.16       95.28
          3 |      3,443        1.89       97.16
          4 |      3,034        1.66       98.83
          5 |      2,136        1.17      100.00
------------+-----------------------------------
      Total |    182,335      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    81,217     23,383 |   104,600 
         1 |    37,955     12,639 |    50,594 
         2 |    13,211      5,317 |    18,528 
         3 |     3,192        251 |     3,443 
         4 |     2,499        535 |     3,034 
         5 |     1,903        233 |     2,136 
-----------+----------------------+----------
     Total |   139,977     42,358 |   182,335 
(182,837 observations deleted)
   1:      1.76 /        1 =       1.7560

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,136             Number of obs    =       2,136
No. of failures      =          233
Time at risk         =        94946
                                                Wald chi2(40)    =     7579.09
Log pseudolikelihood =   -1208.6632             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 741 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   3.18e+09   3.14e+09    22.11   0.000     4.57e+08    2.21e+10
 only 12-18  |   3.31e+09          .        .       .            .           .
      mixed  |   4.38e+09   2.77e+09    35.06   0.000     1.27e+09    1.52e+10
             |
        age1 |    1.01497   .0261807     0.58   0.565     .9649329    1.067603
        age2 |   .9654726   .0784577    -0.43   0.665     .8233194     1.13217
        age3 |   1.081426   .2527352     0.33   0.738     .6840163    1.709729
      1.male |   1.102669   .1459762     0.74   0.460     .8506662    1.429325
             |
   obese4cat |
Obese I ..)  |    .759581   .1607666    -1.30   0.194     .5016674    1.150091
Obese II..)  |   1.125302   .2526735     0.53   0.599     .7246723    1.747417
Obese II..)  |   .9875413   .3319513    -0.04   0.970     .5110143    1.908435
             |
smoke_nomiss |
     Former  |   1.294332   .5918811     0.56   0.573     .5282046    3.171677
    Current  |      .5721   .1446357    -2.21   0.027      .348558    .9390072
             |
         imd |
          4  |   1.056396   .1735612     0.33   0.738     .7655577    1.457724
5 most de..  |   .9311146   .2124307    -0.31   0.754     .5953938    1.456136
             |
tot_adults~h |
          2  |   2.895518          .        .       .            .           .
          3  |   .3145792   .3534333    -1.03   0.303     .0347853    2.844885
             |
   ethnicity |
Asian or ..  |   .7134871   .1673021    -1.44   0.150     .4506009    1.129744
      Other  |   1.170991   .2361606     0.78   0.434     .7886544    1.738683
             |
1.htdiag_o~p |   .9821237   .1398404    -0.13   0.899     .7429631     1.29827
1.~y_disease |   .7339561   .1354377    -1.68   0.094     .5112072    1.053764
    1.asthma |   .9061117     .24391    -0.37   0.714     .5346292    1.535716
1.~c_disease |   .9580597   .1617387    -0.25   0.800     .6881665    1.333803
             |
     diabcat |
T1DM, con..  |    1.24831   .4549433     0.61   0.543     .6110889    2.550003
T1DM, unc..  |   1.733746   1.278283     0.75   0.455     .4086943    7.354824
T2DM, con..  |   .8508672    .172667    -0.80   0.426     .5716456    1.266475
T2DM, unc..  |   .6252994   .2774546    -1.06   0.290     .2620579    1.492034
Diabetes,..  |   3.76e-15   2.91e-15   -42.96   0.000     8.26e-16    1.71e-14
             |
cancer_exh~t |
  Last year  |    3.39381    2.68545     1.54   0.123     .7196973    16.00388
2-5 years..  |    .788201   .4113692    -0.46   0.648     .2833918    2.192233
   5+ years  |   1.028723   .1839618     0.16   0.874     .7245732    1.460545
             |
cancer_hae~t |
  Last year  |   .9681836   .9245011    -0.03   0.973     .1489912    6.291509
2-5 years..  |   .3640754    .252454    -1.46   0.145     .0935317    1.417177
   5+ years  |   .7387256   .1419381    -1.58   0.115     .5069137    1.076545
             |
1.~r_disease |   1.138972   .1935848     0.77   0.444     .8162801    1.589232
1.stroke_d~a |   1.088184   .1727537     0.53   0.594     .7972059    1.485368
1.other_ne~o |   1.040811   .1744422     0.24   0.811      .749391    1.445556
             |
reduced_ki~t |
Stage 3a/..  |   4.38e-15   2.44e-15   -59.37   0.000     1.47e-15    1.30e-14
      1.esrd |    .975137   .1333332    -0.18   0.854     .7458965    1.274831
1.other_tr~t |   1.284052   .2071383     1.55   0.121     .9359877    1.761551
  1.asplenia |   .8958501   .1453187    -0.68   0.498     .6518673    1.231151
1.ra_sle_p~s |   .9278817   .1528273    -0.45   0.650      .671885    1.281416
1.other_im~o |   1.083491   .1720471     0.50   0.614     .7937127    1.479065
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod5_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod5_1stVaccCensor.ster saved
(1,543 missing values generated)
(24,227 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
        694  observations end on or before enter()
------------------------------------------------------------------------------
     29,527  observations remaining, representing
     29,527  subjects
     12,033  failures in single-failure-per-subject data
  2,956,960  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(21,926 observations (episodes) created)
(cat_time: 21926 changes made)
(covid_death: 21926 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     29,527       57.39       57.39
          1 |     14,266       27.73       85.11
          2 |      5,227       10.16       95.27
          3 |        985        1.91       97.19
          4 |        873        1.70       98.88
          5 |        575        1.12      100.00
------------+-----------------------------------
      Total |     51,453      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,818      6,709 |    29,527 
         1 |    10,769      3,497 |    14,266 
         2 |     3,704      1,523 |     5,227 
         3 |       914         71 |       985 
         4 |       705        168 |       873 
         5 |       510         65 |       575 
-----------+----------------------+----------
     Total |    39,420     12,033 |    51,453 
(22,620 observations deleted)
   1:     14.18 /        1 =      14.1790

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       29,527             Number of obs    =      29,527
No. of failures      =        6,709
Time at risk         =      1996859
                                                Wald chi2(41)    =     3539.07
Log pseudolikelihood =   -51494.642             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,202 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.201645   .3857031     0.57   0.567     .6405573    2.254209
 only 12-18  |   1.802067   .6868942     1.55   0.122     .8537254    3.803852
      mixed  |   1.285115   .3822671     0.84   0.399     .7173742    2.302175
             |
        age1 |   1.014796    .011055     1.35   0.178     .9933579    1.036696
        age2 |   .9032247   .0507963    -1.81   0.070     .8089567    1.008478
        age3 |   1.240581   .1373925     1.95   0.052     .9985174    1.541325
      1.male |   1.001106   .0243497     0.05   0.964     .9545011    1.049986
             |
   obese4cat |
Obese I ..)  |   .9824138   .0350822    -0.50   0.619      .916005    1.053637
Obese II..)  |   .9918049   .0440152    -0.19   0.853     .9091821    1.081936
Obese II..)  |   .9491364   .0524907    -0.94   0.345     .8516361    1.057799
             |
smoke_nomiss |
     Former  |   .7843409   .0776829    -2.45   0.014     .6459516     .952379
    Current  |   .9476497   .0359554    -1.42   0.156      .879735    1.020807
             |
         imd |
          4  |   .9686636   .0309652    -1.00   0.319     .9098351    1.031296
5 most de..  |   .9713044   .0416121    -0.68   0.497     .8930764    1.056385
             |
tot_adults~h |
          2  |   2.79e+09          .        .       .            .           .
          3  |   1.12e+09   4.60e+08    50.98   0.000     5.05e+08    2.50e+09
             |
   ethnicity |
Asian or ..  |    1.01363   .0432682     0.32   0.751     .9322763    1.102083
      Other  |   .9817758   .0405164    -0.45   0.656     .9054918    1.064486
             |
1.htdiag_o~p |   .9587266   .0252426    -1.60   0.109     .9105069      1.0095
1.~y_disease |   .9697625    .028419    -1.05   0.295     .9156316    1.027093
    1.asthma |   .9777071   .0434948    -0.51   0.612     .8960696    1.066782
1.~c_disease |   1.034539   .0305265     1.15   0.250     .9764049    1.096133
             |
     diabcat |
T1DM, con..  |   1.158746   .0820579     2.08   0.037     1.008577    1.331272
T1DM, unc..  |   .8399215   .1429782    -1.02   0.305     .6016451    1.172565
T2DM, con..  |   .9932732    .032592    -0.21   0.837     .9314049    1.059251
T2DM, unc..  |   .8094553   .0577348    -2.96   0.003     .7038506    .9309048
Diabetes,..  |   .7441709   .3874411    -0.57   0.570     .2682303    2.064608
             |
cancer_exh~t |
  Last year  |   1.271364   .2142659     1.42   0.154     .9137244    1.768988
2-5 years..  |   1.265958   .1078235     2.77   0.006     1.071325    1.495951
   5+ years  |    .942951   .0289954    -1.91   0.056     .8877997    1.001528
             |
cancer_hae~t |
  Last year  |   1.024087   .2052217     0.12   0.905     .6914499    1.516747
2-5 years..  |    .947872   .0969787    -0.52   0.601     .7756424    1.158345
   5+ years  |   1.030718   .0329996     0.94   0.345      .968027    1.097468
             |
1.~r_disease |   .9770746   .0302383    -0.75   0.454     .9195702    1.038175
1.stroke_d~a |   .9929344    .028794    -0.24   0.807      .938073    1.051004
1.other_ne~o |   1.038394   .0316959     1.23   0.217     .9780929    1.102413
             |
reduced_ki~t |
Stage 3a/..  |   .9734052   .0623264    -0.42   0.674      .858602    1.103559
      1.esrd |   1.008572   .0264216     0.33   0.745     .9580931     1.06171
1.other_tr~t |   .9705678   .0310743    -0.93   0.351     .9115349    1.033424
  1.asplenia |   1.004011   .0309578     0.13   0.897     .9451315    1.066558
1.ra_sle_p~s |   1.014764   .0308745     0.48   0.630     .9560197    1.077117
1.other_im~o |   1.010625   .0299221     0.36   0.721     .9536478    1.071006
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod0_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod0_1stVaccCensor.ster saved
(1,543 missing values generated)
(24,227 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
        694  observations end on or before enter()
------------------------------------------------------------------------------
     29,527  observations remaining, representing
     29,527  subjects
     12,033  failures in single-failure-per-subject data
  2,956,960  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(21,926 observations (episodes) created)
(cat_time: 21926 changes made)
(covid_death: 21926 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     29,527       57.39       57.39
          1 |     14,266       27.73       85.11
          2 |      5,227       10.16       95.27
          3 |        985        1.91       97.19
          4 |        873        1.70       98.88
          5 |        575        1.12      100.00
------------+-----------------------------------
      Total |     51,453      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,818      6,709 |    29,527 
         1 |    10,769      3,497 |    14,266 
         2 |     3,704      1,523 |     5,227 
         3 |       914         71 |       985 
         4 |       705        168 |       873 
         5 |       510         65 |       575 
-----------+----------------------+----------
     Total |    39,420     12,033 |    51,453 
(37,881 observations deleted)
   1:     12.10 /        1 =      12.1030

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       14,266             Number of obs    =      14,266
No. of failures      =        3,497
Time at risk         =       667307
                                                Wald chi2(42)    =     5294.25
Log pseudolikelihood =   -23997.351             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,099 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .6358877   .2381326    -1.21   0.227     .3052217    1.324785
 only 12-18  |    .682867   .4001279    -0.65   0.515     .2165569    2.153278
      mixed  |   .7294902   .2291856    -1.00   0.315     .3940901    1.350341
             |
        age1 |   .9863851   .0151631    -0.89   0.373     .9571092    1.016557
        age2 |   1.057537    .087637     0.68   0.500     .8989955    1.244039
        age3 |    .899095   .1480082    -0.65   0.518     .6511508    1.241451
      1.male |   .9591073   .0334007    -1.20   0.231     .8958274    1.026857
             |
   obese4cat |
Obese I ..)  |   .9581795   .0449138    -0.91   0.362     .8740728    1.050379
Obese II..)  |    .988263    .059605    -0.20   0.845     .8780801    1.112272
Obese II..)  |   1.040232   .0754006     0.54   0.586     .9024674    1.199028
             |
smoke_nomiss |
     Former  |   1.159699   .1215588     1.41   0.158     .9443286    1.424189
    Current  |   .9471238   .0506892    -1.02   0.310     .8528078    1.051871
             |
         imd |
          4  |   .9442049   .0404252    -1.34   0.180     .8682061    1.026856
5 most de..  |   .9785933   .0549513    -0.39   0.700     .8766061    1.092446
             |
tot_adults~h |
          2  |   6.35e-15   5.13e-15   -40.47   0.000     1.30e-15    3.09e-14
          3  |   1.347082   .9600048     0.42   0.676     .3332582    5.445116
             |
   ethnicity |
Asian or ..  |   .9617771   .0558688    -0.67   0.502     .8582798    1.077755
      Other  |   1.038363   .0589259     0.66   0.507     .9290618    1.160524
             |
1.htdiag_o~p |   .9895699   .0361606    -0.29   0.774     .9211749    1.063043
1.~y_disease |   1.050552   .0453125     1.14   0.253     .9653914    1.143225
    1.asthma |   1.090414   .0619621     1.52   0.128     .9754894    1.218879
1.~c_disease |    1.03293   .0421842     0.79   0.428     .9534731    1.119009
             |
     diabcat |
T1DM, con..  |   .9031025   .1039359    -0.89   0.376     .7207328    1.131618
T1DM, unc..  |    1.34032    .263752     1.49   0.137     .9113953    1.971108
T2DM, con..  |   1.059249   .0481688     1.27   0.206     .9689244    1.157993
T2DM, unc..  |    .944309   .0877247    -0.62   0.537     .7871164    1.132894
Diabetes,..  |   .7312233   .5388499    -0.42   0.671     .1724989    3.099658
             |
cancer_exh~t |
  Last year  |   1.645741   .3737273     2.19   0.028     1.054543    2.568377
2-5 years..  |   .9292662   .1344175    -0.51   0.612     .6998656    1.233859
   5+ years  |   1.057558   .0453147     1.31   0.192     .9723702    1.150209
             |
cancer_hae~t |
  Last year  |    1.38743   .3514548     1.29   0.196     .8444819     2.27946
2-5 years..  |   1.134508   .1415201     1.01   0.312     .8884385     1.44873
   5+ years  |   1.002132   .0448254     0.05   0.962     .9180171    1.093954
             |
1.~r_disease |   .9659996   .0428944    -0.78   0.436     .8854826    1.053838
1.stroke_d~a |   1.018853   .0422124     0.45   0.652     .9393887     1.10504
1.other_ne~o |   1.077621   .0439951     1.83   0.067     .9947523    1.167394
             |
reduced_ki~t |
Stage 3a/..  |   1.007078   .0853415     0.08   0.934     .8529644    1.189037
      1.esrd |   1.010302   .0347761     0.30   0.766     .9443904    1.080814
1.other_tr~t |   1.058737   .0456276     1.32   0.185     .9729812    1.152051
  1.asplenia |   1.010889   .0434707     0.25   0.801     .9291793    1.099783
1.ra_sle_p~s |   1.038453   .0439008     0.89   0.372     .9558772    1.128162
1.other_im~o |   .9779568   .0433553    -0.50   0.615     .8965691    1.066733
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod1_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod1_1stVaccCensor.ster saved
(1,543 missing values generated)
(24,227 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
        694  observations end on or before enter()
------------------------------------------------------------------------------
     29,527  observations remaining, representing
     29,527  subjects
     12,033  failures in single-failure-per-subject data
  2,956,960  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(21,926 observations (episodes) created)
(cat_time: 21926 changes made)
(covid_death: 21926 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     29,527       57.39       57.39
          1 |     14,266       27.73       85.11
          2 |      5,227       10.16       95.27
          3 |        985        1.91       97.19
          4 |        873        1.70       98.88
          5 |        575        1.12      100.00
------------+-----------------------------------
      Total |     51,453      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,818      6,709 |    29,527 
         1 |    10,769      3,497 |    14,266 
         2 |     3,704      1,523 |     5,227 
         3 |       914         71 |       985 
         4 |       705        168 |       873 
         5 |       510         65 |       575 
-----------+----------------------+----------
     Total |    39,420     12,033 |    51,453 
(46,920 observations deleted)
   1:      4.34 /        1 =       4.3440

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,227             Number of obs    =       5,227
No. of failures      =        1,523
Time at risk         =       144019
                                                Wald chi2(42)    =      862.38
Log pseudolikelihood =   -8640.9814             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 935 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5302842   .2730849    -1.23   0.218     .1932672    1.454987
 only 12-18  |   .4088111   .4430879    -0.83   0.409     .0488598     3.42053
      mixed  |   .5654391   .2383315    -1.35   0.176     .2475176    1.291712
             |
        age1 |   1.024221   .0230502     1.06   0.288     .9800255     1.07041
        age2 |   .8621976   .1007827    -1.27   0.205      .685661    1.084187
        age3 |    1.34434   .3100971     1.28   0.200     .8553886    2.112781
      1.male |   .9606378    .048215    -0.80   0.424     .8706374    1.059942
             |
   obese4cat |
Obese I ..)  |    1.12208   .0795473     1.62   0.104     .9765166    1.289341
Obese II..)  |     1.0984   .0985407     1.05   0.295     .9212904    1.309556
Obese II..)  |    .945555   .1052361    -0.50   0.615     .7602419    1.176039
             |
smoke_nomiss |
     Former  |   .8785456     .16154    -0.70   0.481      .612706    1.259727
    Current  |   1.054921   .0845202     0.67   0.505     .9016158    1.234292
             |
         imd |
          4  |   1.099367   .0701162     1.49   0.137     .9701844    1.245751
5 most de..  |   .9420765   .0797365    -0.70   0.481     .7980706    1.112067
             |
tot_adults~h |
          2  |   1.14e-12   1.73e-12   -18.11   0.000     5.79e-14    2.23e-11
          3  |   4.170786   4.564835     1.30   0.192     .4881981    35.63196
             |
   ethnicity |
Asian or ..  |   1.084692   .0904526     0.97   0.330     .9211381    1.277287
      Other  |   .9602879   .0879127    -0.44   0.658     .8025562     1.14902
             |
1.htdiag_o~p |    .988489   .0519445    -0.22   0.826     .8917472    1.095726
1.~y_disease |    1.02979   .0648425     0.47   0.641     .9102304    1.165054
    1.asthma |   1.064509   .0966805     0.69   0.491     .8909264    1.271912
1.~c_disease |   .9360969   .0619701    -1.00   0.319     .8221875    1.065788
             |
     diabcat |
T1DM, con..  |   1.068706   .1793395     0.40   0.692     .7691627    1.484904
T1DM, unc..  |   1.100504   .3683516     0.29   0.775     .5710639    2.120795
T2DM, con..  |   1.013261    .071918     0.19   0.853     .8816698    1.164493
T2DM, unc..  |   1.000014   .1391862     0.00   1.000      .761259    1.313651
Diabetes,..  |   .7245046   .6907104    -0.34   0.735     .1118262    4.693954
             |
cancer_exh~t |
  Last year  |   .9236392   .3703879    -0.20   0.843     .4208843    2.026945
2-5 years..  |   1.278945   .2446298     1.29   0.198     .8791009    1.860652
   5+ years  |   .9442605   .0667318    -0.81   0.417     .8221226    1.084544
             |
cancer_hae~t |
  Last year  |   1.186669    .487247     0.42   0.677     .5306715    2.653588
2-5 years..  |   1.023171   .2428731     0.10   0.923     .6425341    1.629298
   5+ years  |   .9469614    .065697    -0.79   0.432     .8265683     1.08489
             |
1.~r_disease |   1.032117   .0646584     0.50   0.614     .9128601    1.166954
1.stroke_d~a |   .9140604   .0587068    -1.40   0.162     .8059448    1.036679
1.other_ne~o |    1.08997   .0701373     1.34   0.181     .9608187    1.236481
             |
reduced_ki~t |
Stage 3a/..  |   .9282809   .1239008    -0.56   0.577      .714606    1.205847
      1.esrd |   .9737121   .0535342    -0.48   0.628     .8742426    1.084499
1.other_tr~t |   .9930499   .0611615    -0.11   0.910     .8801282     1.12046
  1.asplenia |   1.003176   .0618766     0.05   0.959     .8889439    1.132087
1.ra_sle_p~s |   .9874532   .0587533    -0.21   0.832     .8787597    1.109591
1.other_im~o |   .9184378   .0609752    -1.28   0.200     .8063774    1.046071
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod2_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod2_1stVaccCensor.ster saved
(1,543 missing values generated)
(24,227 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
        694  observations end on or before enter()
------------------------------------------------------------------------------
     29,527  observations remaining, representing
     29,527  subjects
     12,033  failures in single-failure-per-subject data
  2,956,960  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(21,926 observations (episodes) created)
(cat_time: 21926 changes made)
(covid_death: 21926 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     29,527       57.39       57.39
          1 |     14,266       27.73       85.11
          2 |      5,227       10.16       95.27
          3 |        985        1.91       97.19
          4 |        873        1.70       98.88
          5 |        575        1.12      100.00
------------+-----------------------------------
      Total |     51,453      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,818      6,709 |    29,527 
         1 |    10,769      3,497 |    14,266 
         2 |     3,704      1,523 |     5,227 
         3 |       914         71 |       985 
         4 |       705        168 |       873 
         5 |       510         65 |       575 
-----------+----------------------+----------
     Total |    39,420     12,033 |    51,453 
(51,162 observations deleted)
   1:      0.96 /        1 =       0.9580

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          985             Number of obs    =         985
No. of failures      =           71
Time at risk         =        44818
                                                Wald chi2(37)    =    30614.84
Log pseudolikelihood =   -301.79527             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 542 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .0004773   .0240101    -0.15   0.879     7.31e-47    3.12e+39
 only 12-18  |   .0010326          .        .       .            .           .
      mixed  |   6.28e+15   4.77e+17     0.48   0.632     1.54e-49    2.56e+80
             |
        age1 |    1.01398   .1323103     0.11   0.915      .785162    1.309481
        age2 |    1.27667   .8508697     0.37   0.714     .3457587    4.713939
        age3 |   .5129206   .6872746    -0.50   0.618     .0371112    7.089173
      1.male |    1.92735   .5225284     2.42   0.016     1.132895    3.278928
             |
   obese4cat |
Obese I ..)  |   .9906075   .3438554    -0.03   0.978     .5016909    1.955992
Obese II..)  |   .7006815   .3315891    -0.75   0.452     .2771403    1.771501
Obese II..)  |   .7150129   .4839336    -0.50   0.620     .1897603    2.694154
             |
smoke_nomiss |
     Former  |   .9420292   .9813065    -0.06   0.954     .1222848    7.256984
    Current  |   .8187994   .2944555    -0.56   0.578     .4046408    1.656858
             |
         imd |
          4  |   1.058727   .3059076     0.20   0.843     .6009501    1.865217
5 most de..  |   1.148658   .4640104     0.34   0.732     .5204037    2.535368
             |
tot_adults~h |
          2  |   2.018513          .        .       .            .           .
          3  |   .1092599   6.910438    -0.04   0.972     1.59e-55    7.50e+52
             |
   ethnicity |
Asian or ..  |   1.548101   .6152328     1.10   0.271     .7104311    3.373466
      Other  |    1.02018   .4112014     0.05   0.960     .4630042    2.247856
             |
1.htdiag_o~p |   .8445741   .2202846    -0.65   0.517     .5065527    1.408156
1.~y_disease |   1.287477   .3590324     0.91   0.365     .7453654    2.223873
    1.asthma |   .9361746   .4431732    -0.14   0.889     .3701765    2.367581
1.~c_disease |   .9105197   .2969244    -0.29   0.774     .4805171    1.725321
             |
     diabcat |
T1DM, con..  |   9.08e-20   3.24e-20  -123.09   0.000     4.52e-20    1.83e-19
T1DM, unc..  |   1.28e-19          .        .       .            .           .
T2DM, con..  |   1.085812    .363838     0.25   0.806     .5630289    2.094008
T2DM, unc..  |   1.023228   .5995519     0.04   0.969     .3245024    3.226464
Diabetes,..  |   2.53e-18          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   5.26e-19          .        .       .            .           .
2-5 years..  |   7.643319   3.824938     4.06   0.000     2.866264    20.38205
   5+ years  |   1.135835   .4023045     0.36   0.719     .5673169    2.274074
             |
cancer_hae~t |
  Last year  |   5.129911   5.622889     1.49   0.136     .5985616    43.96537
2-5 years..  |   2.143669    1.30856     1.25   0.212     .6479755    7.091806
   5+ years  |   1.183139   .3687105     0.54   0.589     .6423469    2.179225
             |
1.~r_disease |   .8908394   .2927467    -0.35   0.725     .4678196    1.696369
1.stroke_d~a |   1.072459   .3210729     0.23   0.815     .5964137    1.928473
1.other_ne~o |   1.617626   .5013465     1.55   0.121     .8811859    2.969537
             |
reduced_ki~t |
Stage 3a/..  |   1.678921   .8743565     0.99   0.320     .6049751    4.659326
      1.esrd |   .5703978    .156155    -2.05   0.040     .3335405    .9754548
1.other_tr~t |   1.014225   .3012338     0.05   0.962     .5666564    1.815301
  1.asplenia |   .8134922   .2796899    -0.60   0.548      .414666     1.59591
1.ra_sle_p~s |   1.080628   .3494711     0.24   0.811     .5733251    2.036816
1.other_im~o |   1.551255   .4348252     1.57   0.117     .8955439    2.687074
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod3_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod3_1stVaccCensor.ster saved
(1,543 missing values generated)
(24,227 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
        694  observations end on or before enter()
------------------------------------------------------------------------------
     29,527  observations remaining, representing
     29,527  subjects
     12,033  failures in single-failure-per-subject data
  2,956,960  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(21,926 observations (episodes) created)
(cat_time: 21926 changes made)
(covid_death: 21926 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     29,527       57.39       57.39
          1 |     14,266       27.73       85.11
          2 |      5,227       10.16       95.27
          3 |        985        1.91       97.19
          4 |        873        1.70       98.88
          5 |        575        1.12      100.00
------------+-----------------------------------
      Total |     51,453      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,818      6,709 |    29,527 
         1 |    10,769      3,497 |    14,266 
         2 |     3,704      1,523 |     5,227 
         3 |       914         71 |       985 
         4 |       705        168 |       873 
         5 |       510         65 |       575 
-----------+----------------------+----------
     Total |    39,420     12,033 |    51,453 
(51,274 observations deleted)
   1:      1.03 /        1 =       1.0280

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          873             Number of obs    =         873
No. of failures      =          168
Time at risk         =        78585
                                                Wald chi2(40)    =     9248.30
Log pseudolikelihood =   -700.25329             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 505 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.01e+09          .        .       .            .           .
 only 12-18  |   1.33e-06   2.22e-06    -8.08   0.000     4.97e-08    .0000354
      mixed  |   8.57e+08   9.64e+08    18.29   0.000     9.46e+07    7.77e+09
             |
        age1 |   .9967372   .0723452    -0.05   0.964     .8645672    1.149113
        age2 |   .9607353   .3691304    -0.10   0.917     .4524369    2.040091
        age3 |   1.087208   .8219198     0.11   0.912      .247065    4.784248
      1.male |   1.146884   .1841991     0.85   0.393      .837162    1.571193
             |
   obese4cat |
Obese I ..)  |   1.223599   .2809261     0.88   0.379     .7802102    1.918962
Obese II..)  |   1.170219   .3045241     0.60   0.546     .7026848     1.94883
Obese II..)  |   .6036951   .2454795    -1.24   0.215      .272079    1.339492
             |
smoke_nomiss |
     Former  |     .81127   .5415657    -0.31   0.754     .2192518     3.00184
    Current  |   .9164104   .2161258    -0.37   0.711     .5772222    1.454913
             |
         imd |
          4  |   .9955562    .195985    -0.02   0.982     .6768594     1.46431
5 most de..  |   .5417613   .1778099    -1.87   0.062     .2847328     1.03081
             |
tot_adults~h |
          2  |   5.87e-16   9.35e-16   -22.00   0.000     2.58e-17    1.33e-14
          3  |          1  (omitted)
             |
   ethnicity |
Asian or ..  |   .6949545   .2194987    -1.15   0.249     .3742033     1.29064
      Other  |   .7782186   .2156052    -0.91   0.365     .4521437     1.33945
             |
1.htdiag_o~p |    1.09925   .1800926     0.58   0.564     .7973378    1.515482
1.~y_disease |   1.050568   .2185609     0.24   0.813     .6987783     1.57946
    1.asthma |   .7982206   .2696774    -0.67   0.505      .411667    1.547747
1.~c_disease |   .8920479   .1869907    -0.54   0.586     .5915067    1.345292
             |
     diabcat |
T1DM, con..  |   .2661911   .2591081    -1.36   0.174      .039504    1.793683
T1DM, unc..  |   1.011222   .9987104     0.01   0.991     .1459409    7.006743
T2DM, con..  |   1.612897   .3321776     2.32   0.020     1.077211    2.414974
T2DM, unc..  |   1.309006   .5314965     0.66   0.507     .5906464    2.901052
Diabetes,..  |   5.893253   3.519322     2.97   0.003     1.828252    18.99652
             |
cancer_exh~t |
  Last year  |   4.56e-16   3.64e-16   -44.25   0.000     9.55e-17    2.18e-15
2-5 years..  |   .9045627   .6048302    -0.15   0.881     .2439428    3.354202
   5+ years  |   1.446253   .2842223     1.88   0.060     .9839282    2.125813
             |
cancer_hae~t |
  Last year  |   5.86e-16   4.49e-16   -45.77   0.000     1.31e-16    2.63e-15
2-5 years..  |   .6199463   .4043785    -0.73   0.464     .1726364    2.226259
   5+ years  |   .8857307   .1878545    -0.57   0.567     .5844812    1.342248
             |
1.~r_disease |   .5952842   .1459047    -2.12   0.034     .3682088    .9623978
1.stroke_d~a |   .7730732   .1586837    -1.25   0.210     .5170112    1.155956
1.other_ne~o |   1.239883   .2534325     1.05   0.293     .8306055     1.85083
             |
reduced_ki~t |
Stage 3a/..  |   .5944317   .3056653    -1.01   0.312     .2169711    1.628553
      1.esrd |   .9566251   .1665286    -0.25   0.799     .6800882    1.345607
1.other_tr~t |   1.027056   .2096075     0.13   0.896     .6884559    1.532189
  1.asplenia |    .846336   .1911441    -0.74   0.460     .5436255    1.317607
1.ra_sle_p~s |   .9820202   .2074907    -0.09   0.932     .6490384    1.485835
1.other_im~o |   1.087099   .2043524     0.44   0.657     .7520737    1.571366
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod4_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod4_1stVaccCensor.ster saved
(1,543 missing values generated)
(24,227 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
        694  observations end on or before enter()
------------------------------------------------------------------------------
     29,527  observations remaining, representing
     29,527  subjects
     12,033  failures in single-failure-per-subject data
  2,956,960  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(21,926 observations (episodes) created)
(cat_time: 21926 changes made)
(covid_death: 21926 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     29,527       57.39       57.39
          1 |     14,266       27.73       85.11
          2 |      5,227       10.16       95.27
          3 |        985        1.91       97.19
          4 |        873        1.70       98.88
          5 |        575        1.12      100.00
------------+-----------------------------------
      Total |     51,453      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,818      6,709 |    29,527 
         1 |    10,769      3,497 |    14,266 
         2 |     3,704      1,523 |     5,227 
         3 |       914         71 |       985 
         4 |       705        168 |       873 
         5 |       510         65 |       575 
-----------+----------------------+----------
     Total |    39,420     12,033 |    51,453 
(51,572 observations deleted)
   1:      0.68 /        1 =       0.6780

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          575             Number of obs    =         575
No. of failures      =           65
Time at risk         =        25372
                                                Wald chi2(33)    =      616.72
Log pseudolikelihood =    -234.8563             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 387 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   6.93e+10          .        .       .            .           .
 only 12-18  |   1.48e-10          .        .       .            .           .
      mixed  |   7.14e+08   1.58e+09     9.21   0.000      9336579    5.46e+10
             |
        age1 |   1.198126   .1470919     1.47   0.141     .9418936    1.524063
        age2 |   .4210014    .281249    -1.29   0.195     .1136686    1.559289
        age3 |   5.394101   7.178412     1.27   0.205     .3973279    73.22999
      1.male |   1.243121   .3485413     0.78   0.438     .7175581    2.153624
             |
   obese4cat |
Obese I ..)  |    .398577   .2165808    -1.69   0.090     .1373985    1.156225
Obese II..)  |   .5862203    .318255    -0.98   0.325     .2022783    1.698918
Obese II..)  |   .0665234   .1614137    -1.12   0.264     .0005723    7.732986
             |
smoke_nomiss |
     Former  |   1.135403   .9225193     0.16   0.876     .2309648    5.581545
    Current  |   1.205531   .4294665     0.52   0.600     .5997088     2.42335
             |
         imd |
          4  |   1.117455   .3967043     0.31   0.754     .5572465    2.240848
5 most de..  |   1.559144    .571807     1.21   0.226      .759824    3.199333
             |
tot_adults~h |
          2  |   3.63e-21          .        .       .            .           .
          3  |          1  (omitted)
             |
   ethnicity |
Asian or ..  |   .7281445   .3193676    -0.72   0.469     .3082312    1.720119
      Other  |   .3246879   .2359373    -1.55   0.122     .0781508     1.34896
             |
1.htdiag_o~p |   .7279034   .2119719    -1.09   0.275     .4113357    1.288105
1.~y_disease |   .9771044   .3520331    -0.06   0.949     .4822457    1.979764
    1.asthma |   .4844763    .266937    -1.32   0.188     .1645421    1.426488
1.~c_disease |   .6673192   .2340363    -1.15   0.249      .335589    1.326965
             |
     diabcat |
T1DM, con..  |   1.689576    .861624     1.03   0.304     .6218636    4.590504
T1DM, unc..  |   2.555966   2.961336     0.81   0.418     .2638488    24.76026
T2DM, con..  |   1.025485   .4080043     0.06   0.950     .4701826    2.236621
T2DM, unc..  |    .686382   .5569103    -0.46   0.643     .1399349    3.366711
             |
cancer_exh~t |
  Last year  |   3.72e-19          .        .       .            .           .
2-5 years..  |   5.59e-21          .        .       .            .           .
   5+ years  |   .6135023   .2537294    -1.18   0.237     .2727598    1.379914
             |
cancer_hae~t |
  Last year  |   2.11e-19          .        .       .            .           .
2-5 years..  |   6.33e-20          .        .       .            .           .
   5+ years  |   1.372225    .414935     1.05   0.295     .7586438    2.482062
             |
1.~r_disease |   1.434432   .4542422     1.14   0.255     .7711332    2.668273
1.stroke_d~a |   .6056448    .221035    -1.37   0.169     .2961864    1.238428
1.other_ne~o |   .5787823   .2446257    -1.29   0.196     .2527842    1.325197
             |
reduced_ki~t |
Stage 3a/..  |   1.800682   .8986094     1.18   0.239     .6771034    4.788718
      1.esrd |   1.064073     .28045     0.24   0.814     .6347843    1.783678
1.other_tr~t |   .9733232   .3391348    -0.08   0.938     .4916692     1.92682
  1.asplenia |   1.208824   .3519115     0.65   0.515     .6832226    2.138769
1.ra_sle_p~s |   1.025666   .3355346     0.08   0.938     .5401884    1.947451
1.other_im~o |   1.216994    .395051     0.60   0.545     .6441368    2.299317
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod5_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod5_1stVaccCensor.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_death_1stVac
> cCensor.log
  log type:  text
 closed on:  15 Mar 2023, 14:05:49
-------------------------------------------------------------------------------
