-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covidadmission_1st
> VaccCensor.log
  log type:  text
 opened on:  15 Mar 2023, 14:07:30

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. forvalues period=0/5 {
  3. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  4. 
. /*Censor at date of second vacc_7ds
> gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
> replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>seco
> nd_vacc_plus_7d
> stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)*/
.         
. *Censor at date of first vacc_7ds
. gen second_vacc_plus_7d=covid_vacc_date+7
  5. replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>s
> econd_vacc_plus_7d
  6. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. *Omicron period +7 days: 27th December 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  8. stsplit cat_time, at(0,85,154, 216, 263, 372, 500)
  9. recode cat_time 85=1 154=2 216=3 263=4 372=5
 10. recode `outcome' .=0 
 11. tab cat_time
 12. tab cat_time `outcome'
 13. }
 14. if "`outcome'"=="covid_test_ever" {
 15. stsplit cat_time, at(0,85,154, 216, 263, 372, 500)
 16. recode cat_time 85=1 154=2 216=3 263=4 372=5
 17. recode `outcome' .=0 
 18. tab cat_time
 19. tab cat_time `outcome'
 20. }
 21. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. *Omicron period +14 days: 3rd January 2022
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 22. stsplit cat_time, at(0,92,161,222,270, 379, 500)
 23. recode cat_time 92=1 161=2 222=3 270=4 379=5
 24. recode `outcome' .=0 
 25. tab cat_time
 26. tab cat_time `outcome'
 27. }
 28. 
. keep if cat_time==`period'
 29. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 30. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 31. if _rc==0{
 32. estimates
 33. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'_1stVaccCensor", replace
 34.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 35. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 36. 
. }
 37. }
 38. }
(5,307 missing values generated)
(77,790 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
      2,758  observations end on or before enter()
------------------------------------------------------------------------------
    104,480  observations remaining, representing
    104,480  subjects
     31,136  failures in single-failure-per-subject data
  9,601,466  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(67,120 observations (episodes) created)
(cat_time: 67120 changes made)
(covidadmission: 67120 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    104,480       60.89       60.89
          1 |     45,589       26.57       87.45
          2 |     15,406        8.98       96.43
          3 |      2,637        1.54       97.97
          4 |      2,187        1.27       99.24
          5 |      1,301        0.76      100.00
------------+-----------------------------------
      Total |    171,600      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    85,589     18,891 |   104,480 
         1 |    37,083      8,506 |    45,589 
         2 |    12,217      3,189 |    15,406 
         3 |     2,485        152 |     2,637 
         4 |     1,891        296 |     2,187 
         5 |     1,199        102 |     1,301 
-----------+----------------------+----------
     Total |   140,464     31,136 |   171,600 
(69,878 observations deleted)
   1:     28.67 /        1 =      28.6680

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      104,480             Number of obs    =     104,480
No. of failures      =       18,891
Time at risk         =      6769538
                                                Wald chi2(42)    =       48.30
Log pseudolikelihood =   -168261.43             Prob > chi2      =      0.2335

                       (Std. Err. adjusted for 1,370 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8847353   .1374412    -0.79   0.430     .6525015    1.199624
 only 12-18  |   .7657892   .1659214    -1.23   0.218     .5008202    1.170945
      mixed  |   .8745223   .1188129    -0.99   0.324     .6700795    1.141341
             |
        age1 |   1.000296   .0026591     0.11   0.911     .9950982    1.005522
        age2 |    .999247   .0083393    -0.09   0.928     .9830353    1.015726
        age3 |   .9991289   .0237838    -0.04   0.971     .9535842    1.046849
      1.male |   .9978474   .0143414    -0.15   0.881      .970131    1.026356
             |
   obese4cat |
Obese I ..)  |   .9886226   .0213984    -0.53   0.597     .9475596    1.031465
Obese II..)  |   .9489174    .025235    -1.97   0.049     .9007247    .9996888
Obese II..)  |   1.040346   .0323964     1.27   0.204      .978749     1.10582
             |
smoke_nomiss |
     Former  |   .9745482   .0542796    -0.46   0.643     .8737633    1.086958
    Current  |   1.034998   .0230318     1.55   0.122     .9908271    1.081139
             |
         imd |
          4  |   1.018318   .0188722     0.98   0.327     .9819929    1.055987
5 most de..  |   .9894759   .0245625    -0.43   0.670     .9424867    1.038808
             |
tot_adults~h |
          2  |   1.316316   .5083592     0.71   0.477     .6174869    2.806034
          3  |   1.396167   .4521487     1.03   0.303     .7400751    2.633898
             |
   ethnicity |
Asian or ..  |    1.04609     .02551     1.85   0.065     .9972674    1.097303
      Other  |    .979442   .0250012    -0.81   0.416     .9316462     1.02969
             |
1.htdiag_o~p |    .992268   .0153743    -0.50   0.616     .9625879    1.022863
1.~y_disease |   .9821137   .0183777    -0.96   0.335     .9467466    1.018802
    1.asthma |   .9654083   .0265103    -1.28   0.200     .9148226    1.018791
1.~c_disease |   1.006732   .0187322     0.36   0.718     .9706792    1.044124
             |
     diabcat |
T1DM, con..  |   .9444052    .045991    -1.17   0.240     .8584326    1.038988
T1DM, unc..  |    .863746   .0976517    -1.30   0.195     .6920741    1.078002
T2DM, con..  |   .9569711   .0181441    -2.32   0.020     .9220619    .9932019
T2DM, unc..  |   1.050727   .0412644     1.26   0.208     .9728846    1.134798
Diabetes,..  |   1.527165   .3149608     2.05   0.040     1.019377    2.287898
             |
cancer_exh~t |
  Last year  |   1.015999   .1200524     0.13   0.893     .8059599    1.280775
2-5 years..  |   1.084359   .0623167     1.41   0.159     .9688476    1.213641
   5+ years  |   .9841304   .0185811    -0.85   0.397     .9483777    1.021231
             |
cancer_hae~t |
  Last year  |   1.000676   .1181444     0.01   0.995     .7939568    1.261218
2-5 years..  |   1.011943   .0620763     0.19   0.847     .8973053    1.141227
   5+ years  |   1.015897   .0191195     0.84   0.402     .9791062     1.05407
             |
1.~r_disease |   1.008972    .017729     0.51   0.611     .9748155    1.044326
1.stroke_d~a |   .9912903   .0180631    -0.48   0.631      .956512    1.027333
1.other_ne~o |   1.001006   .0179148     0.06   0.955     .9665026    1.036742
             |
reduced_ki~t |
Stage 3a/..  |   .9389276   .1135885    -0.52   0.602      .740724    1.190167
      1.esrd |   .9913282   .0147176    -0.59   0.557      .962898    1.020598
1.other_tr~t |   1.013348   .0183775     0.73   0.465     .9779616    1.050015
  1.asplenia |   .9826644   .0178196    -0.96   0.335      .948352    1.018218
1.ra_sle_p~s |   1.030588   .0178238     1.74   0.081     .9962391     1.06612
1.other_im~o |   .9905864   .0173349    -0.54   0.589     .9571866    1.025151
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod0_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod0_1stVaccCensor.ster saved
(5,307 missing values generated)
(77,790 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
      2,758  observations end on or before enter()
------------------------------------------------------------------------------
    104,480  observations remaining, representing
    104,480  subjects
     31,136  failures in single-failure-per-subject data
  9,601,466  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(67,120 observations (episodes) created)
(cat_time: 67120 changes made)
(covidadmission: 67120 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    104,480       60.89       60.89
          1 |     45,589       26.57       87.45
          2 |     15,406        8.98       96.43
          3 |      2,637        1.54       97.97
          4 |      2,187        1.27       99.24
          5 |      1,301        0.76      100.00
------------+-----------------------------------
      Total |    171,600      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    85,589     18,891 |   104,480 
         1 |    37,083      8,506 |    45,589 
         2 |    12,217      3,189 |    15,406 
         3 |     2,485        152 |     2,637 
         4 |     1,891        296 |     2,187 
         5 |     1,199        102 |     1,301 
-----------+----------------------+----------
     Total |   140,464     31,136 |   171,600 
(128,769 observations deleted)
   1:      9.58 /        1 =       9.5840

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       45,589             Number of obs    =      45,589
No. of failures      =        8,506
Time at risk         =      2058161
                                                Wald chi2(42)    =       35.57
Log pseudolikelihood =   -68015.645             Prob > chi2      =      0.7475

                       (Std. Err. adjusted for 1,275 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.045038   .2913815     0.16   0.874      .605058    1.804959
 only 12-18  |   1.129796   .3407922     0.40   0.686     .6255228    2.040595
      mixed  |   .9842197   .2554617    -0.06   0.951     .5917745    1.636922
             |
        age1 |   .9943513    .004066    -1.39   0.166     .9864139    1.002353
        age2 |   1.022202   .0131087     1.71   0.087     .9968296     1.04822
        age3 |   .9384999   .0339261    -1.76   0.079     .8743069    1.007406
      1.male |   1.011463   .0217814     0.53   0.597      .969661    1.055068
             |
   obese4cat |
Obese I ..)  |    .996734   .0316238    -0.10   0.918     .9366403    1.060683
Obese II..)  |   .9745165   .0385997    -0.65   0.515     .9017245    1.053185
Obese II..)  |   1.008062   .0477643     0.17   0.865     .9186609    1.106163
             |
smoke_nomiss |
     Former  |   .9037101   .0731362    -1.25   0.211     .7711563    1.059049
    Current  |    .985486   .0328879    -0.44   0.661     .9230897      1.0521
             |
         imd |
          4  |   .9977806   .0263943    -0.08   0.933     .9473669    1.050877
5 most de..  |   1.007265    .037055     0.20   0.844     .9371952    1.082574
             |
tot_adults~h |
          2  |   .4538413   .2516247    -1.42   0.154      .153098     1.34536
          3  |   .8613495   .3181295    -0.40   0.686      .417636    1.776482
             |
   ethnicity |
Asian or ..  |    .962621    .035416    -1.04   0.300     .8956506    1.034599
      Other  |   .9912905   .0359006    -0.24   0.809     .9233659    1.064212
             |
1.htdiag_o~p |   .9902107   .0234964    -0.41   0.678     .9452131    1.037351
1.~y_disease |   .9895541   .0262372    -0.40   0.692     .9394435    1.042338
    1.asthma |   1.008464   .0407328     0.21   0.835     .9317073    1.091544
1.~c_disease |   .9803936   .0261903    -0.74   0.459     .9303823    1.033093
             |
     diabcat |
T1DM, con..  |    1.06886   .0714914     1.00   0.319     .9375351     1.21858
T1DM, unc..  |   .9988118   .1494171    -0.01   0.994     .7449863    1.339119
T2DM, con..  |   .9904016   .0302857    -0.32   0.752     .9327866    1.051575
T2DM, unc..  |   .9823612   .0571434    -0.31   0.760     .8765109    1.100994
Diabetes,..  |   1.789137   .5225118     1.99   0.046     1.009375    3.171278
             |
cancer_exh~t |
  Last year  |   1.063085   .1848997     0.35   0.725     .7559981    1.494911
2-5 years..  |   .9892085   .0937835    -0.11   0.909     .8214635    1.191207
   5+ years  |   .9679033   .0278625    -1.13   0.257     .9148058    1.024083
             |
cancer_hae~t |
  Last year  |   .7719457    .146865    -1.36   0.174     .5316711    1.120806
2-5 years..  |   1.266556   .1057728     2.83   0.005     1.075322    1.491798
   5+ years  |    .993028   .0283521    -0.25   0.806     .9389851    1.050181
             |
1.~r_disease |   .9979738    .026639    -0.08   0.939     .9471047    1.051575
1.stroke_d~a |   .9790966   .0275727    -0.75   0.453     .9265195    1.034657
1.other_ne~o |   1.058641   .0261951     2.30   0.021     1.008524    1.111248
             |
reduced_ki~t |
Stage 3a/..  |   1.146633   .1936518     0.81   0.418     .8235065    1.596546
      1.esrd |   .9963932   .0226113    -0.16   0.873      .953047    1.041711
1.other_tr~t |   1.007021     .02749     0.26   0.798     .9545577    1.062368
  1.asplenia |   .9773748   .0258305    -0.87   0.387     .9280369    1.029336
1.ra_sle_p~s |   1.028934   .0284176     1.03   0.302     .9747172    1.086167
1.other_im~o |   1.006974   .0276646     0.25   0.800     .9541863    1.062682
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod1_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod1_1stVaccCensor.ster saved
(5,307 missing values generated)
(77,790 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
      2,758  observations end on or before enter()
------------------------------------------------------------------------------
    104,480  observations remaining, representing
    104,480  subjects
     31,136  failures in single-failure-per-subject data
  9,601,466  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(67,120 observations (episodes) created)
(cat_time: 67120 changes made)
(covidadmission: 67120 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    104,480       60.89       60.89
          1 |     45,589       26.57       87.45
          2 |     15,406        8.98       96.43
          3 |      2,637        1.54       97.97
          4 |      2,187        1.27       99.24
          5 |      1,301        0.76      100.00
------------+-----------------------------------
      Total |    171,600      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    85,589     18,891 |   104,480 
         1 |    37,083      8,506 |    45,589 
         2 |    12,217      3,189 |    15,406 
         3 |     2,485        152 |     2,637 
         4 |     1,891        296 |     2,187 
         5 |     1,199        102 |     1,301 
-----------+----------------------+----------
     Total |   140,464     31,136 |   171,600 
(158,952 observations deleted)
   1:     12.51 /        1 =      12.5110

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       15,406             Number of obs    =      15,406
No. of failures      =        3,189
Time at risk         =       413697
                                                Wald chi2(41)    =       33.75
Log pseudolikelihood =    -21470.33             Prob > chi2      =      0.7817

                       (Std. Err. adjusted for 1,114 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.577024   .9047503     0.79   0.427     .5122689    4.854884
 only 12-18  |   1.168739   .7381688     0.25   0.805     .3389247    4.030246
      mixed  |   1.873353   .9936858     1.18   0.237     .6623924    5.298145
             |
        age1 |   1.005776   .0067913     0.85   0.394     .9925531    1.019175
        age2 |   .9908159   .0209237    -0.44   0.662     .9506433    1.032686
        age3 |   1.023444   .0612587     0.39   0.699     .9101539    1.150835
      1.male |   1.007539   .0345273     0.22   0.827     .9420888    1.077535
             |
   obese4cat |
Obese I ..)  |    .960384   .0524012    -0.74   0.459     .8629806    1.068781
Obese II..)  |   .9769092   .0642849    -0.36   0.723     .8586999    1.111391
Obese II..)  |   1.156884   .0878435     1.92   0.055     .9969131    1.342526
             |
smoke_nomiss |
     Former  |   1.019884   .1217168     0.16   0.869     .8071704    1.288654
    Current  |   1.082702    .054804     1.57   0.116     .9804447    1.195625
             |
         imd |
          4  |   1.014851   .0442484     0.34   0.735     .9317278    1.105389
5 most de..  |   1.011521   .0594407     0.19   0.845     .9014785    1.134997
             |
tot_adults~h |
          2  |   .3365431   .3180783    -1.15   0.249     .0527887    2.145558
          3  |   .3858616   .3138055    -1.17   0.242     .0783762    1.899674
             |
   ethnicity |
Asian or ..  |   .9682455    .059507    -0.53   0.600     .8583647    1.092192
      Other  |    .979032   .0567855    -0.37   0.715     .8738276    1.096903
             |
1.htdiag_o~p |   1.005762   .0388254     0.15   0.882     .9324727    1.084811
1.~y_disease |   1.052773   .0463772     1.17   0.243     .9656889     1.14771
    1.asthma |   1.065769   .0694613     0.98   0.328     .9379642    1.210989
1.~c_disease |   1.026361   .0429536     0.62   0.534     .9455339    1.114098
             |
     diabcat |
T1DM, con..  |    .916407   .1152661    -0.69   0.488     .7161828    1.172608
T1DM, unc..  |   1.029506   .2447692     0.12   0.903      .646029     1.64061
T2DM, con..  |   1.053485   .0482243     1.14   0.255     .9630836    1.152373
T2DM, unc..  |   1.096536   .1016244     0.99   0.320     .9143988    1.314953
Diabetes,..  |   2.88e-20          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   .9990133   .2684149    -0.00   0.997      .590025      1.6915
2-5 years..  |   .9035733    .143749    -0.64   0.524     .6615249    1.234186
   5+ years  |   1.015493   .0461538     0.34   0.735     .9289455    1.110105
             |
cancer_hae~t |
  Last year  |   1.213994   .2753287     0.86   0.393     .7783366    1.893501
2-5 years..  |   1.046433   .1478256     0.32   0.748     .7933512    1.380249
   5+ years  |   1.008113   .0467134     0.17   0.862     .9205904    1.103956
             |
1.~r_disease |   1.035987   .0453584     0.81   0.419     .9507941    1.128814
1.stroke_d~a |   1.052519   .0464799     1.16   0.246     .9652509    1.147676
1.other_ne~o |   1.066743   .0454859     1.52   0.130     .9812164    1.159725
             |
reduced_ki~t |
Stage 3a/..  |   1.363183   .3622679     1.17   0.244     .8097407    2.294892
      1.esrd |   .9649953     .03507    -0.98   0.327     .8986502    1.036239
1.other_tr~t |   .9667998   .0422226    -0.77   0.439     .8874879    1.053199
  1.asplenia |   .9932844   .0432585    -0.15   0.877     .9120171    1.081793
1.ra_sle_p~s |   1.018103   .0431045     0.42   0.672     .9370296     1.10619
1.other_im~o |   1.022334   .0441562     0.51   0.609     .9393512    1.112647
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod2_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod2_1stVaccCensor.ster saved
(5,307 missing values generated)
(77,790 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
      2,758  observations end on or before enter()
------------------------------------------------------------------------------
    104,480  observations remaining, representing
    104,480  subjects
     31,136  failures in single-failure-per-subject data
  9,601,466  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(67,120 observations (episodes) created)
(cat_time: 67120 changes made)
(covidadmission: 67120 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    104,480       60.89       60.89
          1 |     45,589       26.57       87.45
          2 |     15,406        8.98       96.43
          3 |      2,637        1.54       97.97
          4 |      2,187        1.27       99.24
          5 |      1,301        0.76      100.00
------------+-----------------------------------
      Total |    171,600      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    85,589     18,891 |   104,480 
         1 |    37,083      8,506 |    45,589 
         2 |    12,217      3,189 |    15,406 
         3 |     2,485        152 |     2,637 
         4 |     1,891        296 |     2,187 
         5 |     1,199        102 |     1,301 
-----------+----------------------+----------
     Total |   140,464     31,136 |   171,600 
(171,721 observations deleted)
   1:      2.89 /        1 =       2.8930

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,637             Number of obs    =       2,637
No. of failures      =          152
Time at risk         =       115917
                                                Wald chi2(41)    =    50018.58
Log pseudolikelihood =   -807.45368             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 834 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   8.44e-18   6.88e-18   -48.24   0.000     1.71e-18    4.17e-17
 only 12-18  |   .1962878   .2333759    -1.37   0.171     .0190924    2.018029
      mixed  |   .0930448   .0772291    -2.86   0.004     .0182884    .4733771
             |
        age1 |   .9928539   .0296477    -0.24   0.810     .9364132    1.052696
        age2 |   1.079694    .104141     0.79   0.427     .8937148    1.304376
        age3 |   .7782018    .216124    -0.90   0.367     .4515383    1.341189
      1.male |    .809827   .1311074    -1.30   0.193     .5896394    1.112239
             |
   obese4cat |
Obese I ..)  |   .8437024   .2250975    -0.64   0.524     .5001393    1.423271
Obese II..)  |   1.287899   .3427146     0.95   0.342     .7644934    2.169649
Obese II..)  |   .8836113   .3580821    -0.31   0.760     .3993128    1.955282
             |
smoke_nomiss |
     Former  |   1.01e-16   2.44e-17  -152.88   0.000     6.31e-17    1.62e-16
    Current  |   .7214745   .2106448    -1.12   0.264     .4070994     1.27862
             |
         imd |
          4  |   .9049456   .1904577    -0.47   0.635     .5990678    1.367002
5 most de..  |   .9903487   .2809088    -0.03   0.973     .5679995    1.726746
             |
tot_adults~h |
          2  |   8.60e+08          .        .       .            .           .
          3  |   7.20e+08   7.28e+08    20.16   0.000     9.91e+07    5.23e+09
             |
   ethnicity |
Asian or ..  |   1.003697   .2485852     0.01   0.988     .6177119     1.63087
      Other  |   .9299914   .2802084    -0.24   0.810     .5152406    1.678602
             |
1.htdiag_o~p |   1.476261   .2494357     2.31   0.021     1.060084    2.055825
1.~y_disease |   1.448746   .2862783     1.88   0.061     .9835383    2.133995
    1.asthma |   1.259942   .3450173     0.84   0.399     .7366498    2.154964
1.~c_disease |   1.066591   .2221463     0.31   0.757     .7091076    1.604292
             |
     diabcat |
T1DM, con..  |   .7950058   .4661957    -0.39   0.696     .2518959    2.509109
T1DM, unc..  |   1.471868   1.474814     0.39   0.700     .2065206    10.48997
T2DM, con..  |   .8735044   .1980406    -0.60   0.551     .5601199    1.362226
T2DM, unc..  |   .4183629   .3075087    -1.19   0.236     .0990594    1.766895
Diabetes,..  |   40.88946   40.29876     3.77   0.000      5.92525    282.1734
             |
cancer_exh~t |
  Last year  |   3.079635   2.244542     1.54   0.123     .7380994    12.84942
2-5 years..  |   .8167093   .6200262    -0.27   0.790     .1844402    3.616425
   5+ years  |    1.00174   .2187314     0.01   0.994     .6529707    1.536795
             |
cancer_hae~t |
  Last year  |   2.021687   2.003542     0.71   0.478     .2898356    14.10185
2-5 years..  |   3.012423   1.185187     2.80   0.005     1.393238    6.513384
   5+ years  |   1.267694   .2570297     1.17   0.242     .8519811    1.886248
             |
1.~r_disease |   1.157232    .247129     0.68   0.494     .7614561    1.758717
1.stroke_d~a |   1.114153   .2223283     0.54   0.588     .7535086    1.647409
1.other_ne~o |   1.121011   .2354335     0.54   0.587     .7427481    1.691914
             |
reduced_ki~t |
Stage 3a/..  |   6.85e-17   3.73e-17   -68.29   0.000     2.35e-17    1.99e-16
      1.esrd |   1.067928   .1873724     0.37   0.708     .7571727    1.506221
1.other_tr~t |   1.003267   .1974515     0.02   0.987     .6821702    1.475503
  1.asplenia |   .9702203   .2077808    -0.14   0.888     .6376441    1.476258
1.ra_sle_p~s |   1.250448   .2557552     1.09   0.275     .8374685    1.867078
1.other_im~o |   1.258132   .2519928     1.15   0.252     .8496456    1.863006
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod3_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod3_1stVaccCensor.ster saved
(5,307 missing values generated)
(77,790 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
      2,758  observations end on or before enter()
------------------------------------------------------------------------------
    104,480  observations remaining, representing
    104,480  subjects
     31,136  failures in single-failure-per-subject data
  9,601,466  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(67,120 observations (episodes) created)
(cat_time: 67120 changes made)
(covidadmission: 67120 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    104,480       60.89       60.89
          1 |     45,589       26.57       87.45
          2 |     15,406        8.98       96.43
          3 |      2,637        1.54       97.97
          4 |      2,187        1.27       99.24
          5 |      1,301        0.76      100.00
------------+-----------------------------------
      Total |    171,600      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    85,589     18,891 |   104,480 
         1 |    37,083      8,506 |    45,589 
         2 |    12,217      3,189 |    15,406 
         3 |     2,485        152 |     2,637 
         4 |     1,891        296 |     2,187 
         5 |     1,199        102 |     1,301 
-----------+----------------------+----------
     Total |   140,464     31,136 |   171,600 
(172,171 observations deleted)
   1:      2.57 /        1 =       2.5720

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,187             Number of obs    =       2,187
No. of failures      =          296
Time at risk         =       188914
                                                Wald chi2(40)    =     7461.13
Log pseudolikelihood =   -1505.7325             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 782 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    .037942   .0283081    -4.39   0.000     .0087912    .1637539
 only 12-18  |   .0323755   .0280737    -3.96   0.000     .0059172    .1771405
      mixed  |   .0494918   .0190837    -7.80   0.000     .0232443    .1053782
             |
        age1 |   1.003566   .0230582     0.15   0.877     .9593751    1.049792
        age2 |   .9268201   .0670875    -1.05   0.294     .8042323    1.068094
        age3 |   1.322456   .2746167     1.35   0.178     .8802854    1.986729
      1.male |   1.062218   .1268693     0.51   0.613     .8405192    1.342392
             |
   obese4cat |
Obese I ..)  |   .9853677   .1713455    -0.08   0.932     .7007821    1.385523
Obese II..)  |   .9333785   .1976055    -0.33   0.745     .6163821    1.413402
Obese II..)  |   1.106515   .3222152     0.35   0.728     .6253009    1.958059
             |
smoke_nomiss |
     Former  |   1.284642   .4664663     0.69   0.490     .6305252     2.61735
    Current  |    1.08603   .1798728     0.50   0.618     .7849867    1.502524
             |
         imd |
          4  |   1.287106   .1824521     1.78   0.075     .9748844     1.69932
5 most de..  |   1.068622   .2161567     0.33   0.743     .7188637    1.588554
             |
tot_adults~h |
          2  |   3.97e+09          .        .       .            .           .
          3  |   3.57e+09   2.09e+09    37.61   0.000     1.14e+09    1.12e+10
             |
   ethnicity |
Asian or ..  |   .9017813   .1783028    -0.52   0.601     .6120674    1.328628
      Other  |   1.277655   .2281656     1.37   0.170     .9003363    1.813103
             |
1.htdiag_o~p |   .8814712   .1235262    -0.90   0.368     .6697672    1.160092
1.~y_disease |    .813103   .1358031    -1.24   0.215     .5861103    1.128007
    1.asthma |   1.175821   .2527843     0.75   0.451     .7715168    1.791996
1.~c_disease |    1.12182   .1634155     0.79   0.430     .8431962    1.492511
             |
     diabcat |
T1DM, con..  |   1.575887   .4933538     1.45   0.146     .8531875    2.910756
T1DM, unc..  |    .977966   1.087914    -0.02   0.984     .1105162    8.654091
T2DM, con..  |   1.440132    .211068     2.49   0.013      1.08056    1.919357
T2DM, unc..  |   1.376656   .4267328     1.03   0.302     .7498455    2.527429
             |
cancer_exh~t |
  Last year  |   1.320388   .9209006     0.40   0.690     .3365375    5.180474
2-5 years..  |   .7389317   .3462004    -0.65   0.518     .2949876    1.850993
   5+ years  |   1.193857   .1835376     1.15   0.249     .8832688    1.613659
             |
cancer_hae~t |
  Last year  |   1.499411   1.042795     0.58   0.560     .3836502    5.860111
2-5 years..  |   .9933116   .4586462    -0.01   0.988      .401843    2.455357
   5+ years  |   .8146292   .1404563    -1.19   0.234     .5810293    1.142147
             |
1.~r_disease |   .9348295   .1489865    -0.42   0.672      .684028    1.277588
1.stroke_d~a |   .8883951   .1452682    -0.72   0.469     .6447923    1.224031
1.other_ne~o |   1.098688   .1590303     0.65   0.516     .8273074     1.45909
             |
reduced_ki~t |
Stage 3a/..  |   4.97e-16   2.75e-16   -63.69   0.000     1.68e-16    1.47e-15
      1.esrd |   .9048524    .108954    -0.83   0.406     .7146344    1.145702
1.other_tr~t |   1.035191   .1468195     0.24   0.807     .7839635    1.366926
  1.asplenia |   .9661599     .14385    -0.23   0.817     .7216306     1.29355
1.ra_sle_p~s |   .9854004    .148603    -0.10   0.922     .7332424    1.324274
1.other_im~o |     .89803   .1393894    -0.69   0.488     .6624757     1.21734
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod4_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod4_1stVaccCensor.ster saved
(5,307 missing values generated)
(77,790 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
      2,758  observations end on or before enter()
------------------------------------------------------------------------------
    104,480  observations remaining, representing
    104,480  subjects
     31,136  failures in single-failure-per-subject data
  9,601,466  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(67,120 observations (episodes) created)
(cat_time: 67120 changes made)
(covidadmission: 67120 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    104,480       60.89       60.89
          1 |     45,589       26.57       87.45
          2 |     15,406        8.98       96.43
          3 |      2,637        1.54       97.97
          4 |      2,187        1.27       99.24
          5 |      1,301        0.76      100.00
------------+-----------------------------------
      Total |    171,600      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    85,589     18,891 |   104,480 
         1 |    37,083      8,506 |    45,589 
         2 |    12,217      3,189 |    15,406 
         3 |     2,485        152 |     2,637 
         4 |     1,891        296 |     2,187 
         5 |     1,199        102 |     1,301 
-----------+----------------------+----------
     Total |   140,464     31,136 |   171,600 
(173,057 observations deleted)
   1:      1.33 /        1 =       1.3320

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,301             Number of obs    =       1,301
No. of failures      =          102
Time at risk         =        55239
                                                Wald chi2(34)    =      944.92
Log pseudolikelihood =   -459.20346             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 631 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   5.77e-19          .        .       .            .           .
 only 12-18  |    78.5963          .        .       .            .           .
      mixed  |   1.32e+11   1.46e+11    23.11   0.000     1.50e+10    1.15e+12
             |
        age1 |   1.029159   .0423096     0.70   0.484      .949487    1.115517
        age2 |   .8945091     .11113    -0.90   0.370      .701189    1.141128
        age3 |   1.371604   .4803274     0.90   0.367     .6904676    2.724673
      1.male |   1.152303   .2323325     0.70   0.482     .7761469    1.710763
             |
   obese4cat |
Obese I ..)  |   .5781516   .2005017    -1.58   0.114      .292986    1.140871
Obese II..)  |   .8957373   .2938511    -0.34   0.737      .470912    1.703812
Obese II..)  |   .2377479   .2437177    -1.40   0.161     .0318817    1.772931
             |
smoke_nomiss |
     Former  |   1.146771   .9106088     0.17   0.863     .2418627    5.437316
    Current  |   1.587791   .4228614     1.74   0.083     .9421085    2.675998
             |
         imd |
          4  |   .9141615   .2588913    -0.32   0.751     .5247615    1.592516
5 most de..  |     .99351   .3463225    -0.02   0.985     .5017141    1.967379
             |
tot_adults~h |
          2  |   2.56e+11          .        .       .            .           .
          3  |          1  (omitted)
             |
   ethnicity |
Asian or ..  |   .9759239   .3271726    -0.07   0.942     .5058896    1.882679
      Other  |   2.130023   .5620958     2.87   0.004     1.269869    3.572806
             |
1.htdiag_o~p |   1.181791   .2530847     0.78   0.435     .7766995    1.798161
1.~y_disease |   .7224902   .2207915    -1.06   0.287     .3969232    1.315096
    1.asthma |   .9103857   .3962123    -0.22   0.829     .3879456    2.136387
1.~c_disease |   .8780172   .2319085    -0.49   0.622     .5232115    1.473428
             |
     diabcat |
T1DM, con..  |   1.097001   .6008074     0.17   0.866     .3749897    3.209183
T1DM, unc..  |   1.51e-19          .        .       .            .           .
T2DM, con..  |   1.110885   .3256157     0.36   0.720     .6254178    1.973186
T2DM, unc..  |   .7514967   .6152447    -0.35   0.727     .1510271    3.739378
             |
cancer_exh~t |
  Last year  |   1.06e-19          .        .       .            .           .
2-5 years..  |   1.083335   .5669638     0.15   0.878     .3884059    3.021617
   5+ years  |    1.38341   .3499793     1.28   0.200     .8425802    2.271384
             |
cancer_hae~t |
  Last year  |   6.891031   4.442591     2.99   0.003     1.947697    24.38074
2-5 years..  |   .4796595   .4856437    -0.73   0.468     .0659344    3.489426
   5+ years  |   1.189434   .3111556     0.66   0.507     .7123057    1.986161
             |
1.~r_disease |    1.17191   .2928571     0.63   0.526     .7180938    1.912525
1.stroke_d~a |   .9289392   .2404946    -0.28   0.776     .5592658    1.542966
1.other_ne~o |   .8405687   .2446689    -0.60   0.551     .4751265    1.487089
             |
reduced_ki~t |
Stage 3a/..  |   2.25e-19          .        .       .            .           .
      1.esrd |    .858255   .1808383    -0.73   0.468       .56789    1.297085
1.other_tr~t |   .8281676   .2196947    -0.71   0.477     .4923944    1.392911
  1.asplenia |   .8722405   .2244537    -0.53   0.595     .5267403    1.444362
1.ra_sle_p~s |   .7006819   .2023263    -1.23   0.218     .3978608    1.233987
1.other_im~o |    .937564   .2254088    -0.27   0.789     .5852687    1.501919
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod5_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod5_1stVaccCensor.ster saved
(1,543 missing values generated)
(21,987 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
        716  observations end on or before enter()
------------------------------------------------------------------------------
     29,505  observations remaining, representing
     29,505  subjects
      8,664  failures in single-failure-per-subject data
  2,722,814  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(19,086 observations (episodes) created)
(cat_time: 19086 changes made)
(covidadmission: 19086 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     29,505       60.72       60.72
          1 |     12,931       26.61       87.33
          2 |      4,378        9.01       96.34
          3 |        775        1.59       97.94
          4 |        641        1.32       99.26
          5 |        361        0.74      100.00
------------+-----------------------------------
      Total |     48,591      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    24,273      5,232 |    29,505 
         1 |    10,524      2,407 |    12,931 
         2 |     3,522        856 |     4,378 
         3 |       720         55 |       775 
         4 |       559         82 |       641 
         5 |       329         32 |       361 
-----------+----------------------+----------
     Total |    39,927      8,664 |    48,591 
(19,802 observations deleted)
   1:      7.85 /        1 =       7.8460

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       29,505             Number of obs    =      29,505
No. of failures      =        5,232
Time at risk         =      1916744
                                                Wald chi2(42)    =       35.24
Log pseudolikelihood =   -39972.138             Prob > chi2      =      0.7605

                       (Std. Err. adjusted for 1,202 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.148378   .3527038     0.45   0.652     .6290043    2.096603
 only 12-18  |   .9847506   .3690747    -0.04   0.967      .472394    2.052807
      mixed  |   1.017267   .2784551     0.06   0.950     .5948903    1.739535
             |
        age1 |   1.017074   .0125159     1.38   0.169     .9928364    1.041903
        age2 |   .9029497   .0586834    -1.57   0.116     .7949565    1.025614
        age3 |   1.232444   .1586343     1.62   0.104     .9576455    1.586098
      1.male |   1.014582   .0289211     0.51   0.612     .9594521     1.07288
             |
   obese4cat |
Obese I ..)  |   1.031202   .0418582     0.76   0.449     .9523399    1.116594
Obese II..)  |   1.007577   .0498055     0.15   0.879     .9145393    1.110079
Obese II..)  |   1.020023   .0605256     0.33   0.738     .9080336    1.145825
             |
smoke_nomiss |
     Former  |   .8887859   .0896405    -1.17   0.242     .7293689    1.083046
    Current  |   .9891085   .0413974    -0.26   0.794     .9112098    1.073667
             |
         imd |
          4  |   .9613163   .0343794    -1.10   0.270     .8962412    1.031116
5 most de..  |   .9458698   .0425782    -1.24   0.216     .8659935    1.033114
             |
tot_adults~h |
          2  |    7.07569   7.806341     1.77   0.076     .8140862    61.49888
          3  |   4.221433   4.303197     1.41   0.158     .5724948    31.12778
             |
   ethnicity |
Asian or ..  |   1.047195   .0492586     0.98   0.327     .9549664     1.14833
      Other  |   .9767086   .0462262    -0.50   0.619     .8901822    1.071646
             |
1.htdiag_o~p |   1.057169   .0329402     1.78   0.074     .9945397    1.123743
1.~y_disease |   1.006716   .0344925     0.20   0.845     .9413315    1.076641
    1.asthma |   .9818557   .0532537    -0.34   0.736     .8828367    1.091981
1.~c_disease |   .9336542   .0323687    -1.98   0.048     .8723202    .9993007
             |
     diabcat |
T1DM, con..  |   .9401444   .0865855    -0.67   0.503      .784875     1.12613
T1DM, unc..  |   .9821016   .1667972    -0.11   0.915     .7040295    1.370004
T2DM, con..  |   .9730446    .037558    -0.71   0.479     .9021478    1.049513
T2DM, unc..  |   1.051732   .0758279     0.70   0.484     .9131348    1.211365
Diabetes,..  |   .8616047   .4307068    -0.30   0.766     .3234459    2.295168
             |
cancer_exh~t |
  Last year  |   1.056272   .2203733     0.26   0.793     .7017573    1.589881
2-5 years..  |   1.149766    .109861     1.46   0.144     .9534026    1.386572
   5+ years  |   1.007147   .0362009     0.20   0.843     .9386365    1.080659
             |
cancer_hae~t |
  Last year  |   .8834048   .2094568    -0.52   0.601      .555058    1.405986
2-5 years..  |   1.060877   .1184691     0.53   0.597     .8523351    1.320442
   5+ years  |    1.03631   .0368421     1.00   0.316     .9665591    1.111094
             |
1.~r_disease |   1.072499    .036253     2.07   0.038     1.003747     1.14596
1.stroke_d~a |   1.005021   .0335629     0.15   0.881      .941346    1.073004
1.other_ne~o |   .9711565   .0343328    -0.83   0.408     .9061438    1.040834
             |
reduced_ki~t |
Stage 3a/..  |   .9519882   .0700301    -0.67   0.504     .8241676    1.099633
      1.esrd |   1.011615   .0301408     0.39   0.698     .9542321    1.072449
1.other_tr~t |    .972689   .0345276    -0.78   0.435     .9073166    1.042772
  1.asplenia |   .9518771   .0322721    -1.45   0.146     .8906807    1.017278
1.ra_sle_p~s |   .9970315   .0341357    -0.09   0.931     .9323221    1.066232
1.other_im~o |   1.054279   .0360709     1.54   0.122     .9858996    1.127401
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod0_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod0_1stVaccCensor.ster saved
(1,543 missing values generated)
(21,987 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
        716  observations end on or before enter()
------------------------------------------------------------------------------
     29,505  observations remaining, representing
     29,505  subjects
      8,664  failures in single-failure-per-subject data
  2,722,814  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(19,086 observations (episodes) created)
(cat_time: 19086 changes made)
(covidadmission: 19086 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     29,505       60.72       60.72
          1 |     12,931       26.61       87.33
          2 |      4,378        9.01       96.34
          3 |        775        1.59       97.94
          4 |        641        1.32       99.26
          5 |        361        0.74      100.00
------------+-----------------------------------
      Total |     48,591      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    24,273      5,232 |    29,505 
         1 |    10,524      2,407 |    12,931 
         2 |     3,522        856 |     4,378 
         3 |       720         55 |       775 
         4 |       559         82 |       641 
         5 |       329         32 |       361 
-----------+----------------------+----------
     Total |    39,927      8,664 |    48,591 
(36,376 observations deleted)
   1:      2.70 /        1 =       2.6980

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,931             Number of obs    =      12,931
No. of failures      =        2,407
Time at risk         =       585041
                                                Wald chi2(42)    =       45.23
Log pseudolikelihood =   -16198.752             Prob > chi2      =      0.3388

                       (Std. Err. adjusted for 1,084 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.02713   .4795061     0.06   0.954     .4113865     2.56449
 only 12-18  |   1.010062    .596858     0.02   0.986     .3172214    3.216129
      mixed  |   .7835004   .3105962    -0.62   0.538     .3602507    1.704016
             |
        age1 |   .9846229   .0173472    -0.88   0.379     .9512034    1.019217
        age2 |   1.124927   .1050548     1.26   0.207     .9367687    1.350879
        age3 |    .772114   .1428768    -1.40   0.162     .5372418    1.109668
      1.male |   .9958409   .0403783    -0.10   0.918     .9197638    1.078211
             |
   obese4cat |
Obese I ..)  |   1.020066   .0615779     0.33   0.742     .9062421    1.148187
Obese II..)  |   .9733871   .0753584    -0.35   0.728     .8363473    1.132882
Obese II..)  |   1.250559   .1034688     2.70   0.007     1.063353    1.470723
             |
smoke_nomiss |
     Former  |   .8104619   .1263377    -1.35   0.178     .5970961    1.100072
    Current  |   .9515628   .0577766    -0.82   0.414     .8448012    1.071816
             |
         imd |
          4  |    .910991   .0476576    -1.78   0.075      .822213    1.009355
5 most de..  |   .9684371   .0646076    -0.48   0.631      .849738    1.103717
             |
tot_adults~h |
          2  |   .7253628   .9940551    -0.23   0.815     .0494365    10.64297
          3  |   1.060056   .7939427     0.08   0.938     .2442365    4.600947
             |
   ethnicity |
Asian or ..  |   .9747274   .0683143    -0.37   0.715     .8496229    1.118253
      Other  |   .9947698   .0644342    -0.08   0.935     .8761686    1.129425
             |
1.htdiag_o~p |   .9915627   .0432478    -0.19   0.846     .9103205    1.080055
1.~y_disease |   .9880832   .0508712    -0.23   0.816      .893243    1.092993
    1.asthma |   .9022188   .0702691    -1.32   0.186     .7744907    1.051012
1.~c_disease |      1.041   .0522133     0.80   0.423     .9435328    1.148535
             |
     diabcat |
T1DM, con..  |   1.201818   .1450049     1.52   0.128     .9487188     1.52244
T1DM, unc..  |   .9995191   .2748852    -0.00   0.999     .5830366    1.713509
T2DM, con..  |   1.017728   .0610713     0.29   0.770     .9048017    1.144749
T2DM, unc..  |   .9846404   .1165063    -0.13   0.896     .7808369    1.241638
Diabetes,..  |   .9665406   .6304764    -0.05   0.958     .2691408    3.471048
             |
cancer_exh~t |
  Last year  |   1.297738   .4239665     0.80   0.425     .6840727    2.461907
2-5 years..  |   .9475048   .1590057    -0.32   0.748     .6819253    1.316516
   5+ years  |   1.023479   .0533361     0.45   0.656     .9241038    1.133541
             |
cancer_hae~t |
  Last year  |   .8411829   .2910577    -0.50   0.617     .4269394    1.657352
2-5 years..  |   .9551803   .1628112    -0.27   0.788     .6839076    1.334054
   5+ years  |   1.059237   .0553902     1.10   0.271     .9560518    1.173558
             |
1.~r_disease |   1.026439   .0542713     0.49   0.622     .9253951    1.138515
1.stroke_d~a |   1.041389   .0491521     0.86   0.390     .9493744    1.142322
1.other_ne~o |   1.089567   .0530649     1.76   0.078     .9903711    1.198698
             |
reduced_ki~t |
Stage 3a/..  |   1.021317   .1104854     0.19   0.845     .8261866    1.262534
      1.esrd |   .9630386   .0419786    -0.86   0.388     .8841787    1.048932
1.other_tr~t |   1.018427   .0514897     0.36   0.718     .9223483    1.124515
  1.asplenia |   1.060343    .052218     1.19   0.234     .9627818    1.167791
1.ra_sle_p~s |   1.092446   .0546067     1.77   0.077     .9904949    1.204892
1.other_im~o |   1.012164   .0491317     0.25   0.803     .9203066     1.11319
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod1_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod1_1stVaccCensor.ster saved
(1,543 missing values generated)
(21,987 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
        716  observations end on or before enter()
------------------------------------------------------------------------------
     29,505  observations remaining, representing
     29,505  subjects
      8,664  failures in single-failure-per-subject data
  2,722,814  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(19,086 observations (episodes) created)
(cat_time: 19086 changes made)
(covidadmission: 19086 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     29,505       60.72       60.72
          1 |     12,931       26.61       87.33
          2 |      4,378        9.01       96.34
          3 |        775        1.59       97.94
          4 |        641        1.32       99.26
          5 |        361        0.74      100.00
------------+-----------------------------------
      Total |     48,591      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    24,273      5,232 |    29,505 
         1 |    10,524      2,407 |    12,931 
         2 |     3,522        856 |     4,378 
         3 |       720         55 |       775 
         4 |       559         82 |       641 
         5 |       329         32 |       361 
-----------+----------------------+----------
     Total |    39,927      8,664 |    48,591 
(44,929 observations deleted)
   1:      4.33 /        1 =       4.3310

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,378             Number of obs    =       4,378
No. of failures      =          856
Time at risk         =       118533
                                                Wald chi2(39)    =       28.03
Log pseudolikelihood =   -4674.9488             Prob > chi2      =      0.9041

                         (Std. Err. adjusted for 896 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.588233   1.758789     0.42   0.676     .1812612     13.9163
 only 12-18  |    2.19218   3.101888     0.55   0.579     .1369128    35.10009
      mixed  |   1.867946      1.871     0.62   0.533     .2622836    13.30324
             |
        age1 |   1.002008   .0316932     0.06   0.949     .9417767    1.066091
        age2 |   1.072421   .1740873     0.43   0.667     .7801695    1.474151
        age3 |   .8381391   .2684039    -0.55   0.581     .4474341    1.570012
      1.male |   .9522846   .0667147    -0.70   0.485     .8301063    1.092446
             |
   obese4cat |
Obese I ..)  |   .9589369    .098644    -0.41   0.684     .7838421    1.173144
Obese II..)  |    .838118   .1124248    -1.32   0.188     .6443552    1.090147
Obese II..)  |   1.006091   .1576962     0.04   0.969     .7399778    1.367905
             |
smoke_nomiss |
     Former  |   1.100253   .2381529     0.44   0.659     .7198595    1.681658
    Current  |   1.048239   .1086731     0.45   0.650     .8554893    1.284418
             |
         imd |
          4  |    .972628   .0794955    -0.34   0.734     .8286588     1.14161
5 most de..  |   1.024237   .1142015     0.21   0.830     .8231753    1.274408
             |
tot_adults~h |
          2  |   1.97e-19          .        .       .            .           .
          3  |   .8679859   1.181386    -0.10   0.917      .060252    12.50414
             |
   ethnicity |
Asian or ..  |   1.019435   .1132013     0.17   0.862     .8200485    1.267301
      Other  |   .8988765   .1121134    -0.85   0.393     .7039355    1.147802
             |
1.htdiag_o~p |   .9257481   .0678628    -1.05   0.293     .8018529    1.068786
1.~y_disease |   .8659027   .0822593    -1.52   0.130     .7187971    1.043114
    1.asthma |   .8869488   .1172046    -0.91   0.364     .6845698    1.149157
1.~c_disease |   .9514238   .0798085    -0.59   0.553     .8071839    1.121439
             |
     diabcat |
T1DM, con..  |   1.252687    .272935     1.03   0.301     .8173032    1.920004
T1DM, unc..  |    1.25312    .591746     0.48   0.633     .4966376     3.16188
T2DM, con..  |     1.0987   .1010211     1.02   0.306     .9175177     1.31566
T2DM, unc..  |   1.047224   .1927821     0.25   0.802     .7300335    1.502229
Diabetes,..  |   7.66e-20          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   1.946653   .9651247     1.34   0.179      .736672    5.144024
2-5 years..  |   1.412661   .3951496     1.24   0.217      .816469    2.444196
   5+ years  |   1.088445   .0941318     0.98   0.327     .9187388    1.289498
             |
cancer_hae~t |
  Last year  |   2.69e-20          .        .       .            .           .
2-5 years..  |   .8319171   .2717015    -0.56   0.573     .4386119    1.577901
   5+ years  |    .925766   .0847242    -0.84   0.399     .7737506    1.107647
             |
1.~r_disease |   1.036076   .0874452     0.42   0.675     .8781119    1.222456
1.stroke_d~a |   .9686667   .0838756    -0.37   0.713     .8174664    1.147833
1.other_ne~o |   1.138955   .0975885     1.52   0.129     .9628828    1.347223
             |
reduced_ki~t |
Stage 3a/..  |   .8474057   .1465784    -0.96   0.338     .6037489    1.189396
      1.esrd |   .9846691   .0667985    -0.23   0.820      .862077    1.124695
1.other_tr~t |   1.062683   .0889144     0.73   0.467     .9019533    1.252056
  1.asplenia |   1.044209   .0875322     0.52   0.606     .8860015    1.230667
1.ra_sle_p~s |   .9651876   .0837035    -0.41   0.683     .8143167    1.144011
1.other_im~o |   .8506722    .075912    -1.81   0.070     .7141723    1.013261
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod2_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod2_1stVaccCensor.ster saved
(1,543 missing values generated)
(21,987 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
        716  observations end on or before enter()
------------------------------------------------------------------------------
     29,505  observations remaining, representing
     29,505  subjects
      8,664  failures in single-failure-per-subject data
  2,722,814  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(19,086 observations (episodes) created)
(cat_time: 19086 changes made)
(covidadmission: 19086 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     29,505       60.72       60.72
          1 |     12,931       26.61       87.33
          2 |      4,378        9.01       96.34
          3 |        775        1.59       97.94
          4 |        641        1.32       99.26
          5 |        361        0.74      100.00
------------+-----------------------------------
      Total |     48,591      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    24,273      5,232 |    29,505 
         1 |    10,524      2,407 |    12,931 
         2 |     3,522        856 |     4,378 
         3 |       720         55 |       775 
         4 |       559         82 |       641 
         5 |       329         32 |       361 
-----------+----------------------+----------
     Total |    39,927      8,664 |    48,591 
(48,532 observations deleted)
   1:      0.73 /        1 =       0.7260

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          775             Number of obs    =         775
No. of failures      =           55
Time at risk         =        34072
                                                Wald chi2(39)    =    27939.31
Log pseudolikelihood =   -216.65185             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 480 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .3459042    .287352    -1.28   0.201     .0678953    1.762269
 only 12-18  |   .0815606    .111945    -1.83   0.068     .0055357    1.201672
      mixed  |   1.04e+16          .        .       .            .           .
             |
        age1 |   .9450117   .1165352    -0.46   0.646     .7421134    1.203384
        age2 |   1.636024   1.065622     0.76   0.450     .4564154    5.864335
        age3 |   .3422752   .4467558    -0.82   0.411     .0265059    4.419864
      1.male |   1.579524   .4662701     1.55   0.121     .8856341    2.817073
             |
   obese4cat |
Obese I ..)  |   1.519881   .5659762     1.12   0.261     .7325505    3.153419
Obese II..)  |   .3834315   .2517596    -1.46   0.144     .1058747     1.38862
Obese II..)  |   .7508097   .5442107    -0.40   0.693     .1813644    3.108191
             |
smoke_nomiss |
     Former  |   2.882224   2.361888     1.29   0.196     .5783568    14.36348
    Current  |   .9098591    .416742    -0.21   0.837     .3707653    2.232797
             |
         imd |
          4  |   1.070481    .412004     0.18   0.860     .5034667    2.276079
5 most de..  |   1.255948   .5163864     0.55   0.579     .5610456    2.811548
             |
tot_adults~h |
          2  |   1.649788   2.523571     0.33   0.743     .0823004    33.07154
          3  |   2.897405          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .7912241   .3892008    -0.48   0.634     .3017143    2.074928
      Other  |   .8037895     .41747    -0.42   0.674     .2904342    2.224524
             |
1.htdiag_o~p |   1.304068   .3950395     0.88   0.381     .7201899    2.361313
1.~y_disease |   1.197994    .379272     0.57   0.568     .6441295    2.228106
    1.asthma |   1.035537    .610354     0.06   0.953     .3261822    3.287538
1.~c_disease |   .3603636   .1641394    -2.24   0.025      .147582    .8799307
             |
     diabcat |
T1DM, con..  |   2.61e-17   1.08e-17   -92.55   0.000     1.16e-17    5.87e-17
T1DM, unc..  |   2.43e-17   1.61e-17   -57.68   0.000     6.61e-18    8.90e-17
T2DM, con..  |   1.597014   .6231175     1.20   0.230     .7433442    3.431055
T2DM, unc..  |   .4522229   .4635253    -0.77   0.439     .0606564    3.371539
             |
cancer_exh~t |
  Last year  |   2.42e-17   2.97e-17   -31.14   0.000     2.17e-18    2.69e-16
2-5 years..  |   3.388765   3.444627     1.20   0.230     .4621768    24.84704
   5+ years  |   .6014897   .2721086    -1.12   0.261      .247829    1.459837
             |
cancer_hae~t |
  Last year  |   5.43e-17   3.93e-17   -51.69   0.000     1.31e-17    2.25e-16
2-5 years..  |   2.02e-17   8.17e-18   -95.00   0.000     9.13e-18    4.46e-17
   5+ years  |   .6162137   .2633171    -1.13   0.257     .2666862    1.423843
             |
1.~r_disease |   1.627099   .4871842     1.63   0.104      .904791    2.926037
1.stroke_d~a |   .8133878   .3389562    -0.50   0.620     .3594047    1.840821
1.other_ne~o |   .8115891   .3517391    -0.48   0.630     .3470797    1.897768
             |
reduced_ki~t |
Stage 3a/..  |     2.5069   1.536208     1.50   0.134     .7542714    8.331944
      1.esrd |   .7409644   .2251164    -0.99   0.324     .4084973    1.344019
1.other_tr~t |   1.351865   .4898124     0.83   0.405     .6645425    2.750069
  1.asplenia |   1.208546   .4127358     0.55   0.579     .6188219    2.360265
1.ra_sle_p~s |   1.550357   .4655642     1.46   0.144     .8606374    2.792821
1.other_im~o |   1.068015   .3816183     0.18   0.854     .5301875    2.151418
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod3_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod3_1stVaccCensor.ster saved
(1,543 missing values generated)
(21,987 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
        716  observations end on or before enter()
------------------------------------------------------------------------------
     29,505  observations remaining, representing
     29,505  subjects
      8,664  failures in single-failure-per-subject data
  2,722,814  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(19,086 observations (episodes) created)
(cat_time: 19086 changes made)
(covidadmission: 19086 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     29,505       60.72       60.72
          1 |     12,931       26.61       87.33
          2 |      4,378        9.01       96.34
          3 |        775        1.59       97.94
          4 |        641        1.32       99.26
          5 |        361        0.74      100.00
------------+-----------------------------------
      Total |     48,591      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    24,273      5,232 |    29,505 
         1 |    10,524      2,407 |    12,931 
         2 |     3,522        856 |     4,378 
         3 |       720         55 |       775 
         4 |       559         82 |       641 
         5 |       329         32 |       361 
-----------+----------------------+----------
     Total |    39,927      8,664 |    48,591 
(48,666 observations deleted)
   1:      0.69 /        1 =       0.6920

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          641             Number of obs    =         641
No. of failures      =           82
Time at risk         =        53117
                                                Wald chi2(35)    =       53.07
Log pseudolikelihood =   -303.62788             Prob > chi2      =      0.0257

                         (Std. Err. adjusted for 418 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   5.43e-21          .        .       .            .           .
 only 12-18  |   1.88e-19          .        .       .            .           .
      mixed  |   .1260051   .1353657    -1.93   0.054     .0153445    1.034721
             |
        age1 |    .980028   .0978271    -0.20   0.840      .805881    1.191807
        age2 |   1.070307    .590856     0.12   0.902     .3627504    3.157975
        age3 |   .8672234   .9644262    -0.13   0.898     .0980669    7.669014
      1.male |   .7430728   .1693325    -1.30   0.193     .4753991     1.16146
             |
   obese4cat |
Obese I ..)  |   1.107697      .3881     0.29   0.770     .5574278     2.20117
Obese II..)  |     .61752   .2997778    -0.99   0.321     .2384687    1.599082
Obese II..)  |    .707711   .4800262    -0.51   0.610      .187285    2.674293
             |
smoke_nomiss |
     Former  |   2.455659   2.038777     1.08   0.279     .4824692    12.49874
    Current  |    1.27861   .3957474     0.79   0.427     .6970749    2.345291
             |
         imd |
          4  |   1.228274   .3716026     0.68   0.497     .6788476    2.222379
5 most de..  |   1.178541    .420663     0.46   0.645     .5854919    2.372295
             |
tot_adults~h |
          2  |   2.042844          .        .       .            .           .
          3  |          1  (omitted)
             |
   ethnicity |
Asian or ..  |   .5910834   .2917319    -1.07   0.287     .2246645    1.555117
      Other  |   .7301483   .2902889    -0.79   0.429     .3349612    1.591577
             |
1.htdiag_o~p |   1.066256   .2655329     0.26   0.797     .6544617    1.737156
1.~y_disease |   1.010988   .2865457     0.04   0.969     .5800809    1.761989
    1.asthma |   .7579791   .3797012    -0.55   0.580     .2839601    2.023285
1.~c_disease |   1.327995   .3620059     1.04   0.298     .7783273    2.265846
             |
     diabcat |
T1DM, con..  |    .445008   .4781613    -0.75   0.451     .0541691    3.655816
T1DM, unc..  |   6.451487   4.831715     2.49   0.013     1.486514    27.99952
T2DM, con..  |   1.077646   .3693203     0.22   0.827     .5505044    2.109559
T2DM, unc..  |   2.861777   1.183227     2.54   0.011     1.272621    6.435354
             |
cancer_exh~t |
  Last year  |   3.48e-19          .        .       .            .           .
2-5 years..  |   2.406987   2.495542     0.85   0.397     .3154684    18.36503
   5+ years  |   1.078141   .3568932     0.23   0.820     .5635151    2.062746
             |
cancer_hae~t |
  Last year  |   3.58e-19          .        .       .            .           .
2-5 years..  |   .5928396   .6809493    -0.46   0.649     .0624062    5.631797
   5+ years  |   .9120044    .308647    -0.27   0.785     .4698154    1.770381
             |
1.~r_disease |   1.070146   .3171276     0.23   0.819     .5986835    1.912883
1.stroke_d~a |   1.310587   .3892429     0.91   0.362     .7322507    2.345696
1.other_ne~o |   .7131719   .2589855    -0.93   0.352     .3500127     1.45313
             |
reduced_ki~t |
Stage 3a/..  |    .472721   .4083811    -0.87   0.386     .0869474    2.570119
      1.esrd |   .9290391   .2261036    -0.30   0.762     .5765992    1.496904
1.other_tr~t |   1.766447   .5105848     1.97   0.049     1.002453    3.112699
  1.asplenia |   1.750775   .4441409     2.21   0.027     1.064868    2.878494
1.ra_sle_p~s |   1.291767   .3926427     0.84   0.400     .7119587    2.343762
1.other_im~o |   1.454611   .4356186     1.25   0.211     .8087863    2.616133
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod4_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod4_1stVaccCensor.ster saved
(1,543 missing values generated)
(21,987 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
        716  observations end on or before enter()
------------------------------------------------------------------------------
     29,505  observations remaining, representing
     29,505  subjects
      8,664  failures in single-failure-per-subject data
  2,722,814  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(19,086 observations (episodes) created)
(cat_time: 19086 changes made)
(covidadmission: 19086 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     29,505       60.72       60.72
          1 |     12,931       26.61       87.33
          2 |      4,378        9.01       96.34
          3 |        775        1.59       97.94
          4 |        641        1.32       99.26
          5 |        361        0.74      100.00
------------+-----------------------------------
      Total |     48,591      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    24,273      5,232 |    29,505 
         1 |    10,524      2,407 |    12,931 
         2 |     3,522        856 |     4,378 
         3 |       720         55 |       775 
         4 |       559         82 |       641 
         5 |       329         32 |       361 
-----------+----------------------+----------
     Total |    39,927      8,664 |    48,591 
(48,946 observations deleted)
   1:      0.42 /        1 =       0.4180

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          361             Number of obs    =         361
No. of failures      =           32
Time at risk         =        15307
                                                Wald chi2(37)    =    16832.37
Log pseudolikelihood =   -85.768993             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 280 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   6.12e-12   1.26e-11   -12.57   0.000     1.09e-13    3.43e-10
 only 12-18  |   2.57e+09          .        .       .            .           .
      mixed  |   .0033372   .0051768    -3.68   0.000     .0001596    .0697882
             |
        age1 |    .992304   .1784143    -0.04   0.966     .6975903    1.411527
        age2 |   .6442023   .6303985    -0.45   0.653     .0946368     4.38515
        age3 |   2.868435   5.694198     0.53   0.596      .058601    140.4058
      1.male |   1.213423   .4509287     0.52   0.603     .5857212    2.513814
             |
   obese4cat |
Obese I ..)  |   1.590058   1.194596     0.62   0.537     .3646812    6.932865
Obese II..)  |   1.095578    .906954     0.11   0.912     .2162678    5.550023
Obese II..)  |   1.257399   1.456763     0.20   0.843      .129811    12.17965
             |
smoke_nomiss |
     Former  |   7.09e-17   1.14e-16   -23.21   0.000     3.07e-18    1.64e-15
    Current  |    .250327   .2920937    -1.19   0.235     .0254264    2.464513
             |
         imd |
          4  |   .5118557   .3144769    -1.09   0.276     .1535258    1.706529
5 most de..  |   .4177388    .422845    -0.86   0.388     .0574511    3.037463
             |
tot_adults~h |
          2  |   1.14e+11          .        .       .            .           .
          3  |          1  (omitted)
             |
   ethnicity |
Asian or ..  |   .7315129   .8632489    -0.26   0.791     .0723986    7.391182
      Other  |   .9071066   .8582808    -0.10   0.918     .1419951    5.794863
             |
1.htdiag_o~p |   1.437392    .626051     0.83   0.405     .6121213    3.375305
1.~y_disease |   1.286611   .6780828     0.48   0.633     .4579715    3.614566
    1.asthma |   .9899686   .9595164    -0.01   0.992     .1481165    6.616668
1.~c_disease |   .7881666   .5090069    -0.37   0.712      .222281     2.79469
             |
     diabcat |
T1DM, con..  |   1.241041   .9893428     0.27   0.786     .2601469    5.920435
T1DM, unc..  |   8.50e-18          .        .       .            .           .
T2DM, con..  |   .3089471   .3436524    -1.06   0.291     .0349191    2.733409
T2DM, unc..  |   1.30e-16   7.46e-17   -63.90   0.000     4.24e-17    4.00e-16
             |
cancer_exh~t |
  Last year  |   1.53e-16   2.40e-16   -23.16   0.000     7.00e-18    3.33e-15
2-5 years..  |   1.98e-08   4.08e-08    -8.58   0.000     3.44e-10    1.13e-06
   5+ years  |   1.967739   1.108993     1.20   0.230     .6519903    5.938736
             |
cancer_hae~t |
  Last year  |    47.5528   76.44321     2.40   0.016     2.036256    1110.503
2-5 years..  |   1.349372   2.056985     0.20   0.844     .0680078    26.77347
   5+ years  |   2.207876   1.104471     1.58   0.113     .8282638    5.885466
             |
1.~r_disease |   1.179591   .6689749     0.29   0.771     .3881455    3.584831
1.stroke_d~a |   1.771007   .8848225     1.14   0.253     .6651916    4.715131
1.other_ne~o |   2.186294   1.152112     1.48   0.138     .7783065    6.141386
             |
reduced_ki~t |
Stage 3a/..  |   1.57e-10   3.38e-10   -10.49   0.000     2.32e-12    1.06e-08
      1.esrd |     2.3267     1.0896     1.80   0.071      .929224    5.825866
1.other_tr~t |   1.036408   .6136417     0.06   0.952     .3247482    3.307611
  1.asplenia |    .728347   .4506568    -0.51   0.608      .216604     2.44912
1.ra_sle_p~s |   1.790464   .9583628     1.09   0.277     .6271216    5.111864
1.other_im~o |   1.518774   .9258441     0.69   0.493     .4598337    5.016321
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod5_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod5_1stVaccCensor.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covidadmission_1st
> VaccCensor.log
  log type:  text
 closed on:  15 Mar 2023, 14:09:17
-------------------------------------------------------------------------------
