-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_tpp_prob_2nd
> VaccCensor.log
  log type:  text
 opened on:  15 Mar 2023, 13:58:28

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. forvalues period=0/5 {
  3. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  4. 
. *Censor at date of second vacc_7ds
. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
  5. replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>s
> econd_vacc_plus_7d
  6. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7.         
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. *Omicron period +7 days: 27th December 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  8. stsplit cat_time, at(0,85,154, 216, 263, 372, 500)
  9. recode cat_time 85=1 154=2 216=3 263=4 372=5
 10. recode `outcome' .=0 
 11. tab cat_time
 12. tab cat_time `outcome'
 13. }
 14. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. *Omicron period +14 days: 3rd January 2022
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 15. stsplit cat_time, at(0,92,161,222,270, 379, 500)
 16. recode cat_time 92=1 161=2 222=3 270=4 379=5
 17. recode `outcome' .=0 
 18. tab cat_time
 19. tab cat_time `outcome'
 20. }
 21. keep if cat_time==`period'
 22. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 23. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 24. if _rc==0{
 25. estimates
 26. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'_2ndVaccCensor", replace
 27.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 28. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 29. 
. }
 30. }
 31. }
(17,201 missing values generated)
(32,706 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    107,226  observations remaining, representing
    107,226  subjects
     85,850  failures in single-failure-per-subject data
   16863851  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(179,374 observations (episodes) created)
(cat_time: 179374 changes made)
(covid_tpp_prob: 179374 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       37.41       37.41
          1 |     78,089       27.25       64.66
          2 |     58,050       20.25       84.91
          3 |     29,429       10.27       95.18
          4 |     11,639        4.06       99.24
          5 |      2,167        0.76      100.00
------------+-----------------------------------
      Total |    286,600      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    35,864     22,186 |    58,050 
         3 |    16,936     12,493 |    29,429 
         4 |     5,257      6,382 |    11,639 
         5 |     1,412        755 |     2,167 
-----------+----------------------+----------
     Total |   200,750     85,850 |   286,600 
(179,386 observations deleted)
   1:     35.01 /        1 =      35.0070

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      107,226             Number of obs    =     107,226
No. of failures      =       26,318
Time at risk         =      7859535
                                                Wald chi2(42)    =       33.00
Log pseudolikelihood =   -240333.33             Prob > chi2      =      0.8385

                       (Std. Err. adjusted for 1,373 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8866278   .1058886    -1.01   0.314     .7015904    1.120467
 only 12-18  |   .9554781   .1580023    -0.28   0.783     .6909746    1.321233
      mixed  |   .9538223   .0989224    -0.46   0.648     .7783736    1.168818
             |
        age1 |   1.001601    .002405     0.67   0.505     .9968983    1.006326
        age2 |   .9925411    .007492    -0.99   0.321     .9779652    1.007334
        age3 |   1.025038   .0219818     1.15   0.249      .982847    1.069039
      1.male |   1.005641   .0126739     0.45   0.655     .9811047    1.030791
             |
   obese4cat |
Obese I ..)  |   1.001264   .0179921     0.07   0.944     .9666137    1.037156
Obese II..)  |   .9677343   .0221264    -1.43   0.151     .9253246    1.012088
Obese II..)  |   1.003105   .0272921     0.11   0.909     .9510144    1.058048
             |
smoke_nomiss |
     Former  |   1.090377   .0463583     2.04   0.042     1.003199    1.185131
    Current  |   .9699568   .0186883    -1.58   0.113     .9340114    1.007286
             |
         imd |
          4  |   .9908293   .0145711    -0.63   0.531     .9626781    1.019804
5 most de..  |   1.003257   .0207117     0.16   0.875     .9634731    1.044684
             |
tot_adults~h |
          2  |   .7112552   .2328225    -1.04   0.298     .3744492    1.351008
          3  |   .9817966   .2430367    -0.07   0.941     .6043836    1.594889
             |
   ethnicity |
Asian or ..  |   .9899512   .0204109    -0.49   0.624     .9507441    1.030775
      Other  |   .9888969   .0210986    -0.52   0.601     .9483971    1.031126
             |
1.htdiag_o~p |   .9907804   .0135793    -0.68   0.499     .9645198    1.017756
1.~y_disease |   1.024049   .0146663     1.66   0.097      .995703    1.053202
    1.asthma |   1.020539     .02235     0.93   0.353     .9776606    1.065298
1.~c_disease |    1.01369   .0161412     0.85   0.393     .9825422    1.045825
             |
     diabcat |
T1DM, con..  |    1.00935   .0390826     0.24   0.810     .9355845    1.088932
T1DM, unc..  |   1.131415   .0936099     1.49   0.136      .962046    1.330601
T2DM, con..  |    1.00266   .0168057     0.16   0.874     .9702565    1.036145
T2DM, unc..  |      1.002     .03209     0.06   0.950     .9410382    1.066911
Diabetes,..  |   1.172288   .2128873     0.88   0.381     .8212139    1.673449
             |
cancer_exh~t |
  Last year  |   .9832336     .10083    -0.16   0.869     .8042045    1.202117
2-5 years..  |   1.026593   .0500377     0.54   0.590     .9330595    1.129502
   5+ years  |   .9826078    .015753    -1.09   0.274     .9522124    1.013973
             |
cancer_hae~t |
  Last year  |   1.028095    .097474     0.29   0.770     .8537498    1.238043
2-5 years..  |   .9263587   .0496074    -1.43   0.153     .8340585    1.028873
   5+ years  |   .9956625   .0163517    -0.26   0.791     .9641241    1.028232
             |
1.~r_disease |   .9814573   .0152258    -1.21   0.228     .9520644    1.011758
1.stroke_d~a |    1.00426   .0155816     0.27   0.784     .9741802    1.035268
1.other_ne~o |    .995732   .0151904    -0.28   0.779        .9664    1.025954
             |
reduced_ki~t |
Stage 3a/..  |   .9502637   .0974936    -0.50   0.619     .7771663    1.161915
      1.esrd |   .9979959   .0126639    -0.16   0.874     .9734812    1.023128
1.other_tr~t |   1.004081   .0150015     0.27   0.785     .9751048    1.033918
  1.asplenia |   .9719425   .0144341    -1.92   0.055     .9440599    1.000649
1.ra_sle_p~s |   1.006433   .0150083     0.43   0.667     .9774433    1.036283
1.other_im~o |   1.008225   .0153092     0.54   0.590     .9786617    1.038682
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod0_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod0_2ndVaccCensor.ster saved
(17,201 missing values generated)
(32,706 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    107,226  observations remaining, representing
    107,226  subjects
     85,850  failures in single-failure-per-subject data
   16863851  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(179,374 observations (episodes) created)
(cat_time: 179374 changes made)
(covid_tpp_prob: 179374 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       37.41       37.41
          1 |     78,089       27.25       64.66
          2 |     58,050       20.25       84.91
          3 |     29,429       10.27       95.18
          4 |     11,639        4.06       99.24
          5 |      2,167        0.76      100.00
------------+-----------------------------------
      Total |    286,600      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    35,864     22,186 |    58,050 
         3 |    16,936     12,493 |    29,429 
         4 |     5,257      6,382 |    11,639 
         5 |     1,412        755 |     2,167 
-----------+----------------------+----------
     Total |   200,750     85,850 |   286,600 
(208,523 observations deleted)
   1:     22.55 /        1 =      22.5520

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       78,089             Number of obs    =      78,089
No. of failures      =       17,716
Time at risk         =      4686825
                                                Wald chi2(42)    =       34.42
Log pseudolikelihood =   -156324.97             Prob > chi2      =      0.7909

                       (Std. Err. adjusted for 1,341 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8770704   .1313056    -0.88   0.381      .654036    1.176162
 only 12-18  |   .8574193   .1664942    -0.79   0.428     .5860119    1.254527
      mixed  |   .8472646   .1116799    -1.26   0.209     .6543652    1.097028
             |
        age1 |   .9970146    .002797    -1.07   0.287     .9915476    1.002512
        age2 |   1.010236   .0091492     1.12   0.261      .992462    1.028328
        age3 |   .9711472   .0252412    -1.13   0.260     .9229144    1.021901
      1.male |   1.004927   .0149549     0.33   0.741      .976039    1.034669
             |
   obese4cat |
Obese I ..)  |   .9673508   .0215782    -1.49   0.137     .9259695    1.010581
Obese II..)  |   .9554775   .0260696    -1.67   0.095     .9057242    1.007964
Obese II..)  |   .9428806   .0316887    -1.75   0.080     .8827733     1.00708
             |
smoke_nomiss |
     Former  |   1.009013   .0521065     0.17   0.862     .9118845    1.116487
    Current  |   1.027146   .0229604     1.20   0.231     .9831165    1.073148
             |
         imd |
          4  |   .9942561   .0191013    -0.30   0.764     .9575143    1.032408
5 most de..  |   1.000801   .0257142     0.03   0.975     .9516498     1.05249
             |
tot_adults~h |
          2  |     .80453   .3181506    -0.55   0.582     .3706256    1.746421
          3  |   1.126485   .3450741     0.39   0.697     .6179855    2.053394
             |
   ethnicity |
Asian or ..  |   .9485725   .0246906    -2.03   0.043     .9013934     .998221
      Other  |   1.004817   .0247062     0.20   0.845     .9575416    1.054425
             |
1.htdiag_o~p |   .9949928   .0159944    -0.31   0.755     .9641331     1.02684
1.~y_disease |     1.0331   .0186288     1.81   0.071     .9972259    1.070265
    1.asthma |   .9900709   .0276481    -0.36   0.721     .9373378    1.045771
1.~c_disease |   .9878938    .018477    -0.65   0.515     .9523352     1.02478
             |
     diabcat |
T1DM, con..  |   1.008539   .0467681     0.18   0.855     .9209177    1.104498
T1DM, unc..  |    1.11165   .1100036     1.07   0.285     .9156659     1.34958
T2DM, con..  |   1.002552   .0204583     0.12   0.901     .9632458    1.043462
T2DM, unc..  |   1.031142   .0406137     0.78   0.436     .9545354    1.113897
Diabetes,..  |   1.117992   .2717001     0.46   0.646     .6943449    1.800122
             |
cancer_exh~t |
  Last year  |   1.013063   .1217293     0.11   0.914     .8004911    1.282085
2-5 years..  |   1.061804    .067039     0.95   0.342     .9382143    1.201673
   5+ years  |   1.043757   .0206956     2.16   0.031     1.003972    1.085118
             |
cancer_hae~t |
  Last year  |   1.017254   .1192102     0.15   0.884     .8084973    1.279912
2-5 years..  |   .9706718   .0619725    -0.47   0.641     .8565002    1.100063
   5+ years  |   1.008142   .0199606     0.41   0.682     .9697693    1.048033
             |
1.~r_disease |   .9966042   .0190198    -0.18   0.859     .9600147    1.034588
1.stroke_d~a |   1.024741   .0192331     1.30   0.193     .9877302     1.06314
1.other_ne~o |   .9866532   .0186509    -0.71   0.477     .9507669    1.023894
             |
reduced_ki~t |
Stage 3a/..  |   .8983834   .1226935    -0.78   0.433     .6874038    1.174117
      1.esrd |   .9779018   .0156057    -1.40   0.161     .9477886    1.008972
1.other_tr~t |   1.008164   .0186164     0.44   0.660     .9723292     1.04532
  1.asplenia |   .9933484   .0185962    -0.36   0.721     .9575612    1.030473
1.ra_sle_p~s |   .9809834   .0180112    -1.05   0.296     .9463098    1.016928
1.other_im~o |   .9830657   .0182987    -0.92   0.359     .9478473    1.019593
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod1_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod1_2ndVaccCensor.ster saved
(17,201 missing values generated)
(32,706 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    107,226  observations remaining, representing
    107,226  subjects
     85,850  failures in single-failure-per-subject data
   16863851  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(179,374 observations (episodes) created)
(cat_time: 179374 changes made)
(covid_tpp_prob: 179374 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       37.41       37.41
          1 |     78,089       27.25       64.66
          2 |     58,050       20.25       84.91
          3 |     29,429       10.27       95.18
          4 |     11,639        4.06       99.24
          5 |      2,167        0.76      100.00
------------+-----------------------------------
      Total |    286,600      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    35,864     22,186 |    58,050 
         3 |    16,936     12,493 |    29,429 
         4 |     5,257      6,382 |    11,639 
         5 |     1,412        755 |     2,167 
-----------+----------------------+----------
     Total |   200,750     85,850 |   286,600 
(228,562 observations deleted)
   1:     14.70 /        1 =      14.6990

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       58,050             Number of obs    =      58,050
No. of failures      =       22,186
Time at risk         =      2799982
                                                Wald chi2(42)    =       27.82
Log pseudolikelihood =   -185900.44             Prob > chi2      =      0.9547

                       (Std. Err. adjusted for 1,304 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.051042   .1564369     0.33   0.738      .785104     1.40706
 only 12-18  |   .9321999   .2131884    -0.31   0.759     .5954488    1.459398
      mixed  |   .9707436   .1333143    -0.22   0.829      .741664     1.27058
             |
        age1 |   1.000496   .0024287     0.20   0.838     .9957473    1.005268
        age2 |    .995254   .0078805    -0.60   0.548     .9799277     1.01082
        age3 |   1.018607   .0230631     0.81   0.416     .9743925    1.064828
      1.male |   1.016143   .0139579     1.17   0.244     .9891513    1.043872
             |
   obese4cat |
Obese I ..)  |   .9808591   .0202791    -0.93   0.350     .9419074    1.021422
Obese II..)  |   1.001016   .0241352     0.04   0.966     .9548125    1.049456
Obese II..)  |    1.01363   .0302199     0.45   0.650     .9560979    1.074625
             |
smoke_nomiss |
     Former  |   1.010075   .0498226     0.20   0.839     .9169965    1.112602
    Current  |   .9828097    .019928    -0.86   0.392     .9445175    1.022654
             |
         imd |
          4  |   .9980769    .017476    -0.11   0.912     .9644056    1.032924
5 most de..  |   1.012465   .0231266     0.54   0.588     .9681377    1.058823
             |
tot_adults~h |
          2  |   1.306604   .4407091     0.79   0.428     .6745893    2.530747
          3  |   1.036979   .2884549     0.13   0.896     .6011632    1.788741
             |
   ethnicity |
Asian or ..  |   .9811128   .0228569    -0.82   0.413     .9373215     1.02695
      Other  |   1.014822    .022227     0.67   0.502     .9721794    1.059334
             |
1.htdiag_o~p |   .9925916    .014662    -0.50   0.615     .9642665    1.021749
1.~y_disease |   .9754792   .0161354    -1.50   0.133     .9443616    1.007622
    1.asthma |   .9973003   .0245069    -0.11   0.912      .950406    1.046508
1.~c_disease |   .9862273   .0161538    -0.85   0.397     .9550692    1.018402
             |
     diabcat |
T1DM, con..  |   1.025566   .0450176     0.58   0.565     .9410222    1.117706
T1DM, unc..  |   1.011352   .0942579     0.12   0.904     .8425014    1.214044
T2DM, con..  |   .9655079   .0176856    -1.92   0.055     .9314595    1.000801
T2DM, unc..  |   .9920671   .0361251    -0.22   0.827     .9237307    1.065459
Diabetes,..  |   1.191775   .2682835     0.78   0.436     .7666167    1.852723
             |
cancer_exh~t |
  Last year  |   .9388385    .103968    -0.57   0.569     .7556625    1.166417
2-5 years..  |   .9409844   .0532238    -1.08   0.282     .8422419    1.051303
   5+ years  |   .9990997   .0167359    -0.05   0.957     .9668306    1.032446
             |
cancer_hae~t |
  Last year  |    .957546   .0976197    -0.43   0.670     .7841181    1.169332
2-5 years..  |   .9243791   .0546243    -1.33   0.183     .8232847    1.037887
   5+ years  |   1.018113   .0180259     1.01   0.311      .983389    1.054063
             |
1.~r_disease |   1.000306   .0168569     0.02   0.986     .9678062    1.033896
1.stroke_d~a |    1.00408   .0164352     0.25   0.804     .9723784    1.036814
1.other_ne~o |   .9863592   .0171288    -0.79   0.429     .9533524    1.020509
             |
reduced_ki~t |
Stage 3a/..  |   1.068371   .1133627     0.62   0.533     .8677665     1.31535
      1.esrd |   .9934243   .0136468    -0.48   0.631     .9670339    1.020535
1.other_tr~t |   .9942664   .0168379    -0.34   0.734     .9618064    1.027822
  1.asplenia |   .9986267   .0166513    -0.08   0.934     .9665183    1.031802
1.ra_sle_p~s |   .9908949   .0169841    -0.53   0.594     .9581597    1.024749
1.other_im~o |   .9789885   .0168958    -1.23   0.219     .9464271     1.01267
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod2_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod2_2ndVaccCensor.ster saved
(17,201 missing values generated)
(32,706 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    107,226  observations remaining, representing
    107,226  subjects
     85,850  failures in single-failure-per-subject data
   16863851  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(179,374 observations (episodes) created)
(cat_time: 179374 changes made)
(covid_tpp_prob: 179374 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       37.41       37.41
          1 |     78,089       27.25       64.66
          2 |     58,050       20.25       84.91
          3 |     29,429       10.27       95.18
          4 |     11,639        4.06       99.24
          5 |      2,167        0.76      100.00
------------+-----------------------------------
      Total |    286,600      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    35,864     22,186 |    58,050 
         3 |    16,936     12,493 |    29,429 
         4 |     5,257      6,382 |    11,639 
         5 |     1,412        755 |     2,167 
-----------+----------------------+----------
     Total |   200,750     85,850 |   286,600 
(257,183 observations deleted)
   1:      7.29 /        1 =       7.2890

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       29,429             Number of obs    =      29,429
No. of failures      =       12,493
Time at risk         =       946051
                                                Wald chi2(42)    =       44.50
Log pseudolikelihood =   -95061.247             Prob > chi2      =      0.3671

                       (Std. Err. adjusted for 1,204 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9067762   .1861149    -0.48   0.634     .6064456     1.35584
 only 12-18  |   .7954196   .2113917    -0.86   0.389     .4724762    1.339099
      mixed  |   .8472424   .1503573    -0.93   0.350     .5983396    1.199686
             |
        age1 |   1.004725   .0033122     1.43   0.153     .9982542    1.011238
        age2 |   .9814072   .0100962    -1.82   0.068     .9618171    1.001396
        age3 |   1.058019   .0310851     1.92   0.055     .9988146    1.120733
      1.male |   1.017918   .0183628     0.98   0.325     .9825568    1.054553
             |
   obese4cat |
Obese I ..)  |   1.031469   .0267976     1.19   0.233      .980261    1.085351
Obese II..)  |   1.045159   .0323534     1.43   0.154     .9836326    1.110533
Obese II..)  |   1.072301   .0407408     1.84   0.066     .9953513      1.1552
             |
smoke_nomiss |
     Former  |   .9312993   .0608628    -1.09   0.276     .8193341    1.058565
    Current  |   1.012413   .0268402     0.47   0.642     .9611509     1.06641
             |
         imd |
          4  |   1.006391   .0230816     0.28   0.781     .9621532    1.052662
5 most de..  |   1.008122   .0299021     0.27   0.785     .9511863    1.068466
             |
tot_adults~h |
          2  |   .7153979   .3034178    -0.79   0.430     .3115533    1.642718
          3  |    .847139   .2856849    -0.49   0.623      .437421    1.640626
             |
   ethnicity |
Asian or ..  |   1.034762   .0292659     1.21   0.227     .9789631    1.093742
      Other  |   .9793236   .0303709    -0.67   0.500     .9215706    1.040696
             |
1.htdiag_o~p |   .9965259   .0193244    -0.18   0.858     .9593615     1.03513
1.~y_disease |   1.023908   .0228421     1.06   0.290     .9801029    1.069671
    1.asthma |    1.06429    .034291     1.93   0.053     .9991593    1.133667
1.~c_disease |    .967189   .0214673    -1.50   0.133     .9260159    1.010193
             |
     diabcat |
T1DM, con..  |   1.001918   .0591197     0.03   0.974     .8924951    1.124757
T1DM, unc..  |   .8896416   .1203772    -0.86   0.387     .6824002    1.159821
T2DM, con..  |   1.011541   .0241264     0.48   0.630     .9653425    1.059951
T2DM, unc..  |   1.052499   .0488236     1.10   0.270     .9610279    1.152677
Diabetes,..  |   1.466028   .4776325     1.17   0.240     .7741419    2.776285
             |
cancer_exh~t |
  Last year  |   1.100643    .154025     0.69   0.493     .8366206    1.447986
2-5 years..  |   .9228629   .0700332    -1.06   0.290     .7953205    1.070859
   5+ years  |   .9857018   .0225224    -0.63   0.529     .9425326    1.030848
             |
cancer_hae~t |
  Last year  |   .8907302   .1257222    -0.82   0.412     .6754657    1.174598
2-5 years..  |   1.022356   .0745272     0.30   0.762     .8862406    1.179377
   5+ years  |   1.019648   .0235963     0.84   0.400     .9744335    1.066961
             |
1.~r_disease |   1.039843   .0213857     1.90   0.057     .9987617    1.082615
1.stroke_d~a |   .9654279   .0211208    -1.61   0.108     .9249068    1.007724
1.other_ne~o |   1.017807   .0218511     0.82   0.411     .9758682    1.061548
             |
reduced_ki~t |
Stage 3a/..  |   .8295353   .1252984    -1.24   0.216     .6169696    1.115336
      1.esrd |   .9881954   .0179822    -0.65   0.514     .9535721    1.024076
1.other_tr~t |   1.017523   .0218125     0.81   0.418     .9756565    1.061185
  1.asplenia |   .9878957   .0226463    -0.53   0.595     .9444921    1.033294
1.ra_sle_p~s |   .9737166   .0211526    -1.23   0.220     .9331284     1.01607
1.other_im~o |   .9969535   .0220163    -0.14   0.890      .954723    1.041052
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod3_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod3_2ndVaccCensor.ster saved
(17,201 missing values generated)
(32,706 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    107,226  observations remaining, representing
    107,226  subjects
     85,850  failures in single-failure-per-subject data
   16863851  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(179,374 observations (episodes) created)
(cat_time: 179374 changes made)
(covid_tpp_prob: 179374 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       37.41       37.41
          1 |     78,089       27.25       64.66
          2 |     58,050       20.25       84.91
          3 |     29,429       10.27       95.18
          4 |     11,639        4.06       99.24
          5 |      2,167        0.76      100.00
------------+-----------------------------------
      Total |    286,600      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    35,864     22,186 |    58,050 
         3 |    16,936     12,493 |    29,429 
         4 |     5,257      6,382 |    11,639 
         5 |     1,412        755 |     2,167 
-----------+----------------------+----------
     Total |   200,750     85,850 |   286,600 
(274,973 observations deleted)
   1:      2.91 /        1 =       2.9110

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       11,639             Number of obs    =      11,639
No. of failures      =        6,382
Time at risk         =       479924
                                                Wald chi2(42)    =       49.46
Log pseudolikelihood =   -41027.079             Prob > chi2      =      0.1998

                       (Std. Err. adjusted for 1,061 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.236055   .4326089     0.61   0.545     .6224789    2.454433
 only 12-18  |    .931296   .3944534    -0.17   0.867     .4060305    2.136077
      mixed  |   1.045921   .3501894     0.13   0.893     .5426302    2.016013
             |
        age1 |   .9980519   .0048514    -0.40   0.688     .9885884    1.007606
        age2 |   1.015272   .0155697     0.99   0.323     .9852095    1.046251
        age3 |   .9467264   .0412821    -1.26   0.209     .8691761    1.031196
      1.male |    1.01335   .0246464     0.55   0.586     .9661772    1.062826
             |
   obese4cat |
Obese I ..)  |   1.048395   .0371998     1.33   0.183     .9779628    1.123901
Obese II..)  |   .9976253   .0475129    -0.05   0.960     .9087158    1.095234
Obese II..)  |    .946701   .0537135    -0.97   0.334      .847067    1.058054
             |
smoke_nomiss |
     Former  |   .8576697   .0778093    -1.69   0.091     .7179555    1.024572
    Current  |   1.030574   .0384567     0.81   0.420     .9578904    1.108772
             |
         imd |
          4  |   .9835439   .0312342    -0.52   0.601     .9241922    1.046707
5 most de..  |   .9705073   .0426629    -0.68   0.496     .8903905    1.057833
             |
tot_adults~h |
          2  |   2.038332   1.416116     1.03   0.305     .5222869     7.95501
          3  |   1.329001   .7739066     0.49   0.625     .4244748     4.16101
             |
   ethnicity |
Asian or ..  |   .9760317   .0403624    -0.59   0.557     .9000439    1.058435
      Other  |   1.039842   .0425515     0.95   0.340     .9596991    1.126677
             |
1.htdiag_o~p |   1.019039   .0277045     0.69   0.488     .9661609    1.074812
1.~y_disease |   1.031291   .0323179     0.98   0.326      .969855    1.096618
    1.asthma |   1.034443   .0466561     0.75   0.453     .9469245    1.130051
1.~c_disease |   .9842707   .0300587    -0.52   0.604     .9270853    1.044983
             |
     diabcat |
T1DM, con..  |   1.026527   .0779263     0.34   0.730     .8846134    1.191207
T1DM, unc..  |   1.268639   .2038408     1.48   0.139     .9259119    1.738226
T2DM, con..  |   1.029526   .0354121     0.85   0.398     .9624074    1.101325
T2DM, unc..  |   1.088134   .0714771     1.29   0.198     .9566849    1.237645
Diabetes,..  |   1.994193   .7405697     1.86   0.063     .9630801    4.129258
             |
cancer_exh~t |
  Last year  |   1.312488    .272778     1.31   0.191      .873349    1.972436
2-5 years..  |   .8544227   .0860914    -1.56   0.118     .7013034    1.040973
   5+ years  |   1.009798   .0345478     0.28   0.776     .9443059    1.079832
             |
cancer_hae~t |
  Last year  |   1.034907   .1947726     0.18   0.855     .7156536    1.496581
2-5 years..  |   .9094334   .0893587    -0.97   0.334     .7501256    1.102574
   5+ years  |   1.055127   .0360494     1.57   0.116     .9867848    1.128201
             |
1.~r_disease |   .9435473    .030936    -1.77   0.076     .8848209    1.006171
1.stroke_d~a |   1.024962   .0321701     0.79   0.432     .9638098    1.089994
1.other_ne~o |    .984745   .0304945    -0.50   0.620     .9267545    1.046364
             |
reduced_ki~t |
Stage 3a/..  |   1.609086   .2622065     2.92   0.004     1.169157    2.214551
      1.esrd |    .997397   .0267792    -0.10   0.923     .9462678    1.051289
1.other_tr~t |   1.002744   .0311205     0.09   0.930     .9435674    1.065633
  1.asplenia |   .9666737   .0312259    -1.05   0.294     .9073692    1.029854
1.ra_sle_p~s |   1.012725   .0316048     0.41   0.685     .9526373    1.076603
1.other_im~o |   1.035328   .0321381     1.12   0.263     .9742167    1.100274
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod4_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod4_2ndVaccCensor.ster saved
(17,201 missing values generated)
(32,706 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    107,226  observations remaining, representing
    107,226  subjects
     85,850  failures in single-failure-per-subject data
   16863851  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(179,374 observations (episodes) created)
(cat_time: 179374 changes made)
(covid_tpp_prob: 179374 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       37.41       37.41
          1 |     78,089       27.25       64.66
          2 |     58,050       20.25       84.91
          3 |     29,429       10.27       95.18
          4 |     11,639        4.06       99.24
          5 |      2,167        0.76      100.00
------------+-----------------------------------
      Total |    286,600      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    35,864     22,186 |    58,050 
         3 |    16,936     12,493 |    29,429 
         4 |     5,257      6,382 |    11,639 
         5 |     1,412        755 |     2,167 
-----------+----------------------+----------
     Total |   200,750     85,850 |   286,600 
(284,445 observations deleted)
   1:      1.24 /        1 =       1.2380

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,167             Number of obs    =       2,167
No. of failures      =          755
Time at risk         =        91534
                                                Wald chi2(40)    =       45.09
Log pseudolikelihood =    -3834.421             Prob > chi2      =      0.2675

                         (Std. Err. adjusted for 759 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   4.532718   4.023853     1.70   0.089     .7956408    25.82262
 only 12-18  |   2.685557   3.272565     0.81   0.418     .2464774    29.26116
      mixed  |   3.620106   2.682452     1.74   0.083     .8472115    15.46859
             |
        age1 |   .9878706   .0144655    -0.83   0.405     .9599216    1.016633
        age2 |   1.047694   .0477618     1.02   0.307     .9581424    1.145614
        age3 |   .8721724   .1129128    -1.06   0.291     .6767128    1.124088
      1.male |   1.086178   .0775137     1.16   0.247     .9444001     1.24924
             |
   obese4cat |
Obese I ..)  |   1.319342   .1327099     2.76   0.006      1.08327     1.60686
Obese II..)  |   1.146601   .1532465     1.02   0.306     .8823622    1.489971
Obese II..)  |   .9822857   .1642369    -0.11   0.915     .7078121    1.363194
             |
smoke_nomiss |
     Former  |   .9514477   .2563816    -0.18   0.853     .5610688    1.613443
    Current  |   .8689007   .1023896    -1.19   0.233     .6897095    1.094647
             |
         imd |
          4  |   .8293283   .0786645    -1.97   0.049     .6886321    .9987705
5 most de..  |   .9189925   .1171587    -0.66   0.508     .7158065    1.179854
             |
3.tot_adul~h |   .2123136   .2571088    -1.28   0.201     .0197781     2.27914
             |
   ethnicity |
Asian or ..  |   1.037764   .1251022     0.31   0.758     .8193819    1.314349
      Other  |   1.019794   .1222351     0.16   0.870     .8062784    1.289851
             |
1.htdiag_o~p |   .9574546   .0727788    -0.57   0.567     .8249279    1.111272
1.~y_disease |   .9448946   .0928504    -0.58   0.564      .779363    1.145584
    1.asthma |   .8220367   .1273359    -1.27   0.206     .6067889     1.11364
1.~c_disease |   1.099725    .098929     1.06   0.291     .9219593    1.311766
             |
     diabcat |
T1DM, con..  |   1.037514   .2332315     0.16   0.870      .667798    1.611917
T1DM, unc..  |   .4156796   .4468325    -0.82   0.414      .050555    3.417852
T2DM, con..  |   1.190913    .112529     1.85   0.064     .9895781     1.43321
T2DM, unc..  |   1.080599   .2308347     0.36   0.717     .7109408    1.642465
             |
cancer_exh~t |
  Last year  |   1.345575   1.307314     0.31   0.760     .2004057    9.034537
2-5 years..  |   .8276907   .2412797    -0.65   0.517     .4674495    1.465553
   5+ years  |   .8159273   .0851884    -1.95   0.051     .6649365    1.001204
             |
cancer_hae~t |
  Last year  |   .5565758   .4470049    -0.73   0.466     .1153175    2.686292
2-5 years..  |   .8298143   .2294192    -0.67   0.500     .4826682    1.426636
   5+ years  |   1.010161   .0922831     0.11   0.912     .8445574    1.208237
             |
1.~r_disease |   .8819497   .0863395    -1.28   0.199     .7279717    1.068497
1.stroke_d~a |   1.141179   .1071908     1.41   0.160     .9492932    1.371851
1.other_ne~o |    .966379   .0847399    -0.39   0.697     .8137805    1.147592
             |
reduced_ki~t |
Stage 3a/..  |   1.078062   .4520771     0.18   0.858     .4739134    2.452385
      1.esrd |   .9370523   .0715997    -0.85   0.395     .8067221    1.088438
1.other_tr~t |    .982108   .0925879    -0.19   0.848     .8164179    1.181425
  1.asplenia |   1.036618   .0959591     0.39   0.698     .8646164    1.242836
1.ra_sle_p~s |   .9183901   .0838722    -0.93   0.351     .7678759    1.098407
1.other_im~o |   1.042836   .0916896     0.48   0.633     .8777599    1.238958
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod5_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod5_2ndVaccCensor.ster saved
(4,919 missing values generated)
(9,075 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     30,217  observations remaining, representing
     30,217  subjects
     24,264  failures in single-failure-per-subject data
  4,739,839  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(50,313 observations (episodes) created)
(cat_time: 50313 changes made)
(covid_tpp_prob: 50313 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       37.52       37.52
          1 |     22,010       27.33       64.85
          2 |     16,278       20.21       85.07
          3 |      8,220       10.21       95.28
          4 |      3,207        3.98       99.26
          5 |        598        0.74      100.00
------------+-----------------------------------
      Total |     80,530      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |     9,986      6,292 |    16,278 
         3 |     4,709      3,511 |     8,220 
         4 |     1,467      1,740 |     3,207 
         5 |       375        223 |       598 
-----------+----------------------+----------
     Total |    56,266     24,264 |    80,530 
(50,317 observations deleted)
   1:     11.01 /        1 =      11.0080

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       30,217             Number of obs    =      30,217
No. of failures      =        7,393
Time at risk         =      2219911
                                                Wald chi2(42)    =       42.83
Log pseudolikelihood =   -58129.877             Prob > chi2      =      0.4355

                       (Std. Err. adjusted for 1,204 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9858003   .2300474    -0.06   0.951     .6239527    1.557493
 only 12-18  |   .8336442   .2490112    -0.61   0.542     .4642213     1.49705
      mixed  |    .851011   .1857019    -0.74   0.460     .5548706    1.305205
             |
        age1 |   1.001781   .0100127     0.18   0.859     .9823473    1.021599
        age2 |   .9682626   .0519843    -0.60   0.548     .8715526    1.075704
        age3 |   1.076164   .1147601     0.69   0.491     .8731879    1.326322
      1.male |   1.061496   .0242439     2.61   0.009     1.015027    1.110093
             |
   obese4cat |
Obese I ..)  |   1.000883   .0320876     0.03   0.978     .9399278    1.065792
Obese II..)  |   1.049464   .0418459     1.21   0.226     .9705703     1.13477
Obese II..)  |   .9990055   .0489402    -0.02   0.984     .9075456    1.099682
             |
smoke_nomiss |
     Former  |   .8379969   .0719522    -2.06   0.040     .7082008    .9915814
    Current  |   1.013659   .0369167     0.37   0.710     .9438252    1.088659
             |
         imd |
          4  |   .9815858   .0276679    -0.66   0.510     .9288284     1.03734
5 most de..  |   .9594462   .0385574    -1.03   0.303     .8867747    1.038073
             |
tot_adults~h |
          2  |    1.31912    .813198     0.45   0.653     .3940432    4.415955
          3  |   1.057413   .5022176     0.12   0.906     .4168375    2.682392
             |
   ethnicity |
Asian or ..  |   1.003804   .0406159     0.09   0.925      .927273    1.086651
      Other  |   1.000663   .0367379     0.02   0.986     .9311873    1.075321
             |
1.htdiag_o~p |   1.032159   .0249273     1.31   0.190     .9844407    1.082191
1.~y_disease |   .9606399   .0272857    -1.41   0.157     .9086224    1.015635
    1.asthma |   .9603973   .0388967    -1.00   0.318     .8871085    1.039741
1.~c_disease |   1.050689   .0296129     1.75   0.079     .9942227    1.110362
             |
     diabcat |
T1DM, con..  |   1.033113   .0749885     0.45   0.654     .8961143    1.191057
T1DM, unc..  |   1.303076   .1706944     2.02   0.043     1.008017    1.684502
T2DM, con..  |   1.009063   .0315582     0.29   0.773     .9490681    1.072851
T2DM, unc..  |   .9861037   .0591269    -0.23   0.815     .8767675    1.109074
Diabetes,..  |   1.177418   .4356867     0.44   0.659     .5701059    2.431675
             |
cancer_exh~t |
  Last year  |    .726029    .155874    -1.49   0.136     .4766572    1.105864
2-5 years..  |   1.006817   .0897718     0.08   0.939     .8453835    1.199077
   5+ years  |   .9866709   .0305659    -0.43   0.665     .9285452    1.048435
             |
cancer_hae~t |
  Last year  |   1.037254   .1839295     0.21   0.837     .7327349    1.468328
2-5 years..  |   .9465789   .0967625    -0.54   0.591     .7747189    1.156564
   5+ years  |   .9884535    .029145    -0.39   0.694     .9329496    1.047259
             |
1.~r_disease |   .9999486    .029052    -0.00   0.999     .9445985    1.058542
1.stroke_d~a |   1.007583   .0309405     0.25   0.806     .9487294    1.070087
1.other_ne~o |   .9974738   .0291205    -0.09   0.931     .9420009    1.056213
             |
reduced_ki~t |
Stage 3a/..  |   1.107294   .0691279     1.63   0.103     .9797668     1.25142
      1.esrd |   .9828013   .0238174    -0.72   0.474     .9372114    1.030609
1.other_tr~t |   1.007589   .0287673     0.26   0.791     .9527546    1.065579
  1.asplenia |   1.015587    .028476     0.55   0.581     .9612813    1.072961
1.ra_sle_p~s |   1.007135   .0284562     0.25   0.801     .9528779    1.064481
1.other_im~o |    .993392   .0297503    -0.22   0.825     .9367607    1.053447
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod0_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod0_2ndVaccCensor.ster saved
(4,919 missing values generated)
(9,075 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     30,217  observations remaining, representing
     30,217  subjects
     24,264  failures in single-failure-per-subject data
  4,739,839  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(50,313 observations (episodes) created)
(cat_time: 50313 changes made)
(covid_tpp_prob: 50313 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       37.52       37.52
          1 |     22,010       27.33       64.85
          2 |     16,278       20.21       85.07
          3 |      8,220       10.21       95.28
          4 |      3,207        3.98       99.26
          5 |        598        0.74      100.00
------------+-----------------------------------
      Total |     80,530      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |     9,986      6,292 |    16,278 
         3 |     4,709      3,511 |     8,220 
         4 |     1,467      1,740 |     3,207 
         5 |       375        223 |       598 
-----------+----------------------+----------
     Total |    56,266     24,264 |    80,530 
(58,524 observations deleted)
   1:      9.92 /        1 =       9.9220

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       22,010             Number of obs    =      22,010
No. of failures      =        5,105
Time at risk         =      1318257
                                                Wald chi2(42)    =       62.64
Log pseudolikelihood =   -38546.666             Prob > chi2      =      0.0210

                       (Std. Err. adjusted for 1,160 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.276986   .4602316     0.68   0.498        .6301    2.587993
 only 12-18  |   1.421736   .6737194     0.74   0.458     .5616413    3.598973
      mixed  |   1.344853   .4299819     0.93   0.354     .7186625    2.516659
             |
        age1 |    1.01276   .0120996     1.06   0.289     .9893204    1.036754
        age2 |   .9043812    .057027    -1.59   0.111     .7992412    1.023352
        age3 |   1.237121   .1549579     1.70   0.089     .9678168     1.58136
      1.male |   .9792593   .0275632    -0.74   0.457     .9266995      1.0348
             |
   obese4cat |
Obese I ..)  |   .9980928   .0419713    -0.05   0.964     .9191293     1.08384
Obese II..)  |   .9985495   .0492135    -0.03   0.977     .9066051    1.099819
Obese II..)  |    1.01513    .063753     0.24   0.811     .8975602    1.148099
             |
smoke_nomiss |
     Former  |   1.118314   .1048349     1.19   0.233     .9306126    1.343874
    Current  |   .9893023   .0436576    -0.24   0.807      .907331    1.078679
             |
         imd |
          4  |   1.070531   .0365594     2.00   0.046     1.001221    1.144639
5 most de..  |   .9640584   .0465613    -0.76   0.449     .8769861    1.059776
             |
tot_adults~h |
          2  |   .2965059   .2132207    -1.69   0.091     .0724311    1.213786
          3  |   .3129971   .1389875    -2.62   0.009     .1310875    .7473419
             |
   ethnicity |
Asian or ..  |   1.041828   .0489875     0.87   0.384     .9501054    1.142405
      Other  |   1.010881   .0463962     0.24   0.814     .9239165    1.106032
             |
1.htdiag_o~p |   1.017102   .0291249     0.59   0.554     .9615903    1.075818
1.~y_disease |   1.071911   .0358495     2.08   0.038     1.003901    1.144529
    1.asthma |   1.086296   .0553922     1.62   0.105     .9829784    1.200474
1.~c_disease |   1.059555   .0382984     1.60   0.110     .9870883    1.137341
             |
     diabcat |
T1DM, con..  |   .8063724   .0799343    -2.17   0.030     .6639838    .9792957
T1DM, unc..  |   .8048478   .1587477    -1.10   0.271     .5467935    1.184689
T2DM, con..  |   1.056808   .0390905     1.49   0.135     .9829033    1.136269
T2DM, unc..  |   1.059034    .076175     0.80   0.425     .9197803    1.219371
Diabetes,..  |   .4620169   .3242282    -1.10   0.271      .116765    1.828113
             |
cancer_exh~t |
  Last year  |   1.096076   .2205218     0.46   0.648     .7389001    1.625907
2-5 years..  |   1.094015   .1159233     0.85   0.396     .8888509    1.346535
   5+ years  |   .9962555    .038518    -0.10   0.923     .9235511    1.074683
             |
cancer_hae~t |
  Last year  |   .9523406   .2229614    -0.21   0.835     .6018794    1.506867
2-5 years..  |   1.289356    .136262     2.40   0.016     1.048132    1.586097
   5+ years  |   1.020298   .0363328     0.56   0.573     .9515148    1.094052
             |
1.~r_disease |   .9483714    .035239    -1.43   0.154     .8817593    1.020016
1.stroke_d~a |   .9952406   .0334875    -0.14   0.887     .9317237    1.063087
1.other_ne~o |   .9895748   .0328599    -0.32   0.752     .9272217    1.056121
             |
reduced_ki~t |
Stage 3a/..  |    .891725   .0701383    -1.46   0.145     .7643284    1.040356
      1.esrd |   .9892641   .0287157    -0.37   0.710     .9345535    1.047178
1.other_tr~t |   .9402734   .0334062    -1.73   0.083      .877026    1.008082
  1.asplenia |   1.031679    .035324     0.91   0.362     .9647169    1.103288
1.ra_sle_p~s |   .9917071   .0345466    -0.24   0.811     .9262567    1.061782
1.other_im~o |   1.025715   .0362246     0.72   0.472     .9571178    1.099229
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod1_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod1_2ndVaccCensor.ster saved
(4,919 missing values generated)
(9,075 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     30,217  observations remaining, representing
     30,217  subjects
     24,264  failures in single-failure-per-subject data
  4,739,839  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(50,313 observations (episodes) created)
(cat_time: 50313 changes made)
(covid_tpp_prob: 50313 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       37.52       37.52
          1 |     22,010       27.33       64.85
          2 |     16,278       20.21       85.07
          3 |      8,220       10.21       95.28
          4 |      3,207        3.98       99.26
          5 |        598        0.74      100.00
------------+-----------------------------------
      Total |     80,530      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |     9,986      6,292 |    16,278 
         3 |     4,709      3,511 |     8,220 
         4 |     1,467      1,740 |     3,207 
         5 |       375        223 |       598 
-----------+----------------------+----------
     Total |    56,266     24,264 |    80,530 
(64,256 observations deleted)
   1:      7.54 /        1 =       7.5350

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,278             Number of obs    =      16,278
No. of failures      =        6,292
Time at risk         =       781651
                                                Wald chi2(42)    =       61.07
Log pseudolikelihood =   -44691.993             Prob > chi2      =      0.0287

                       (Std. Err. adjusted for 1,115 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    .923018   .2389371    -0.31   0.757       .55573    1.533051
 only 12-18  |   1.006921   .3085707     0.02   0.982     .5522617    1.835887
      mixed  |   .8370928   .1816574    -0.82   0.413     .5470845    1.280834
             |
        age1 |   .9796666   .0105732    -1.90   0.057     .9591611     1.00061
        age2 |   1.137089   .0660078     2.21   0.027     1.014804    1.274109
        age3 |   .7641727   .0883903    -2.33   0.020     .6091649    .9586239
      1.male |   1.000238   .0251399     0.01   0.992     .9521585    1.050745
             |
   obese4cat |
Obese I ..)  |   .9455383   .0352429    -1.50   0.133     .8789262    1.017199
Obese II..)  |   .9442677   .0428464    -1.26   0.206     .8639162    1.032092
Obese II..)  |   .9496907   .0538085    -0.91   0.362      .849873    1.061232
             |
smoke_nomiss |
     Former  |   .9677731   .0837699    -0.38   0.705     .8167592    1.146709
    Current  |   .9678019    .038923    -0.81   0.416     .8944435    1.047177
             |
         imd |
          4  |    1.00971    .033005     0.30   0.768     .9470496    1.076515
5 most de..  |   1.019596   .0425989     0.46   0.642     .9394306    1.106602
             |
tot_adults~h |
          2  |   1.170193   .8293881     0.22   0.825     .2917145    4.694147
          3  |   1.057626    .678036     0.09   0.930     .3010465    3.715617
             |
   ethnicity |
Asian or ..  |   .9947843   .0423409    -0.12   0.902     .9151649    1.081331
      Other  |   1.026564   .0408868     0.66   0.510     .9494754    1.109911
             |
1.htdiag_o~p |   1.007121   .0268204     0.27   0.790     .9559027    1.061084
1.~y_disease |   1.012261   .0304188     0.41   0.685     .9543629    1.073671
    1.asthma |    .991837   .0461236    -0.18   0.860     .9054337    1.086485
1.~c_disease |   1.018661    .030818     0.61   0.541      .960015     1.08089
             |
     diabcat |
T1DM, con..  |   .9110292   .0719847    -1.18   0.238     .7803238    1.063628
T1DM, unc..  |   .7866212   .1350886    -1.40   0.162     .5618062    1.101399
T2DM, con..  |   1.009773   .0349431     0.28   0.779     .9435568    1.080636
T2DM, unc..  |   .9200273   .0661355    -1.16   0.246     .7991214    1.059226
Diabetes,..  |   1.474422   .4952452     1.16   0.248     .7633272    2.847953
             |
cancer_exh~t |
  Last year  |   .9189307     .19183    -0.40   0.685     .6103676    1.383484
2-5 years..  |   .8483655   .0909408    -1.53   0.125     .6876037    1.046714
   5+ years  |   .9274482   .0303291    -2.30   0.021     .8698691    .9888385
             |
cancer_hae~t |
  Last year  |   .9566655   .1870382    -0.23   0.821     .6521406    1.403392
2-5 years..  |   .9345802   .1032799    -0.61   0.540     .7525767    1.160599
   5+ years  |   1.094402   .0343555     2.87   0.004     1.029096    1.163852
             |
1.~r_disease |   .9933448   .0330724    -0.20   0.841     .9305939    1.060327
1.stroke_d~a |   .9380446   .0304799    -1.97   0.049     .8801675    .9997275
1.other_ne~o |   1.063352    .032213     2.03   0.043     1.002053      1.1284
             |
reduced_ki~t |
Stage 3a/..  |   .9874681   .0638458    -0.20   0.845     .8699369    1.120878
      1.esrd |   .9941262   .0258108    -0.23   0.820     .9448035    1.046024
1.other_tr~t |    1.06431   .0329358     2.01   0.044     1.001675    1.130861
  1.asplenia |   .9946445   .0307834    -0.17   0.862     .9361036    1.056846
1.ra_sle_p~s |   .9789032   .0318506    -0.66   0.512      .918426    1.043363
1.other_im~o |   .9436168   .0289961    -1.89   0.059      .888463    1.002195
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod2_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod2_2ndVaccCensor.ster saved
(4,919 missing values generated)
(9,075 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     30,217  observations remaining, representing
     30,217  subjects
     24,264  failures in single-failure-per-subject data
  4,739,839  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(50,313 observations (episodes) created)
(cat_time: 50313 changes made)
(covid_tpp_prob: 50313 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       37.52       37.52
          1 |     22,010       27.33       64.85
          2 |     16,278       20.21       85.07
          3 |      8,220       10.21       95.28
          4 |      3,207        3.98       99.26
          5 |        598        0.74      100.00
------------+-----------------------------------
      Total |     80,530      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |     9,986      6,292 |    16,278 
         3 |     4,709      3,511 |     8,220 
         4 |     1,467      1,740 |     3,207 
         5 |       375        223 |       598 
-----------+----------------------+----------
     Total |    56,266     24,264 |    80,530 
(72,314 observations deleted)
   1:      2.75 /        1 =       2.7500

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        8,220             Number of obs    =       8,220
No. of failures      =        3,511
Time at risk         =       264196
                                                Wald chi2(42)    =       40.98
Log pseudolikelihood =   -22218.194             Prob > chi2      =      0.5156

                       (Std. Err. adjusted for 1,016 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .7273289   .2869985    -0.81   0.420      .335624     1.57619
 only 12-18  |   1.382789   .6788895     0.66   0.509     .5282664    3.619587
      mixed  |   .8324928   .2771211    -0.55   0.582     .4335424    1.598562
             |
        age1 |   1.006347   .0152793     0.42   0.677     .9768409    1.036743
        age2 |    .994606   .0778139    -0.07   0.945     .8532112    1.159433
        age3 |   .9964333   .1532841    -0.02   0.981     .7370645    1.347072
      1.male |    1.00957   .0343096     0.28   0.779     .9445154    1.079106
             |
   obese4cat |
Obese I ..)  |   1.019044   .0517591     0.37   0.710     .9224843    1.125712
Obese II..)  |   .9799514   .0596066    -0.33   0.739     .8698198    1.104027
Obese II..)  |   1.041429     .07134     0.59   0.553     .9105848    1.191073
             |
smoke_nomiss |
     Former  |   1.197778   .1348317     1.60   0.109     .9606345    1.493463
    Current  |   .9734544   .0508872    -0.51   0.607     .8786565     1.07848
             |
         imd |
          4  |   1.009401   .0438013     0.22   0.829     .9271013    1.099006
5 most de..  |   .9699927   .0545873    -0.54   0.588      .868693    1.083105
             |
tot_adults~h |
          2  |    .670761   .7279989    -0.37   0.713     .0799339    5.628657
          3  |   .9559384   .8130888    -0.05   0.958      .180479    5.063293
             |
   ethnicity |
Asian or ..  |   .9414001   .0539103    -1.05   0.292     .8414518     1.05322
      Other  |   .9945914   .0576704    -0.09   0.925     .8877457    1.114297
             |
1.htdiag_o~p |   1.000439   .0344659     0.01   0.990      .935117    1.070324
1.~y_disease |   1.005116   .0424529     0.12   0.904     .9252604    1.091863
    1.asthma |   .9149693   .0621976    -1.31   0.191     .8008363    1.045368
1.~c_disease |   .9604479    .041638    -0.93   0.352       .88221    1.045624
             |
     diabcat |
T1DM, con..  |   .7888951   .0852304    -2.19   0.028     .6383479    .9749472
T1DM, unc..  |   1.070784   .2099602     0.35   0.727     .7291178    1.572556
T2DM, con..  |   1.010044   .0467314     0.22   0.829     .9224826    1.105917
T2DM, unc..  |   1.139628   .0977685     1.52   0.128     .9632493    1.348303
Diabetes,..  |   1.323408    .839233     0.44   0.659     .3818637    4.586477
             |
cancer_exh~t |
  Last year  |   1.326167   .3353222     1.12   0.264     .8079258    2.176833
2-5 years..  |   1.236382   .1497408     1.75   0.080     .9751284    1.567629
   5+ years  |    1.02989   .0464782     0.65   0.514     .9427065    1.125135
             |
cancer_hae~t |
  Last year  |   1.301504    .270683     1.27   0.205     .8657954    1.956482
2-5 years..  |   1.064343   .1587503     0.42   0.676     .7945514    1.425742
   5+ years  |   .9821239   .0428047    -0.41   0.679     .9017116    1.069707
             |
1.~r_disease |   1.027274   .0439853     0.63   0.530     .9445823    1.117204
1.stroke_d~a |   .9846079   .0410294    -0.37   0.710      .907388    1.068399
1.other_ne~o |   1.052471   .0441481     1.22   0.223     .9694034    1.142656
             |
reduced_ki~t |
Stage 3a/..  |   .9984426   .0849146    -0.02   0.985     .8451445    1.179547
      1.esrd |   1.013676   .0346994     0.40   0.692     .9478973    1.084019
1.other_tr~t |   .9932787   .0418905    -0.16   0.873     .9144765    1.078871
  1.asplenia |   .9618388    .041745    -0.90   0.370     .8834034    1.047238
1.ra_sle_p~s |   1.122869   .0450494     2.89   0.004     1.037956    1.214728
1.other_im~o |    .964795   .0393018    -0.88   0.379     .8907599    1.044984
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod3_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod3_2ndVaccCensor.ster saved
(4,919 missing values generated)
(9,075 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     30,217  observations remaining, representing
     30,217  subjects
     24,264  failures in single-failure-per-subject data
  4,739,839  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(50,313 observations (episodes) created)
(cat_time: 50313 changes made)
(covid_tpp_prob: 50313 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       37.52       37.52
          1 |     22,010       27.33       64.85
          2 |     16,278       20.21       85.07
          3 |      8,220       10.21       95.28
          4 |      3,207        3.98       99.26
          5 |        598        0.74      100.00
------------+-----------------------------------
      Total |     80,530      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |     9,986      6,292 |    16,278 
         3 |     4,709      3,511 |     8,220 
         4 |     1,467      1,740 |     3,207 
         5 |       375        223 |       598 
-----------+----------------------+----------
     Total |    56,266     24,264 |    80,530 
(77,327 observations deleted)
   1:      1.25 /        1 =       1.2530

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,207             Number of obs    =       3,207
No. of failures      =        1,740
Time at risk         =       131735
                                                Wald chi2(42)    =      489.52
Log pseudolikelihood =   -8932.7491             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 862 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .4238959   .2206493    -1.65   0.099      .152822    1.175798
 only 12-18  |   .2035983   .1625954    -1.99   0.046     .0425596    .9739823
      mixed  |    .360349   .1661044    -2.21   0.027     .1460019    .8893819
             |
        age1 |   .9746928   .0229417    -1.09   0.276     .9307493    1.020711
        age2 |   1.101207   .1347895     0.79   0.431     .8663244    1.399772
        age3 |   .8356798   .2016167    -0.74   0.457     .5208088    1.340915
      1.male |   1.042397   .0521486     0.83   0.407     .9450388    1.149785
             |
   obese4cat |
Obese I ..)  |   .8982761   .0634647    -1.52   0.129     .7821157    1.031689
Obese II..)  |   .8658705      .0738    -1.69   0.091     .7326613    1.023299
Obese II..)  |    .923994   .0949188    -0.77   0.442      .755489    1.130083
             |
smoke_nomiss |
     Former  |   1.024315   .1771677     0.14   0.890     .7298071     1.43767
    Current  |   .8791094   .0742245    -1.53   0.127     .7450316    1.037316
             |
         imd |
          4  |   .9292637   .0560289    -1.22   0.224     .8256894     1.04583
5 most de..  |   1.030963   .0833291     0.38   0.706     .8799201    1.207932
             |
tot_adults~h |
          2  |   1.459722   .6739039     0.82   0.413     .5906079    3.607787
          3  |   .2786107   .1351191    -2.64   0.008     .1076928    .7207903
             |
   ethnicity |
Asian or ..  |   .8998652   .0713502    -1.33   0.183     .7703459    1.051161
      Other  |   1.040063   .0782877     0.52   0.602     .8974043    1.205401
             |
1.htdiag_o~p |   .9856577   .0503568    -0.28   0.777     .8917409    1.089466
1.~y_disease |   1.034837   .0633832     0.56   0.576     .9177754     1.16683
    1.asthma |   1.036925   .0938004     0.40   0.689     .8684555    1.238076
1.~c_disease |   .9921718   .0594522    -0.13   0.896       .88223    1.115814
             |
     diabcat |
T1DM, con..  |   1.126762   .1655336     0.81   0.417     .8448532    1.502737
T1DM, unc..  |   1.482304   .3780519     1.54   0.123     .8991744    2.443603
T2DM, con..  |   .9945444   .0668434    -0.08   0.935      .871796    1.134576
T2DM, unc..  |    .972472   .1215137    -0.22   0.823     .7612311    1.242332
Diabetes,..  |   27.56849   8.260519    11.07   0.000     15.32365    49.59796
             |
cancer_exh~t |
  Last year  |   1.085259   .3569813     0.25   0.804     .5695633    2.067877
2-5 years..  |   1.309855   .2652992     1.33   0.183     .8806844    1.948168
   5+ years  |   1.123734   .0706099     1.86   0.063     .9935234     1.27101
             |
cancer_hae~t |
  Last year  |   .7405274   .3300487    -0.67   0.500     .3091475    1.773849
2-5 years..  |   .9848005   .1979942    -0.08   0.939     .6640704    1.460436
   5+ years  |   .9163364   .0599274    -1.34   0.182      .806097    1.041652
             |
1.~r_disease |    1.01745   .0650249     0.27   0.787     .8976624    1.153222
1.stroke_d~a |   .9213299     .05247    -1.44   0.150     .8240224    1.030128
1.other_ne~o |   1.059196   .0644535     0.95   0.345     .9401117    1.193364
             |
reduced_ki~t |
Stage 3a/..  |   .9359416   .1130058    -0.55   0.583     .7387109    1.185832
      1.esrd |   .9743057   .0475974    -0.53   0.594     .8853434    1.072207
1.other_tr~t |    .935407   .0538314    -1.16   0.246     .8356321    1.047095
  1.asplenia |   .9604916   .0570134    -0.68   0.497     .8550027    1.078996
1.ra_sle_p~s |   .9700056   .0605927    -0.49   0.626     .8582283    1.096341
1.other_im~o |   1.027786   .0573683     0.49   0.623     .9212788    1.146607
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod4_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod4_2ndVaccCensor.ster saved
(4,919 missing values generated)
(9,075 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     30,217  observations remaining, representing
     30,217  subjects
     24,264  failures in single-failure-per-subject data
  4,739,839  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(50,313 observations (episodes) created)
(cat_time: 50313 changes made)
(covid_tpp_prob: 50313 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       37.52       37.52
          1 |     22,010       27.33       64.85
          2 |     16,278       20.21       85.07
          3 |      8,220       10.21       95.28
          4 |      3,207        3.98       99.26
          5 |        598        0.74      100.00
------------+-----------------------------------
      Total |     80,530      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |     9,986      6,292 |    16,278 
         3 |     4,709      3,511 |     8,220 
         4 |     1,467      1,740 |     3,207 
         5 |       375        223 |       598 
-----------+----------------------+----------
     Total |    56,266     24,264 |    80,530 
(79,936 observations deleted)
   1:      0.89 /        1 =       0.8890

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          598             Number of obs    =         598
No. of failures      =          223
Time at risk         =        24089
                                                Wald chi2(38)    =      990.40
Log pseudolikelihood =   -820.92742             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 401 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
 only 12-18  |   2.153913   1.830338     0.90   0.367     .4072862    11.39087
      mixed  |   .4162925   .3123925    -1.17   0.243     .0956409    1.811981
             |
        age1 |   1.132772   .0800024     1.77   0.078     .9863385    1.300944
        age2 |   .5505355   .1945118    -1.69   0.091     .2754509    1.100339
        age3 |   2.946534   2.031898     1.57   0.117      .762662    11.38389
      1.male |   .8561392   .1254573    -1.06   0.289     .6424076     1.14098
             |
   obese4cat |
Obese I ..)  |   .9953975   .1911959    -0.02   0.981     .6831212    1.450425
Obese II..)  |   .7778453   .1792647    -1.09   0.276     .4951339    1.221979
Obese II..)  |   .8135693   .2340084    -0.72   0.473     .4629797    1.429642
             |
smoke_nomiss |
     Former  |   .6915096   .4011238    -0.64   0.525      .221841    2.155532
    Current  |   1.241911   .2475542     1.09   0.277     .8402678    1.835538
             |
         imd |
          4  |   .7922029   .1544301    -1.19   0.232     .5406363    1.160827
5 most de..  |   .9603823   .2230518    -0.17   0.862      .609186    1.514044
             |
3.tot_adul~h |          1  (omitted)
             |
   ethnicity |
Asian or ..  |   1.169893   .2441823     0.75   0.452     .7771086    1.761208
      Other  |   1.022691   .2417837     0.09   0.924     .6434338    1.625491
             |
1.htdiag_o~p |   .9626816   .1479317    -0.25   0.805     .7123307    1.301019
1.~y_disease |   1.523237   .2413633     2.66   0.008     1.116583    2.077993
    1.asthma |   1.087817   .2730696     0.34   0.737     .6650931    1.779217
1.~c_disease |   .9697042   .1706664    -0.17   0.861     .6867982    1.369145
             |
     diabcat |
T1DM, con..  |   1.012927   .3299308     0.04   0.969     .5349639    1.917925
T1DM, unc..  |    .953113    .714526    -0.06   0.949     .2192901     4.14257
T2DM, con..  |   1.058073   .2449215     0.24   0.807     .6721723    1.665523
T2DM, unc..  |   1.038261   .4196549     0.09   0.926     .4701745    2.292735
             |
cancer_exh~t |
  Last year  |   5.82e-14   6.19e-14   -28.62   0.000     7.22e-15    4.69e-13
2-5 years..  |   .9898299    .869549    -0.01   0.991      .176927    5.537668
   5+ years  |   .9492164    .207938    -0.24   0.812     .6178722     1.45825
             |
cancer_hae~t |
  Last year  |   1.420784   1.197095     0.42   0.677     .2724836    7.408252
2-5 years..  |   .2528044    .284406    -1.22   0.222     .0278727    2.292926
   5+ years  |   .6873311   .1328045    -1.94   0.052     .4706508    1.003768
             |
1.~r_disease |   1.152524   .2067572     0.79   0.429     .8108652    1.638142
1.stroke_d~a |   .8624526   .1542419    -0.83   0.408      .607443    1.224517
1.other_ne~o |   1.127793   .1992173     0.68   0.496     .7977563    1.594368
             |
reduced_ki~t |
Stage 3a/..  |   1.824029    .466933     2.35   0.019     1.104416    3.012526
      1.esrd |   1.152043   .1673357     0.97   0.330     .8666239    1.531464
1.other_tr~t |   .8156446    .140534    -1.18   0.237     .5818895    1.143303
  1.asplenia |   .9011834   .1554648    -0.60   0.546     .6426445    1.263734
1.ra_sle_p~s |   1.171634   .2053498     0.90   0.366     .8310054    1.651887
1.other_im~o |   .9126147   .1726453    -0.48   0.629     .6298834    1.322254
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod5_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod5_2ndVaccCensor.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_tpp_prob_2nd
> VaccCensor.log
  log type:  text
 closed on:  15 Mar 2023, 14:01:10
-------------------------------------------------------------------------------
