-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_death_2ndVac
> cCensor.log
  log type:  text
 opened on:  15 Mar 2023, 13:57:48

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. forvalues period=0/5 {
  3. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  4. 
. *Censor at date of second vacc_7ds
. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
  5. replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>s
> econd_vacc_plus_7d
  6. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7.         
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. *Omicron period +7 days: 27th December 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  8. stsplit cat_time, at(0,85,154, 216, 263, 372, 500)
  9. recode cat_time 85=1 154=2 216=3 263=4 372=5
 10. recode `outcome' .=0 
 11. tab cat_time
 12. tab cat_time `outcome'
 13. }
 14. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. *Omicron period +14 days: 3rd January 2022
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 15. stsplit cat_time, at(0,92,161,222,270, 379, 500)
 16. recode cat_time 92=1 161=2 222=3 270=4 379=5
 17. recode `outcome' .=0 
 18. tab cat_time
 19. tab cat_time `outcome'
 20. }
 21. keep if cat_time==`period'
 22. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 23. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 24. if _rc==0{
 25. estimates
 26. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'_2ndVaccCensor", replace
 27.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 28. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 29. 
. }
 30. }
 31. }
(17,201 missing values generated)
(57,045 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    107,226  observations remaining, representing
    107,226  subjects
     43,423  failures in single-failure-per-subject data
   21892543  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(242,950 observations (episodes) created)
(cat_time: 242950 changes made)
(covid_death: 242950 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       30.62       30.62
          1 |     91,677       26.18       56.80
          2 |     79,998       22.85       79.65
          3 |     45,094       12.88       92.52
          4 |     19,212        5.49       98.01
          5 |      6,969        1.99      100.00
------------+-----------------------------------
      Total |    350,176      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    66,477     13,521 |    79,998 
         3 |    36,500      8,594 |    45,094 
         4 |    15,016      4,196 |    19,212 
         5 |     6,185        784 |     6,969 
-----------+----------------------+----------
     Total |   306,753     43,423 |   350,176 
(242,962 observations deleted)
   1:     37.31 /        1 =      37.3130

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      107,226             Number of obs    =     107,226
No. of failures      =        9,293
Time at risk         =      9163046
                                                Wald chi2(42)    =       43.33
Log pseudolikelihood =   -85522.248             Prob > chi2      =      0.4146

                       (Std. Err. adjusted for 1,373 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9995166   .2278458    -0.00   0.998     .6393718    1.562523
 only 12-18  |   1.214454   .3397574     0.69   0.487     .7018555    2.101428
      mixed  |    1.10835    .214206     0.53   0.595      .758873     1.61877
             |
        age1 |   .9989471   .0039239    -0.27   0.789     .9912859    1.006668
        age2 |   .9988082   .0124858    -0.10   0.924     .9746338    1.023582
        age3 |   1.009316   .0361336     0.26   0.796     .9409225     1.08268
      1.male |   1.017558   .0219073     0.81   0.419     .9755143    1.061415
             |
   obese4cat |
Obese I ..)  |   .9956515   .0300358    -0.14   0.885     .9384889    1.056296
Obese II..)  |   .9859023   .0381314    -0.37   0.714     .9139285    1.063544
Obese II..)  |   1.069613   .0438074     1.64   0.100     .9871075    1.159014
             |
smoke_nomiss |
     Former  |   1.037063   .0743312     0.51   0.612     .9011473    1.193479
    Current  |   .9419902   .0298402    -1.89   0.059     .8852831     1.00233
             |
         imd |
          4  |    .995926   .0259125    -0.16   0.875     .9464117    1.048031
5 most de..  |   .9803607   .0336808    -0.58   0.564     .9165209    1.048647
             |
tot_adults~h |
          2  |   .5892568   .2737801    -1.14   0.255      .237039    1.464837
          3  |   .5882004   .2063535    -1.51   0.130     .2957367    1.169891
             |
   ethnicity |
Asian or ..  |   .9705998   .0327314    -0.88   0.376     .9085217     1.03692
      Other  |   1.059712    .036441     1.69   0.092     .9906427    1.133597
             |
1.htdiag_o~p |   1.004336   .0229454     0.19   0.850     .9603562    1.050331
1.~y_disease |   1.031674   .0268941     1.20   0.232     .9802865    1.085755
    1.asthma |   .9903209   .0349249    -0.28   0.783     .9241815    1.061193
1.~c_disease |   1.026953   .0258299     1.06   0.290     .9775552    1.078848
             |
     diabcat |
T1DM, con..  |   .9986154   .0677605    -0.02   0.984     .8742597     1.14066
T1DM, unc..  |   .8615111    .131536    -0.98   0.329      .638703    1.162045
T2DM, con..  |   1.019589   .0285473     0.69   0.488     .9651447    1.077104
T2DM, unc..  |   1.125032   .0578567     2.29   0.022     1.017163    1.244341
Diabetes,..  |   1.634456   .4499697     1.78   0.074     .9528733    2.803568
             |
cancer_exh~t |
  Last year  |   1.299877    .202113     1.69   0.092     .9584123    1.763001
2-5 years..  |   1.065018   .0873502     0.77   0.442     .9068664     1.25075
   5+ years  |   1.009045   .0278282     0.33   0.744      .955951    1.065089
             |
cancer_hae~t |
  Last year  |    1.03797   .1635748     0.24   0.813     .7621542      1.4136
2-5 years..  |   .9780575   .0886473    -0.24   0.807     .8188696    1.168191
   5+ years  |   .9952837   .0275189    -0.17   0.864      .942783    1.050708
             |
1.~r_disease |   1.039034   .0252195     1.58   0.115     .9907619    1.089658
1.stroke_d~a |   .9969842   .0268356    -0.11   0.911     .9457507    1.050993
1.other_ne~o |    1.03722   .0268481     1.41   0.158     .9859115    1.091199
             |
reduced_ki~t |
Stage 3a/..  |    .889021   .1603899    -0.65   0.514     .6242308    1.266132
      1.esrd |   .9871599   .0208185    -0.61   0.540     .9471882    1.028818
1.other_tr~t |   .9738137   .0250094    -1.03   0.301     .9260093    1.024086
  1.asplenia |   .9788675   .0255276    -0.82   0.413     .9300915    1.030202
1.ra_sle_p~s |   1.009005   .0245133     0.37   0.712      .962086    1.058213
1.other_im~o |   1.025319   .0266332     0.96   0.336     .9744251     1.07887
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod0_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod0_2ndVaccCensor.ster saved
(17,201 missing values generated)
(57,045 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    107,226  observations remaining, representing
    107,226  subjects
     43,423  failures in single-failure-per-subject data
   21892543  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(242,950 observations (episodes) created)
(cat_time: 242950 changes made)
(covid_death: 242950 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       30.62       30.62
          1 |     91,677       26.18       56.80
          2 |     79,998       22.85       79.65
          3 |     45,094       12.88       92.52
          4 |     19,212        5.49       98.01
          5 |      6,969        1.99      100.00
------------+-----------------------------------
      Total |    350,176      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    66,477     13,521 |    79,998 
         3 |    36,500      8,594 |    45,094 
         4 |    15,016      4,196 |    19,212 
         5 |     6,185        784 |     6,969 
-----------+----------------------+----------
     Total |   306,753     43,423 |   350,176 
(258,511 observations deleted)
   1:     27.97 /        1 =      27.9670

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       91,677             Number of obs    =      91,677
No. of failures      =        7,035
Time at risk         =      5926371
                                                Wald chi2(42)    =       43.02
Log pseudolikelihood =   -63704.998             Prob > chi2      =      0.4272

                       (Std. Err. adjusted for 1,354 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.068512   .2784792     0.25   0.799     .6411157     1.78083
 only 12-18  |   2.010089   .5886276     2.38   0.017     1.132276    3.568439
      mixed  |   1.079792   .2463069     0.34   0.736     .6905198    1.688512
             |
        age1 |   1.006603   .0045951     1.44   0.149     .9976373     1.01565
        age2 |   .9787608   .0141642    -1.48   0.138     .9513896     1.00692
        age3 |   1.071585   .0439741     1.68   0.092     .9887719    1.161333
      1.male |   1.015309   .0241597     0.64   0.523     .9690442    1.063783
             |
   obese4cat |
Obese I ..)  |   .9712941   .0353531    -0.80   0.424     .9044171    1.043116
Obese II..)  |   1.004459   .0434931     0.10   0.918     .9227315    1.093426
Obese II..)  |   1.077324    .053018     1.51   0.130      .978265    1.186414
             |
smoke_nomiss |
     Former  |   1.113147   .0865539     1.38   0.168     .9557986    1.296398
    Current  |   .9888659   .0351267    -0.32   0.753     .9223608    1.060166
             |
         imd |
          4  |   .9987452   .0294145    -0.04   0.966     .9427263    1.058093
5 most de..  |   .9962204   .0392721    -0.10   0.923     .9221471    1.076244
             |
tot_adults~h |
          2  |   1.157016   .8363729     0.20   0.840     .2805632    4.771424
          3  |   1.619989    .937279     0.83   0.404     .5212323    5.034922
             |
   ethnicity |
Asian or ..  |   .9395677   .0394051    -1.49   0.137     .8654242    1.020063
      Other  |   1.004295   .0396044     0.11   0.913     .9295961    1.084997
             |
1.htdiag_o~p |   .9920506   .0248948    -0.32   0.750     .9444381    1.042063
1.~y_disease |   1.023678   .0313465     0.76   0.445     .9640476    1.086997
    1.asthma |   1.033866   .0437652     0.79   0.431     .9515499    1.123303
1.~c_disease |   .9629023   .0288379    -1.26   0.207      .908008    1.021115
             |
     diabcat |
T1DM, con..  |   1.059357   .0771369     0.79   0.428     .9184639    1.221863
T1DM, unc..  |   1.083131   .1810762     0.48   0.633     .7805097    1.503085
T2DM, con..  |   .9812181   .0325782    -0.57   0.568     .9193991    1.047194
T2DM, unc..  |   .9951436   .0627504    -0.08   0.938     .8794515    1.126055
Diabetes,..  |   1.020714   .4187974     0.05   0.960     .4567274    2.281134
             |
cancer_exh~t |
  Last year  |   .9456501   .1822082    -0.29   0.772     .6482174    1.379559
2-5 years..  |   1.075407   .1033364     0.76   0.449     .8908006    1.298271
   5+ years  |   1.024799   .0320555     0.78   0.434     .9638585    1.089593
             |
cancer_hae~t |
  Last year  |   .9010732   .1845051    -0.51   0.611     .6032075    1.346026
2-5 years..  |   .9736143   .0924058    -0.28   0.778     .8083499    1.172667
   5+ years  |   1.013999   .0312255     0.45   0.652     .9546083    1.077084
             |
1.~r_disease |   1.009116   .0293452     0.31   0.755     .9532083    1.068302
1.stroke_d~a |   1.036412   .0306732     1.21   0.227     .9780041    1.098308
1.other_ne~o |    1.00997    .029654     0.34   0.735     .9534903    1.069796
             |
reduced_ki~t |
Stage 3a/..  |   1.116491   .2158671     0.57   0.569     .7643285     1.63091
      1.esrd |   1.014335   .0255957     0.56   0.573     .9653885    1.065763
1.other_tr~t |   .9925054   .0313898    -0.24   0.812     .9328505    1.055975
  1.asplenia |   1.026139   .0291263     0.91   0.363     .9706115    1.084843
1.ra_sle_p~s |   .9470753   .0272726    -1.89   0.059     .8951024    1.002066
1.other_im~o |   .9706002   .0290739    -1.00   0.319     .9152569     1.02929
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod1_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod1_2ndVaccCensor.ster saved
(17,201 missing values generated)
(57,045 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    107,226  observations remaining, representing
    107,226  subjects
     43,423  failures in single-failure-per-subject data
   21892543  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(242,950 observations (episodes) created)
(cat_time: 242950 changes made)
(covid_death: 242950 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       30.62       30.62
          1 |     91,677       26.18       56.80
          2 |     79,998       22.85       79.65
          3 |     45,094       12.88       92.52
          4 |     19,212        5.49       98.01
          5 |      6,969        1.99      100.00
------------+-----------------------------------
      Total |    350,176      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    66,477     13,521 |    79,998 
         3 |    36,500      8,594 |    45,094 
         4 |    15,016      4,196 |    19,212 
         5 |     6,185        784 |     6,969 
-----------+----------------------+----------
     Total |   306,753     43,423 |   350,176 
(270,190 observations deleted)
   1:     20.98 /        1 =      20.9770

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       79,998             Number of obs    =      79,998
No. of failures      =       13,521
Time at risk         =      3936311
                                                Wald chi2(42)    =       37.90
Log pseudolikelihood =   -118201.06             Prob > chi2      =      0.6515

                       (Std. Err. adjusted for 1,342 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.303887   .2711049     1.28   0.202     .8674762    1.959847
 only 12-18  |   1.067304   .2569101     0.27   0.787       .66588    1.710726
      mixed  |   .9906264   .1912281    -0.05   0.961     .6785721    1.446185
             |
        age1 |   .9964363   .0030744    -1.16   0.247     .9904287     1.00248
        age2 |   1.013545   .0099776     1.37   0.172     .9941764     1.03329
        age3 |   .9637015   .0271198    -1.31   0.189      .911987    1.018349
      1.male |   .9886406   .0171366    -0.66   0.510     .9556175    1.022805
             |
   obese4cat |
Obese I ..)  |   1.008899    .024974     0.36   0.720     .9611197    1.059054
Obese II..)  |   .9691727   .0313965    -0.97   0.334     .9095494    1.032704
Obese II..)  |    .971503   .0373386    -0.75   0.452     .9010092    1.047512
             |
smoke_nomiss |
     Former  |   1.053203   .0657265     0.83   0.406     .9319486    1.190235
    Current  |   .9968597   .0263767    -0.12   0.905       .94648    1.049921
             |
         imd |
          4  |   1.007549   .0225631     0.34   0.737     .9642822    1.052756
5 most de..  |   1.009054   .0293564     0.31   0.757     .9531264    1.068264
             |
tot_adults~h |
          2  |   .8983208   .4298171    -0.22   0.823     .3516895    2.294582
          3  |   1.222881   .4496682     0.55   0.584     .5948223    2.514093
             |
   ethnicity |
Asian or ..  |   1.000741   .0287336     0.03   0.979     .9459798    1.058673
      Other  |   1.018974   .0291362     0.66   0.511      .963439     1.07771
             |
1.htdiag_o~p |   1.025713   .0188497     1.38   0.167     .9894262    1.063332
1.~y_disease |    .966248    .020642    -1.61   0.108     .9266258    1.007565
    1.asthma |   1.061232   .0326933     1.93   0.054       .99905    1.127283
1.~c_disease |   .9770093   .0219357    -1.04   0.300     .9349485    1.020962
             |
     diabcat |
T1DM, con..  |   .9451172   .0551855    -0.97   0.334     .8429152    1.059711
T1DM, unc..  |   .9664596    .120094    -0.27   0.784     .7575511    1.232979
T2DM, con..  |    1.00971   .0241344     0.40   0.686     .9634986    1.058138
T2DM, unc..  |   1.035769   .0478575     0.76   0.447     .9460917    1.133946
Diabetes,..  |   1.299259   .3690997     0.92   0.357       .74453    2.267301
             |
cancer_exh~t |
  Last year  |   1.090269   .1485803     0.63   0.526     .8347053     1.42408
2-5 years..  |   1.049458   .0706119     0.72   0.473     .9197985    1.197395
   5+ years  |   1.027435   .0228826     1.22   0.224     .9835507    1.073277
             |
cancer_hae~t |
  Last year  |   .9182814   .1300843    -0.60   0.547     .6956552    1.212153
2-5 years..  |    .944525   .0701757    -0.77   0.442     .8165287    1.092586
   5+ years  |   1.005162   .0221991     0.23   0.816     .9625803    1.049626
             |
1.~r_disease |   1.015927   .0224954     0.71   0.475     .9727797    1.060988
1.stroke_d~a |   1.021112   .0215443     0.99   0.322     .9797472    1.064224
1.other_ne~o |   .9816388   .0221132    -0.82   0.411     .9392406    1.025951
             |
reduced_ki~t |
Stage 3a/..  |   1.046049    .137324     0.34   0.732     .8087372    1.352996
      1.esrd |   .9988311   .0179699    -0.07   0.948     .9642246     1.03468
1.other_tr~t |   1.007393   .0225129     0.33   0.742     .9642206    1.052498
  1.asplenia |   .9738994   .0205788    -1.25   0.211     .9343894     1.01508
1.ra_sle_p~s |   .9911353    .021006    -0.42   0.674     .9508077    1.033173
1.other_im~o |   .9822646   .0213323    -0.82   0.410     .9413315    1.024978
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod2_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod2_2ndVaccCensor.ster saved
(17,201 missing values generated)
(57,045 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    107,226  observations remaining, representing
    107,226  subjects
     43,423  failures in single-failure-per-subject data
   21892543  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(242,950 observations (episodes) created)
(cat_time: 242950 changes made)
(covid_death: 242950 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       30.62       30.62
          1 |     91,677       26.18       56.80
          2 |     79,998       22.85       79.65
          3 |     45,094       12.88       92.52
          4 |     19,212        5.49       98.01
          5 |      6,969        1.99      100.00
------------+-----------------------------------
      Total |    350,176      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    66,477     13,521 |    79,998 
         3 |    36,500      8,594 |    45,094 
         4 |    15,016      4,196 |    19,212 
         5 |     6,185        784 |     6,969 
-----------+----------------------+----------
     Total |   306,753     43,423 |   350,176 
(305,094 observations deleted)
   1:     10.34 /        1 =      10.3440

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       45,094             Number of obs    =      45,094
No. of failures      =        8,594
Time at risk         =      1538184
                                                Wald chi2(42)    =       51.84
Log pseudolikelihood =    -69320.12             Prob > chi2      =      0.1421

                       (Std. Err. adjusted for 1,267 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.367572   .3514497     1.22   0.223     .8264217    2.263075
 only 12-18  |   .7330322   .2832742    -0.80   0.422      .343703    1.563374
      mixed  |   1.314555   .3197009     1.12   0.261     .8161422    2.117345
             |
        age1 |   .9951222   .0040603    -1.20   0.231     .9871958    1.003112
        age2 |   1.012744   .0129955     0.99   0.324     .9875912    1.038538
        age3 |   .9634065   .0355375    -1.01   0.312     .8962124    1.035638
      1.male |   .9814694   .0205203    -0.89   0.371     .9420633    1.022524
             |
   obese4cat |
Obese I ..)  |   1.055527   .0325778     1.75   0.080     .9935689     1.12135
Obese II..)  |    1.02978   .0404685     0.75   0.455     .9534413    1.112232
Obese II..)  |   .9694442    .047922    -0.63   0.530     .8799252     1.06807
             |
smoke_nomiss |
     Former  |   .9617358   .0740335    -0.51   0.612     .8270488    1.118357
    Current  |   1.095475   .0347448     2.88   0.004      1.02945    1.165735
             |
         imd |
          4  |   1.002763   .0278059     0.10   0.921      .949719     1.05877
5 most de..  |   1.022884   .0376914     0.61   0.539     .9516152    1.099491
             |
tot_adults~h |
          2  |   1.008754   .4518848     0.02   0.984     .4192549    2.427126
          3  |   .5225278    .210349    -1.61   0.107     .2373829    1.150189
             |
   ethnicity |
Asian or ..  |   1.044243   .0373359     1.21   0.226     .9735708    1.120045
      Other  |   1.009506   .0361804     0.26   0.792      .941027    1.082968
             |
1.htdiag_o~p |   .9907803   .0228508    -0.40   0.688     .9469908    1.036595
1.~y_disease |   1.033831   .0282317     1.22   0.223     .9799526    1.090672
    1.asthma |   .9976351   .0399417    -0.06   0.953     .9223435    1.079073
1.~c_disease |   .9420184   .0263735    -2.13   0.033     .8917199    .9951541
             |
     diabcat |
T1DM, con..  |   1.022625   .0710121     0.32   0.747     .8925001    1.171722
T1DM, unc..  |    1.15659   .1603124     1.05   0.294     .8814468    1.517618
T2DM, con..  |   1.016946   .0296878     0.58   0.565     .9603919     1.07683
T2DM, unc..  |   1.006615   .0568666     0.12   0.907     .9011073    1.124476
Diabetes,..  |   .7015075   .3568065    -0.70   0.486     .2588733     1.90098
             |
cancer_exh~t |
  Last year  |   1.189867   .1905931     1.09   0.278     .8692666    1.628711
2-5 years..  |    1.05535   .0918497     0.62   0.536     .8898452    1.251638
   5+ years  |   .9958344   .0287996    -0.14   0.885     .9409582    1.053911
             |
cancer_hae~t |
  Last year  |   1.010057   .1765644     0.06   0.954     .7170516    1.422792
2-5 years..  |   1.107541   .0912659     1.24   0.215     .9423607    1.301674
   5+ years  |   1.012136   .0283568     0.43   0.667     .9580562    1.069269
             |
1.~r_disease |   1.017982   .0276024     0.66   0.511     .9652947    1.073545
1.stroke_d~a |   1.000283   .0279721     0.01   0.992     .9469338    1.056637
1.other_ne~o |   1.011296   .0280285     0.41   0.685     .9578263     1.06775
             |
reduced_ki~t |
Stage 3a/..  |   .9169299    .171776    -0.46   0.643     .6351459    1.323728
      1.esrd |   1.007688   .0227287     0.34   0.734     .9641104    1.053234
1.other_tr~t |   .9715499   .0272729    -1.03   0.304     .9195398    1.026502
  1.asplenia |   1.050251   .0283625     1.82   0.069     .9961073    1.107338
1.ra_sle_p~s |   .9535824   .0268267    -1.69   0.091     .9024263    1.007638
1.other_im~o |   .9962043   .0273385    -0.14   0.890     .9440373    1.051254
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod3_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod3_2ndVaccCensor.ster saved
(17,201 missing values generated)
(57,045 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    107,226  observations remaining, representing
    107,226  subjects
     43,423  failures in single-failure-per-subject data
   21892543  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(242,950 observations (episodes) created)
(cat_time: 242950 changes made)
(covid_death: 242950 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       30.62       30.62
          1 |     91,677       26.18       56.80
          2 |     79,998       22.85       79.65
          3 |     45,094       12.88       92.52
          4 |     19,212        5.49       98.01
          5 |      6,969        1.99      100.00
------------+-----------------------------------
      Total |    350,176      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    66,477     13,521 |    79,998 
         3 |    36,500      8,594 |    45,094 
         4 |    15,016      4,196 |    19,212 
         5 |     6,185        784 |     6,969 
-----------+----------------------+----------
     Total |   306,753     43,423 |   350,176 
(330,976 observations deleted)
   1:      5.00 /        1 =       5.0000

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       19,212             Number of obs    =      19,212
No. of failures      =        4,196
Time at risk         =      1018993
                                                Wald chi2(42)    =       34.87
Log pseudolikelihood =   -29689.208             Prob > chi2      =      0.7742

                       (Std. Err. adjusted for 1,141 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9678549   .2862467    -0.11   0.912      .542081     1.72805
 only 12-18  |   .3618051   .2032832    -1.81   0.070     .1202874    1.088252
      mixed  |   .9964556   .2545831    -0.01   0.989     .6039286    1.644108
             |
        age1 |   .9888288   .0055918    -1.99   0.047     .9779296    .9998495
        age2 |   1.039827   .0185899     2.18   0.029     1.004023    1.076909
        age3 |   .8959575   .0456411    -2.16   0.031     .8108233    .9900306
      1.male |   1.059694   .0334993     1.83   0.067     .9960297    1.127429
             |
   obese4cat |
Obese I ..)  |   1.056611   .0471564     1.23   0.217     .9681135    1.153199
Obese II..)  |   1.006539   .0556768     0.12   0.906     .9031222    1.121799
Obese II..)  |   1.023677   .0669008     0.36   0.720     .9006041    1.163568
             |
smoke_nomiss |
     Former  |   1.048608    .110899     0.45   0.654     .8522981    1.290134
    Current  |   1.043422   .0502865     0.88   0.378     .9493742    1.146787
             |
         imd |
          4  |   .9758569   .0369965    -0.64   0.519     .9059736    1.051131
5 most de..  |   .9930934    .053041    -0.13   0.897     .8943913    1.102688
             |
tot_adults~h |
          2  |   1.113767   1.194278     0.10   0.920     .1361637    9.110184
          3  |   1.394511   1.295757     0.36   0.720     .2256831    8.616778
             |
   ethnicity |
Asian or ..  |   .9325151   .0502086    -1.30   0.194     .8391225    1.036302
      Other  |   .9387457   .0483869    -1.23   0.220     .8485422    1.038538
             |
1.htdiag_o~p |   1.025917   .0335907     0.78   0.435      .962148    1.093912
1.~y_disease |   .9932741   .0391391    -0.17   0.864     .9194503    1.073025
    1.asthma |   1.059506   .0584911     1.05   0.295     .9508501    1.180579
1.~c_disease |   .9813849   .0370376    -0.50   0.619     .9114123     1.05673
             |
     diabcat |
T1DM, con..  |    1.01719   .0978535     0.18   0.859     .8423964    1.228252
T1DM, unc..  |    .829046   .1865718    -0.83   0.405     .5333605    1.288654
T2DM, con..  |   1.093449     .04436     2.20   0.028     1.009871    1.183943
T2DM, unc..  |   1.037305   .0870349     0.44   0.662     .8800075    1.222718
Diabetes,..  |   .9350473   .6476329    -0.10   0.923      .240588    3.634069
             |
cancer_exh~t |
  Last year  |   1.200103   .2963891     0.74   0.460     .7396014     1.94733
2-5 years..  |   1.038115   .1274541     0.30   0.761      .816093    1.320539
   5+ years  |   1.029059   .0419945     0.70   0.483     .9499565    1.114748
             |
cancer_hae~t |
  Last year  |    .900355   .2002812    -0.47   0.637     .5821926     1.39239
2-5 years..  |   .9149902   .1192336    -0.68   0.495     .7087535    1.181239
   5+ years  |   1.041661   .0403763     1.05   0.292     .9654562    1.123881
             |
1.~r_disease |   .9812453     .03943    -0.47   0.638     .9069288    1.061652
1.stroke_d~a |   1.038333   .0388166     1.01   0.314     .9649745    1.117269
1.other_ne~o |   1.013595   .0384848     0.36   0.722     .9409043    1.091901
             |
reduced_ki~t |
Stage 3a/..  |   1.299527   .3480391     0.98   0.328      .768806    2.196615
      1.esrd |   .9628499   .0310973    -1.17   0.241     .9037893     1.02577
1.other_tr~t |   .9845947   .0403009    -0.38   0.704     .9086918    1.066838
  1.asplenia |   .9887299   .0355167    -0.32   0.752     .9215124     1.06085
1.ra_sle_p~s |   .9932741    .036988    -0.18   0.856     .9233614     1.06848
1.other_im~o |   .9998999   .0379453    -0.00   0.998      .928227    1.077107
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod4_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod4_2ndVaccCensor.ster saved
(17,201 missing values generated)
(57,045 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    107,226  observations remaining, representing
    107,226  subjects
     43,423  failures in single-failure-per-subject data
   21892543  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(242,950 observations (episodes) created)
(cat_time: 242950 changes made)
(covid_death: 242950 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       30.62       30.62
          1 |     91,677       26.18       56.80
          2 |     79,998       22.85       79.65
          3 |     45,094       12.88       92.52
          4 |     19,212        5.49       98.01
          5 |      6,969        1.99      100.00
------------+-----------------------------------
      Total |    350,176      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    66,477     13,521 |    79,998 
         3 |    36,500      8,594 |    45,094 
         4 |    15,016      4,196 |    19,212 
         5 |     6,185        784 |     6,969 
-----------+----------------------+----------
     Total |   306,753     43,423 |   350,176 
(343,219 observations deleted)
   1:      6.40 /        1 =       6.3990

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        6,969             Number of obs    =       6,969
No. of failures      =          784
Time at risk         =       309638
                                                Wald chi2(41)    =     3980.97
Log pseudolikelihood =   -5041.0015             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 992 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.087007   4.718909     0.33   0.745     .0248246    175.4552
 only 12-18  |   1.744706   4.964163     0.20   0.845     .0066042    460.9171
      mixed  |   3.360468    7.94409     0.51   0.608     .0326719    345.6414
             |
        age1 |   .9863984    .014323    -0.94   0.346     .9587215    1.014874
        age2 |    1.06838   .0474512     1.49   0.136     .9793106    1.165551
        age3 |   .8026224    .100925    -1.75   0.080     .6273035    1.026939
      1.male |   1.043792   .0744176     0.60   0.548     .9076683     1.20033
             |
   obese4cat |
Obese I ..)  |   .9564334   .1013901    -0.42   0.674     .7769983    1.177306
Obese II..)  |   .8705171   .1138135    -1.06   0.289     .6737351    1.124774
Obese II..)  |   .9727519   .1554909    -0.17   0.863     .7111163    1.330649
             |
smoke_nomiss |
     Former  |   1.185789   .2887917     0.70   0.484     .7357028    1.911228
    Current  |   .8181395   .0959387    -1.71   0.087      .650147     1.02954
             |
         imd |
          4  |   1.065199   .0928951     0.72   0.469     .8978387    1.263756
5 most de..  |   1.062406   .1305982     0.49   0.622     .8349399    1.351843
             |
tot_adults~h |
          2  |   5.87e+08          .        .       .            .           .
          3  |   1.46e+08   3.43e+08     8.04   0.000      1493646    1.44e+10
             |
   ethnicity |
Asian or ..  |   .9275853   .1107897    -0.63   0.529     .7339853     1.17225
      Other  |   1.062147   .1219004     0.53   0.599     .8481921    1.330073
             |
1.htdiag_o~p |   1.069132    .079512     0.90   0.369      .924117    1.236903
1.~y_disease |   1.020934   .0958525     0.22   0.825     .8493384    1.227197
    1.asthma |   1.161621   .1466505     1.19   0.235     .9069918    1.487735
1.~c_disease |   1.049563   .0893316     0.57   0.570     .8883011    1.240101
             |
     diabcat |
T1DM, con..  |   .7221313   .1847767    -1.27   0.203     .4373341    1.192392
T1DM, unc..  |   .4993663   .3594129    -0.96   0.335     .1218364    2.046733
T2DM, con..  |   .9122806   .0952889    -0.88   0.379     .7433944    1.119535
T2DM, unc..  |   1.101253   .1966924     0.54   0.589     .7759899    1.562854
Diabetes,..  |   2.65e-13   1.58e-13   -48.59   0.000     8.26e-14    8.54e-13
             |
cancer_exh~t |
  Last year  |   1.669379    .870055     0.98   0.325     .6010654    4.636478
2-5 years..  |   .7280624   .2265184    -1.02   0.308     .3956749    1.339673
   5+ years  |   .9826497   .0934489    -0.18   0.854     .8155497    1.183987
             |
cancer_hae~t |
  Last year  |   .8168845   .4159516    -0.40   0.691     .3011169    2.216084
2-5 years..  |   .5576682   .1974323    -1.65   0.099     .2786271    1.116165
   5+ years  |   .9251354   .0910647    -0.79   0.429     .7628132    1.121999
             |
1.~r_disease |   1.029297   .0907219     0.33   0.743     .8659962    1.223391
1.stroke_d~a |   1.102584   .0927619     1.16   0.246     .9349727    1.300243
1.other_ne~o |    .949482   .0869457    -0.57   0.571     .7934887    1.136142
             |
reduced_ki~t |
Stage 3a/..  |   1.436682   .8658599     0.60   0.548     .4409182    4.681263
      1.esrd |   .9937909   .0737245    -0.08   0.933     .8593075    1.149321
1.other_tr~t |   1.123069   .0968156     1.35   0.178     .9484785    1.329797
  1.asplenia |   1.020472   .0927132     0.22   0.823     .8540173     1.21937
1.ra_sle_p~s |   .9579571   .0851575    -0.48   0.629     .8047826    1.140285
1.other_im~o |   1.059223   .0916954     0.66   0.506     .8939231     1.25509
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod5_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod5_2ndVaccCensor.ster saved
(4,919 missing values generated)
(15,928 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     30,217  observations remaining, representing
     30,217  subjects
     12,316  failures in single-failure-per-subject data
  6,169,196  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(68,455 observations (episodes) created)
(cat_time: 68455 changes made)
(covid_death: 68455 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       30.62       30.62
          1 |     25,850       26.20       56.82
          2 |     22,519       22.82       79.64
          3 |     12,704       12.87       92.52
          4 |      5,427        5.50       98.02
          5 |      1,955        1.98      100.00
------------+-----------------------------------
      Total |     98,672      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    18,664      3,855 |    22,519 
         3 |    10,356      2,348 |    12,704 
         4 |     4,229      1,198 |     5,427 
         5 |     1,737        218 |     1,955 
-----------+----------------------+----------
     Total |    86,356     12,316 |    98,672 
(68,459 observations deleted)
   1:     18.18 /        1 =      18.1800

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       30,217             Number of obs    =      30,217
No. of failures      =        2,683
Time at risk         =      2582909
                                                Wald chi2(41)    =     1578.08
Log pseudolikelihood =   -21276.856             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,204 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8302996   .3066547    -0.50   0.615     .4025876    1.712416
 only 12-18  |   1.453598   .6686283     0.81   0.416     .5900748    3.580811
      mixed  |   .7227443    .238749    -0.98   0.326     .3782696    1.380918
             |
        age1 |   1.023243   .0180466     1.30   0.193     .9884767    1.059232
        age2 |    .857948   .0793509    -1.66   0.098      .715705    1.028461
        age3 |    1.36742   .2496841     1.71   0.087     .9560418    1.955812
      1.male |   .9918419   .0390242    -0.21   0.835     .9182305    1.071354
             |
   obese4cat |
Obese I ..)  |   1.005406   .0534536     0.10   0.919     .9059128    1.115826
Obese II..)  |   1.059575   .0737558     0.83   0.406     .9244444    1.214459
Obese II..)  |   .9530392    .082952    -0.55   0.581     .8035681    1.130313
             |
smoke_nomiss |
     Former  |   .8418305   .1306538    -1.11   0.267     .6210356    1.141124
    Current  |   .9599305   .0614167    -0.64   0.523     .8467975    1.088178
             |
         imd |
          4  |   .9098861   .0456232    -1.88   0.060     .8247198    1.003847
5 most de..  |   .9947503   .0659249    -0.08   0.937     .8735798    1.132728
             |
tot_adults~h |
          2  |   2.20e+09          .        .       .            .           .
          3  |   1.74e+09   1.10e+09    33.68   0.000     5.06e+08    6.02e+09
             |
   ethnicity |
Asian or ..  |   1.014904   .0666787     0.23   0.822      .892281     1.15438
      Other  |    .994908   .0646916    -0.08   0.937     .8758615    1.130135
             |
1.htdiag_o~p |   .9862721   .0395767    -0.34   0.730     .9116751    1.066973
1.~y_disease |   .9304371   .0432941    -1.55   0.121     .8493366    1.019282
    1.asthma |   .9331403   .0627139    -1.03   0.303     .8179749     1.06452
1.~c_disease |   1.040046   .0486497     0.84   0.401      .948935    1.139906
             |
     diabcat |
T1DM, con..  |   1.115661    .136167     0.90   0.370     .8782992    1.417169
T1DM, unc..  |   1.582966   .3182953     2.28   0.022     1.067373    2.347617
T2DM, con..  |   1.027868   .0515156     0.55   0.583     .9317005    1.133963
T2DM, unc..  |   1.069598   .1054617     0.68   0.495     .8816426    1.297623
Diabetes,..  |   .4750673    .479326    -0.74   0.461     .0657541    3.432315
             |
cancer_exh~t |
  Last year  |   1.233135   .3551819     0.73   0.467     .7011932    2.168621
2-5 years..  |   1.143714   .1556801     0.99   0.324     .8758984    1.493418
   5+ years  |   .8738029   .0454667    -2.59   0.010     .7890832    .9676186
             |
cancer_hae~t |
  Last year  |    1.17998   .3495164     0.56   0.576     .6603046    2.108653
2-5 years..  |   .7806239   .1395601    -1.39   0.166     .5498749    1.108204
   5+ years  |   1.056214   .0527061     1.10   0.273      .957803    1.164737
             |
1.~r_disease |   1.006819   .0502561     0.14   0.892     .9129837    1.110298
1.stroke_d~a |   1.064487    .050778     1.31   0.190     .9694749    1.168811
1.other_ne~o |   1.005373   .0494507     0.11   0.913     .9129769    1.107121
             |
reduced_ki~t |
Stage 3a/..  |   1.074533   .1078311     0.72   0.474     .8826738    1.308094
      1.esrd |   .9929554   .0403783    -0.17   0.862     .9168871    1.075335
1.other_tr~t |   1.029339   .0508254     0.59   0.558     .9343918    1.133935
  1.asplenia |   1.070881   .0494149     1.48   0.138     .9782802    1.172247
1.ra_sle_p~s |   1.030952    .048409     0.65   0.516     .9403075    1.130335
1.other_im~o |   1.024084   .0483096     0.50   0.614      .933644    1.123284
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod0_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod0_2ndVaccCensor.ster saved
(4,919 missing values generated)
(15,928 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     30,217  observations remaining, representing
     30,217  subjects
     12,316  failures in single-failure-per-subject data
  6,169,196  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(68,455 observations (episodes) created)
(cat_time: 68455 changes made)
(covid_death: 68455 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       30.62       30.62
          1 |     25,850       26.20       56.82
          2 |     22,519       22.82       79.64
          3 |     12,704       12.87       92.52
          4 |      5,427        5.50       98.02
          5 |      1,955        1.98      100.00
------------+-----------------------------------
      Total |     98,672      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    18,664      3,855 |    22,519 
         3 |    10,356      2,348 |    12,704 
         4 |     4,229      1,198 |     5,427 
         5 |     1,737        218 |     1,955 
-----------+----------------------+----------
     Total |    86,356     12,316 |    98,672 
(72,826 observations deleted)
   1:     31.40 /        1 =      31.3990

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       25,850             Number of obs    =      25,850
No. of failures      =        2,014
Time at risk         =      1670587
                                                Wald chi2(41)    =       37.98
Log pseudolikelihood =   -15673.828             Prob > chi2      =      0.6057

                       (Std. Err. adjusted for 1,185 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.127992   .6237624     0.22   0.828     .3815963    3.334322
 only 12-18  |   1.230923   .8540896     0.30   0.765     .3159478    4.795639
      mixed  |   1.012573   .5107315     0.02   0.980     .3767811    2.721221
             |
        age1 |   1.023865   .0213945     1.13   0.259     .9827795    1.066668
        age2 |    .887478   .0961824    -1.10   0.271     .7176401     1.09751
        age3 |   1.269989   .2707137     1.12   0.262     .8362881    1.928608
      1.male |   .9822583   .0432477    -0.41   0.684     .9010487    1.070787
             |
   obese4cat |
Obese I ..)  |   .9349086    .061537    -1.02   0.307     .8217541    1.063644
Obese II..)  |   1.010566   .0801419     0.13   0.895     .8650898    1.180507
Obese II..)  |   .9288145   .0921188    -0.74   0.457     .7647292    1.128107
             |
smoke_nomiss |
     Former  |   .9465742   .1549467    -0.34   0.737     .6867833    1.304637
    Current  |   .9333816     .06654    -0.97   0.334     .8116668    1.073348
             |
         imd |
          4  |   1.015882   .0580418     0.28   0.783     .9082606    1.136256
5 most de..  |   .9501448   .0713524    -0.68   0.496     .8201016    1.100809
             |
tot_adults~h |
          2  |   .6577344   .2405085    -1.15   0.252      .321217    1.346798
          3  |   4.71e+17          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   1.113825   .0797179     1.51   0.132     .9680449    1.281559
      Other  |   1.066384   .0739405     0.93   0.354     .9308795    1.221614
             |
1.htdiag_o~p |    1.00726   .0487873     0.15   0.881     .9160368    1.107567
1.~y_disease |   1.161718   .0632369     2.75   0.006     1.044159    1.292513
    1.asthma |   .9757336   .0799733    -0.30   0.764     .8309308    1.145771
1.~c_disease |   1.097017   .0606136     1.68   0.094     .9844227    1.222488
             |
     diabcat |
T1DM, con..  |   .8194271   .1316928    -1.24   0.215     .5980134    1.122819
T1DM, unc..  |   1.138561   .3158981     0.47   0.640     .6609782    1.961216
T2DM, con..  |   1.042017   .0658561     0.65   0.515     .9206162    1.179428
T2DM, unc..  |   .8953551   .1184283    -0.84   0.403     .6908873    1.160335
Diabetes,..  |   1.959545   1.194309     1.10   0.270     .5934202    6.470652
             |
cancer_exh~t |
  Last year  |   1.706753   .4856443     1.88   0.060     .9771634    2.981082
2-5 years..  |   1.114394   .2012437     0.60   0.549     .7822107    1.587646
   5+ years  |   .9746699   .0571424    -0.44   0.662      .868868    1.093355
             |
cancer_hae~t |
  Last year  |   .7760243   .3207231    -0.61   0.540     .3452091     1.74449
2-5 years..  |   1.005411    .180498     0.03   0.976     .7071803     1.42941
   5+ years  |   .9697359   .0573375    -0.52   0.603     .8636237    1.088886
             |
1.~r_disease |   .9500703   .0567685    -0.86   0.391     .8450742    1.068112
1.stroke_d~a |   1.019895   .0522869     0.38   0.701     .9223953    1.127701
1.other_ne~o |   1.079341   .0597593     1.38   0.168     .9683465    1.203059
             |
reduced_ki~t |
Stage 3a/..  |   .8640762   .1146051    -1.10   0.271     .6662765    1.120597
      1.esrd |   1.047861   .0501921     0.98   0.329     .9539624    1.151001
1.other_tr~t |   .9723737   .0535934    -0.51   0.611     .8728073    1.083298
  1.asplenia |   1.014193    .058519     0.24   0.807     .9057453    1.135625
1.ra_sle_p~s |   .9718885    .053726    -0.52   0.606     .8720914    1.083106
1.other_im~o |   .9439274   .0517892    -1.05   0.293     .8476896    1.051091
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod1_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod1_2ndVaccCensor.ster saved
(4,919 missing values generated)
(15,928 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     30,217  observations remaining, representing
     30,217  subjects
     12,316  failures in single-failure-per-subject data
  6,169,196  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(68,455 observations (episodes) created)
(cat_time: 68455 changes made)
(covid_death: 68455 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       30.62       30.62
          1 |     25,850       26.20       56.82
          2 |     22,519       22.82       79.64
          3 |     12,704       12.87       92.52
          4 |      5,427        5.50       98.02
          5 |      1,955        1.98      100.00
------------+-----------------------------------
      Total |     98,672      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    18,664      3,855 |    22,519 
         3 |    10,356      2,348 |    12,704 
         4 |     4,229      1,198 |     5,427 
         5 |     1,737        218 |     1,955 
-----------+----------------------+----------
     Total |    86,356     12,316 |    98,672 
(76,157 observations deleted)
   1:      6.71 /        1 =       6.7150

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       22,519             Number of obs    =      22,519
No. of failures      =        3,855
Time at risk         =      1106250
                                                Wald chi2(42)    =       53.50
Log pseudolikelihood =   -28798.801             Prob > chi2      =      0.1098

                       (Std. Err. adjusted for 1,170 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .7714816   .3306891    -0.61   0.545     .3330161    1.787252
 only 12-18  |   1.393066   .6657662     0.69   0.488     .5459716    3.554456
      mixed  |   1.140603   .4270426     0.35   0.725     .5475757    2.375883
             |
        age1 |   .9898706   .0149303    -0.67   0.500      .961036     1.01957
        age2 |   1.029257    .082249     0.36   0.718     .8800417    1.203772
        age3 |   .9441073   .1495565    -0.36   0.717     .6921211    1.287836
      1.male |   .9797964   .0317049    -0.63   0.528     .9195855     1.04395
             |
   obese4cat |
Obese I ..)  |   .9684345   .0448471    -0.69   0.489     .8844068    1.060446
Obese II..)  |   .9772249   .0556855    -0.40   0.686     .8739573    1.092695
Obese II..)  |   .8762251   .0633293    -1.83   0.068     .7604926     1.00957
             |
smoke_nomiss |
     Former  |   1.036947   .1203573     0.31   0.755     .8259587    1.301831
    Current  |   .9400423   .0474062    -1.23   0.220      .851572    1.037704
             |
         imd |
          4  |   1.037797   .0426234     0.90   0.366      .957531    1.124792
5 most de..  |   .9937243   .0543148    -0.12   0.908     .8927732    1.106091
             |
tot_adults~h |
          2  |   2.191739   2.073606     0.83   0.407      .343136    13.99946
          3  |   1.495998   1.120885     0.54   0.591     .3444794    6.496787
             |
   ethnicity |
Asian or ..  |   .9645346   .0534617    -0.65   0.515     .8652425    1.075221
      Other  |   .9365524   .0503723    -1.22   0.223     .8428502    1.040672
             |
1.htdiag_o~p |      .9812   .0318564    -0.58   0.559     .9207077    1.045667
1.~y_disease |   1.006683   .0411562     0.16   0.871      .929166    1.090668
    1.asthma |   1.041412   .0601678     0.70   0.482      .929917    1.166275
1.~c_disease |   1.052789   .0414112     1.31   0.191     .9746745    1.137164
             |
     diabcat |
T1DM, con..  |   1.035657   .1038558     0.35   0.727     .8508587    1.260592
T1DM, unc..  |   .7598673   .1812563    -1.15   0.250     .4760964    1.212776
T2DM, con..  |   .9808759   .0430965    -0.44   0.660      .899943    1.069087
T2DM, unc..  |   .8110732   .0781761    -2.17   0.030     .6714539    .9797244
Diabetes,..  |   1.053128   .5925676     0.09   0.927     .3495687    3.172707
             |
cancer_exh~t |
  Last year  |   1.536021   .3258511     2.02   0.043       1.0135    2.327935
2-5 years..  |   1.035006   .1281815     0.28   0.781      .811942    1.319353
   5+ years  |   .9873699   .0424678    -0.30   0.768     .9075464    1.074214
             |
cancer_hae~t |
  Last year  |   1.055898   .2571025     0.22   0.823     .6551814    1.701699
2-5 years..  |   1.071522   .1374704     0.54   0.590     .8332913    1.377862
   5+ years  |   .9493142   .0403466    -1.22   0.221     .8734403    1.031779
             |
1.~r_disease |   .9611108    .039425    -0.97   0.334     .8868638    1.041574
1.stroke_d~a |   .8913621   .0361923    -2.83   0.005     .8231757    .9651965
1.other_ne~o |   1.073913   .0435926     1.76   0.079     .9917838    1.162844
             |
reduced_ki~t |
Stage 3a/..  |   .9957593   .0834688    -0.05   0.960     .8448955    1.173561
      1.esrd |   .9776185     .03226    -0.69   0.493     .9163914    1.042936
1.other_tr~t |    1.07446   .0421766     1.83   0.067     .9948957    1.160388
  1.asplenia |   .9931914   .0421251    -0.16   0.872     .9139663    1.079284
1.ra_sle_p~s |   1.033655   .0415188     0.82   0.410     .9554007     1.11832
1.other_im~o |   .9560045   .0379117    -1.13   0.257     .8845132    1.033274
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod2_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod2_2ndVaccCensor.ster saved
(4,919 missing values generated)
(15,928 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     30,217  observations remaining, representing
     30,217  subjects
     12,316  failures in single-failure-per-subject data
  6,169,196  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(68,455 observations (episodes) created)
(cat_time: 68455 changes made)
(covid_death: 68455 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       30.62       30.62
          1 |     25,850       26.20       56.82
          2 |     22,519       22.82       79.64
          3 |     12,704       12.87       92.52
          4 |      5,427        5.50       98.02
          5 |      1,955        1.98      100.00
------------+-----------------------------------
      Total |     98,672      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    18,664      3,855 |    22,519 
         3 |    10,356      2,348 |    12,704 
         4 |     4,229      1,198 |     5,427 
         5 |     1,737        218 |     1,955 
-----------+----------------------+----------
     Total |    86,356     12,316 |    98,672 
(85,972 observations deleted)
   1:      2.68 /        1 =       2.6770

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,704             Number of obs    =      12,704
No. of failures      =        2,348
Time at risk         =       433188
                                                Wald chi2(42)    =       25.49
Log pseudolikelihood =   -15980.046             Prob > chi2      =      0.9792

                       (Std. Err. adjusted for 1,081 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.83894   1.039503     1.08   0.281      .607304     5.56838
 only 12-18  |   1.516023    1.12407     0.56   0.575     .3544653    6.483919
      mixed  |   1.806613   .9742754     1.10   0.273     .6278082    5.198805
             |
        age1 |   .9920957   .0185071    -0.43   0.671     .9564775     1.02904
        age2 |    1.05135   .1005099     0.52   0.600     .8717095    1.268011
        age3 |   .9079246   .1702823    -0.52   0.607     .6286457    1.311274
      1.male |   1.022019   .0414594     0.54   0.591     .9439068    1.106596
             |
   obese4cat |
Obese I ..)  |   .9880318   .0570517    -0.21   0.835     .8823078    1.106424
Obese II..)  |   .9871364   .0736375    -0.17   0.862     .8528645    1.142548
Obese II..)  |   .9531082    .085393    -0.54   0.592     .7996123     1.13607
             |
smoke_nomiss |
     Former  |   1.212597   .1695103     1.38   0.168     .9219902    1.594803
    Current  |   1.032747    .065171     0.51   0.610     .9125975    1.168715
             |
         imd |
          4  |   1.004487   .0527322     0.09   0.932     .9062727    1.113344
5 most de..  |   .9449051   .0717008    -0.75   0.455     .8143249    1.096424
             |
tot_adults~h |
          2  |   1.968458   1.838739     0.73   0.468     .3155134    12.28103
          3  |   .7686189   .6164837    -0.33   0.743     .1595844    3.701959
             |
   ethnicity |
Asian or ..  |   .9922686   .0695966    -0.11   0.912     .8648224    1.138496
      Other  |   .9655094   .0681535    -0.50   0.619     .8407595    1.108769
             |
1.htdiag_o~p |   1.001668   .0435745     0.04   0.969      .919803    1.090819
1.~y_disease |   .9495743   .0484965    -1.01   0.311     .8591253    1.049546
    1.asthma |   1.162048   .0797396     2.19   0.029     1.015816    1.329332
1.~c_disease |   1.009732   .0503219     0.19   0.846     .9157667    1.113339
             |
     diabcat |
T1DM, con..  |    1.05004   .1263831     0.41   0.685     .8293826    1.329403
T1DM, unc..  |   .8523652   .2396645    -0.57   0.570      .491234    1.478982
T2DM, con..  |   .9731213   .0558949    -0.47   0.635     .8695108    1.089078
T2DM, unc..  |   .9889129   .1104465    -0.10   0.920     .7944962    1.230904
Diabetes,..  |   .8216281   .8106723    -0.20   0.842      .118802    5.682333
             |
cancer_exh~t |
  Last year  |   1.110456   .4032954     0.29   0.773     .5449571    2.262772
2-5 years..  |   .9430538   .1539455    -0.36   0.719     .6848336    1.298637
   5+ years  |   .9606825   .0517119    -0.75   0.456     .8644925    1.067575
             |
cancer_hae~t |
  Last year  |   1.477018   .4078591     1.41   0.158     .8596813    2.537662
2-5 years..  |   1.047925   .1814209     0.27   0.787     .7463913    1.471274
   5+ years  |   1.023384   .0559311     0.42   0.672     .9194278    1.139093
             |
1.~r_disease |   .9908926   .0509671    -0.18   0.859     .8958691    1.095995
1.stroke_d~a |   .9920706   .0519438    -0.15   0.879     .8953123    1.099286
1.other_ne~o |   1.058166   .0570416     1.05   0.294     .9520703    1.176086
             |
reduced_ki~t |
Stage 3a/..  |   .9958987   .1108825    -0.04   0.971     .8006508     1.23876
      1.esrd |   .9492031   .0396765    -1.25   0.212     .8745389    1.030242
1.other_tr~t |   .9134077   .0472732    -1.75   0.080     .8252983    1.010924
  1.asplenia |   1.009347   .0550664     0.17   0.865     .9069891    1.123257
1.ra_sle_p~s |    1.02756   .0529154     0.53   0.598     .9289102    1.136687
1.other_im~o |   1.016241   .0533722     0.31   0.759     .9168378    1.126423
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod3_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod3_2ndVaccCensor.ster saved
(4,919 missing values generated)
(15,928 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     30,217  observations remaining, representing
     30,217  subjects
     12,316  failures in single-failure-per-subject data
  6,169,196  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(68,455 observations (episodes) created)
(cat_time: 68455 changes made)
(covid_death: 68455 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       30.62       30.62
          1 |     25,850       26.20       56.82
          2 |     22,519       22.82       79.64
          3 |     12,704       12.87       92.52
          4 |      5,427        5.50       98.02
          5 |      1,955        1.98      100.00
------------+-----------------------------------
      Total |     98,672      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    18,664      3,855 |    22,519 
         3 |    10,356      2,348 |    12,704 
         4 |     4,229      1,198 |     5,427 
         5 |     1,737        218 |     1,955 
-----------+----------------------+----------
     Total |    86,356     12,316 |    98,672 
(93,249 observations deleted)
   1:      6.63 /        1 =       6.6330

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,427             Number of obs    =       5,427
No. of failures      =        1,198
Time at risk         =       289441
                                                Wald chi2(41)    =     6673.28
Log pseudolikelihood =   -6934.4828             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 954 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .4752152   .2262402    -1.56   0.118     .1869178    1.208175
 only 12-18  |   1.05e-19   6.81e-20   -67.38   0.000     2.95e-20    3.74e-19
      mixed  |   .4606945   .1710068    -2.09   0.037     .2225628    .9536159
             |
        age1 |   .9570442   .0246766    -1.70   0.089     .9098808    1.006652
        age2 |   1.152536   .1586326     1.03   0.302      .880029    1.509427
        age3 |   .8020108   .2187545    -0.81   0.419     .4699034    1.368837
      1.male |    1.03984    .059689     0.68   0.496     .9291923    1.163663
             |
   obese4cat |
Obese I ..)  |   .9825057   .0849616    -0.20   0.838     .8293311    1.163971
Obese II..)  |   .9312448   .0946688    -0.70   0.483     .7630133    1.136569
Obese II..)  |     .85743   .1121743    -1.18   0.240     .6634974    1.108047
             |
smoke_nomiss |
     Former  |   .7782099   .1928835    -1.01   0.312     .4787644    1.264945
    Current  |   .8421374   .0799053    -1.81   0.070      .699226    1.014258
             |
         imd |
          4  |   1.029448    .075645     0.39   0.693     .8913686    1.188918
5 most de..  |   .9251184   .0922795    -0.78   0.435     .7608358    1.124874
             |
tot_adults~h |
          2  |   .0494822   .0394878    -3.77   0.000     .0103555    .2364425
          3  |   2.51e+17          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |    1.00857   .1037647     0.08   0.934     .8243881      1.2339
      Other  |   1.064557   .1008071     0.66   0.509     .8842299    1.281659
             |
1.htdiag_o~p |   .9807375   .0589225    -0.32   0.746     .8717917    1.103298
1.~y_disease |    1.08089     .08145     1.03   0.302     .9324799     1.25292
    1.asthma |   1.049697   .1174594     0.43   0.665     .8429777     1.30711
1.~c_disease |   .9925993   .0705098    -0.10   0.917     .8635916    1.140879
             |
     diabcat |
T1DM, con..  |   .7371175   .1659675    -1.35   0.176     .4741135    1.146017
T1DM, unc..  |   .8326829   .3186685    -0.48   0.632     .3933001    1.762931
T2DM, con..  |    1.18359   .0906394     2.20   0.028      1.01863    1.375265
T2DM, unc..  |   .9894773   .1550469    -0.07   0.946     .7278236    1.345196
Diabetes,..  |   2.437829   .9314412     2.33   0.020     1.152863    5.155001
             |
cancer_exh~t |
  Last year  |   1.428667   .7453959     0.68   0.494     .5138348     3.97227
2-5 years..  |   1.503203   .3064243     2.00   0.046     1.008097    2.241471
   5+ years  |   1.137062   .0802974     1.82   0.069     .9900881    1.305854
             |
cancer_hae~t |
  Last year  |   .8605651   .5298677    -0.24   0.807     .2574431    2.876644
2-5 years..  |   1.019642   .2341844     0.08   0.933     .6500539    1.599358
   5+ years  |   .9535171   .0757232    -0.60   0.549      .816076    1.114106
             |
1.~r_disease |   1.017958   .0763507     0.24   0.812      .878793    1.179161
1.stroke_d~a |   1.028121   .0699842     0.41   0.684     .8997105    1.174858
1.other_ne~o |   1.009646   .0731856     0.13   0.895     .8759279    1.163776
             |
reduced_ki~t |
Stage 3a/..  |   .9852278    .151339    -0.10   0.923     .7290968    1.331337
      1.esrd |   1.095553   .0651481     1.53   0.125     .9750255     1.23098
1.other_tr~t |   .9079529   .0692228    -1.27   0.205     .7819288    1.054288
  1.asplenia |   .9330281   .0683171    -0.95   0.344     .8082933    1.077012
1.ra_sle_p~s |   1.043368   .0704488     0.63   0.530     .9140377    1.190999
1.other_im~o |    1.02529    .071796     0.36   0.721     .8938024    1.176122
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod4_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod4_2ndVaccCensor.ster saved
(4,919 missing values generated)
(15,928 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     30,217  observations remaining, representing
     30,217  subjects
     12,316  failures in single-failure-per-subject data
  6,169,196  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(68,455 observations (episodes) created)
(cat_time: 68455 changes made)
(covid_death: 68455 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       30.62       30.62
          1 |     25,850       26.20       56.82
          2 |     22,519       22.82       79.64
          3 |     12,704       12.87       92.52
          4 |      5,427        5.50       98.02
          5 |      1,955        1.98      100.00
------------+-----------------------------------
      Total |     98,672      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    18,664      3,855 |    22,519 
         3 |    10,356      2,348 |    12,704 
         4 |     4,229      1,198 |     5,427 
         5 |     1,737        218 |     1,955 
-----------+----------------------+----------
     Total |    86,356     12,316 |    98,672 
(96,721 observations deleted)
   1:      3.57 /        1 =       3.5710

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,955             Number of obs    =       1,955
No. of failures      =          218
Time at risk         =        86821
                                                Wald chi2(39)    =    11981.94
Log pseudolikelihood =   -1106.0298             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 740 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .0066251   .0085785    -3.87   0.000     .0005236     .083825
 only 12-18  |   1.04e-21          .        .       .            .           .
      mixed  |   .0048894   .0051269    -5.07   0.000     .0006262    .0381766
             |
        age1 |   1.055839   .0648026     0.89   0.376     .9361701    1.190805
        age2 |   .8081342   .2592023    -0.66   0.507     .4309905    1.515302
        age3 |   1.464823   .9281832     0.60   0.547     .4230798    5.071634
      1.male |   1.257465   .1763822     1.63   0.102     .9552111    1.655359
             |
   obese4cat |
Obese I ..)  |   .9342462   .1885516    -0.34   0.736      .629028    1.387563
Obese II..)  |   .6884693    .192362    -1.34   0.182     .3981569     1.19046
Obese II..)  |   .9449766   .2685707    -0.20   0.842     .5413798    1.649453
             |
smoke_nomiss |
     Former  |   .5981606   .4425663    -0.69   0.487     .1402917    2.550373
    Current  |   1.181899   .2253636     0.88   0.381     .8133436    1.717461
             |
         imd |
          4  |    1.02417   .1865895     0.13   0.896     .7166303     1.46369
5 most de..  |   1.278713    .275708     1.14   0.254     .8379973    1.951209
             |
tot_adults~h |
          2  |   1.964432   2.926209     0.45   0.650     .1059963    36.40685
          3  |   3.06e+19          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   1.101295   .2372244     0.45   0.654     .7220226    1.679797
      Other  |    .922309   .2351297    -0.32   0.751      .559596    1.520122
             |
1.htdiag_o~p |   .9020195   .1350826    -0.69   0.491     .6725796    1.209729
1.~y_disease |   .7159749   .1370127    -1.75   0.081      .492048    1.041809
    1.asthma |   .7079809   .2093139    -1.17   0.243     .3966108    1.263801
1.~c_disease |   .7946942    .151423    -1.21   0.228     .5470286     1.15449
             |
     diabcat |
T1DM, con..  |   1.005252   .4238912     0.01   0.990      .439889    2.297242
T1DM, unc..  |   1.086469   1.175253     0.08   0.939     .1303939    9.052688
T2DM, con..  |   1.164894   .2272128     0.78   0.434     .7948028    1.707314
T2DM, unc..  |    .928461   .3390354    -0.20   0.839     .4538791    1.899272
             |
cancer_exh~t |
  Last year  |   1.734629   1.669732     0.57   0.567     .2629364    11.44359
2-5 years..  |   .6711218   .5099303    -0.52   0.600     .1513712    2.975497
   5+ years  |   .8278685   .1599903    -0.98   0.328     .5668417    1.209096
             |
cancer_hae~t |
  Last year  |   2.96e-19   1.26e-19  -100.20   0.000     1.28e-19    6.82e-19
2-5 years..  |   .2728647   .2714894    -1.31   0.192     .0388183    1.918044
   5+ years  |   1.079145   .1908804     0.43   0.667     .7629891    1.526305
             |
1.~r_disease |   1.048417   .1925908     0.26   0.797     .7314276    1.502786
1.stroke_d~a |   .5984927   .1163425    -2.64   0.008     .4088761    .8760442
1.other_ne~o |   1.011222   .1860813     0.06   0.952     .7050365    1.450379
             |
reduced_ki~t |
Stage 3a/..  |   1.510964   .4751689     1.31   0.189     .8157702    2.798598
      1.esrd |   1.230237   .1770739     1.44   0.150     .9278357    1.631196
1.other_tr~t |   1.051792    .167525     0.32   0.751      .769758    1.437162
  1.asplenia |   .9376134   .1633802    -0.37   0.712     .6663478    1.319309
1.ra_sle_p~s |   1.110258   .1818835     0.64   0.523     .8053396    1.530624
1.other_im~o |   1.039945   .1846414     0.22   0.825     .7343115    1.472789
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod5_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod5_2ndVaccCensor.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_death_2ndVac
> cCensor.log
  log type:  text
 closed on:  15 Mar 2023, 14:01:31
-------------------------------------------------------------------------------
