-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covidadmission_2nd
> VaccCensor.log
  log type:  text
 opened on:  15 Mar 2023, 14:02:42

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. forvalues period=0/5 {
  3. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  4. 
. *Censor at date of second vacc_7ds
. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
  5. replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>s
> econd_vacc_plus_7d
  6. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7.         
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. *Omicron period +7 days: 27th December 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  8. stsplit cat_time, at(0,85,154, 216, 263, 372, 500)
  9. recode cat_time 85=1 154=2 216=3 263=4 372=5
 10. recode `outcome' .=0 
 11. tab cat_time
 12. tab cat_time `outcome'
 13. }
 14. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. *Omicron period +14 days: 3rd January 2022
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 15. stsplit cat_time, at(0,92,161,222,270, 379, 500)
 16. recode cat_time 92=1 161=2 222=3 270=4 379=5
 17. recode `outcome' .=0 
 18. tab cat_time
 19. tab cat_time `outcome'
 20. }
 21. keep if cat_time==`period'
 22. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 23. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 24. if _rc==0{
 25. estimates
 26. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'_2ndVaccCensor", replace
 27.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 28. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 29. 
. }
 30. }
 31. }
(17,201 missing values generated)
(43,369 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
        137  observations end on or before enter()
------------------------------------------------------------------------------
    107,101  observations remaining, representing
    107,101  subjects
     31,921  failures in single-failure-per-subject data
   19045820  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(201,800 observations (episodes) created)
(cat_time: 201800 changes made)
(covidadmission: 201800 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       34.67       34.67
          1 |     82,642       26.75       61.43
          2 |     66,433       21.51       82.93
          3 |     34,638       11.21       94.14
          4 |     13,821        4.47       98.62
          5 |      4,266        1.38      100.00
------------+-----------------------------------
      Total |    308,901      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    57,743      8,690 |    66,433 
         3 |    29,859      4,779 |    34,638 
         4 |    11,603      2,218 |    13,821 
         5 |     3,910        356 |     4,266 
-----------+----------------------+----------
     Total |   276,980     31,921 |   308,901 
(201,937 observations deleted)
   1:     30.94 /        1 =      30.9420

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      107,101             Number of obs    =     107,101
No. of failures      =        9,731
Time at risk         =      8724444
                                                Wald chi2(42)    =       46.89
Log pseudolikelihood =   -89089.885             Prob > chi2      =      0.2788

                       (Std. Err. adjusted for 1,372 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.14769   .2735097     0.58   0.563      .719403    1.830953
 only 12-18  |   .7476252   .2828964    -0.77   0.442     .3561188    1.569542
      mixed  |   1.035694   .2289298     0.16   0.874     .6715553     1.59728
             |
        age1 |   1.001886   .0037654     0.50   0.616     .9945332    1.009293
        age2 |   .9947632   .0115111    -0.45   0.650     .9724558    1.017582
        age3 |   1.019292    .033435     0.58   0.560     .9558229    1.086976
      1.male |   .9875049   .0199583    -0.62   0.534      .949152    1.027407
             |
   obese4cat |
Obese I ..)  |   .9698521   .0301598    -0.98   0.325     .9125054    1.030803
Obese II..)  |   .9579337   .0367921    -1.12   0.263     .8884699    1.032828
Obese II..)  |   1.060838   .0462842     1.35   0.176     .9738935    1.155545
             |
smoke_nomiss |
     Former  |   1.020244   .0749722     0.27   0.785     .8833933    1.178296
    Current  |   1.023898   .0307472     0.79   0.432     .9653735     1.08597
             |
         imd |
          4  |   1.014669   .0269607     0.55   0.584     .9631799    1.068912
5 most de..  |   1.019131   .0348979     0.55   0.580     .9529776    1.089878
             |
tot_adults~h |
          2  |   1.848319   .9765374     1.16   0.245     .6562278     5.20594
          3  |   1.317317   .6317455     0.57   0.566      .514612    3.372103
             |
   ethnicity |
Asian or ..  |   1.033896   .0340105     1.01   0.311     .9693399    1.102751
      Other  |    .983694   .0344163    -0.47   0.638     .9185002    1.053515
             |
1.htdiag_o~p |   1.026074   .0216311     1.22   0.222      .984542    1.069359
1.~y_disease |   .9821054   .0256834    -0.69   0.490     .9330351    1.033756
    1.asthma |   .9551517   .0356314    -1.23   0.219     .8878073    1.027604
1.~c_disease |   1.045938   .0271562     1.73   0.084     .9940439     1.10054
             |
     diabcat |
T1DM, con..  |   .9697477   .0639314    -0.47   0.641     .8522021    1.103507
T1DM, unc..  |    .831683   .1304873    -1.17   0.240     .6115165    1.131117
T2DM, con..  |   .9425666   .0262851    -2.12   0.034     .8924314    .9955183
T2DM, unc..  |   1.009524   .0564893     0.17   0.865     .9046624    1.126541
Diabetes,..  |   1.435805   .4185111     1.24   0.215     .8109345    2.542174
             |
cancer_exh~t |
  Last year  |   1.002919   .1598602     0.02   0.985     .7338187    1.370702
2-5 years..  |   1.098075   .0872371     1.18   0.239     .9397401    1.283087
   5+ years  |   1.004658   .0256372     0.18   0.855     .9556463    1.056184
             |
cancer_hae~t |
  Last year  |   1.214614   .1830578     1.29   0.197      .903965    1.632019
2-5 years..  |   .9746339   .0822298    -0.30   0.761     .8260869    1.149893
   5+ years  |   1.033047   .0282145     1.19   0.234     .9792013    1.089853
             |
1.~r_disease |   1.001587   .0254862     0.06   0.950     .9528605    1.052806
1.stroke_d~a |   .9886659   .0250544    -0.45   0.653     .9407597    1.039012
1.other_ne~o |   1.057493   .0259065     2.28   0.022     1.007917    1.109507
             |
reduced_ki~t |
Stage 3a/..  |   .8413097   .1497962    -0.97   0.332     .5934695    1.192651
      1.esrd |   .9888917   .0212498    -0.52   0.603     .9481077     1.03143
1.other_tr~t |   1.024739   .0263645     0.95   0.342     .9743463    1.077737
  1.asplenia |   .9917109   .0243845    -0.34   0.735     .9450515    1.040674
1.ra_sle_p~s |   1.047587   .0265728     1.83   0.067     .9967782    1.100985
1.other_im~o |     1.0149   .0240507     0.62   0.533     .9688397    1.063151
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod0_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod0_2ndVaccCensor.ster saved
(17,201 missing values generated)
(43,369 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
        137  observations end on or before enter()
------------------------------------------------------------------------------
    107,101  observations remaining, representing
    107,101  subjects
     31,921  failures in single-failure-per-subject data
   19045820  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(201,800 observations (episodes) created)
(cat_time: 201800 changes made)
(covidadmission: 201800 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       34.67       34.67
          1 |     82,642       26.75       61.43
          2 |     66,433       21.51       82.93
          3 |     34,638       11.21       94.14
          4 |     13,821        4.47       98.62
          5 |      4,266        1.38      100.00
------------+-----------------------------------
      Total |    308,901      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    57,743      8,690 |    66,433 
         3 |    29,859      4,779 |    34,638 
         4 |    11,603      2,218 |    13,821 
         5 |     3,910        356 |     4,266 
-----------+----------------------+----------
     Total |   276,980     31,921 |   308,901 
(226,396 observations deleted)
   1:     21.31 /        1 =      21.3120

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       82,642             Number of obs    =      82,642
No. of failures      =        6,147
Time at risk         =      5139874
                                                Wald chi2(42)    =       56.39
Log pseudolikelihood =   -54784.212             Prob > chi2      =      0.0680

                       (Std. Err. adjusted for 1,341 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8129438    .230344    -0.73   0.465     .4665266    1.416592
 only 12-18  |   1.524966    .508169     1.27   0.205     .7936183    2.930276
      mixed  |   .9487216   .2447275    -0.20   0.838     .5722254    1.572934
             |
        age1 |   .9913897   .0048497    -1.77   0.077     .9819299    1.000941
        age2 |   1.024954   .0160857     1.57   0.116     .9939062    1.056971
        age3 |   .9341768   .0418268    -1.52   0.128     .8556919     1.01986
      1.male |   1.047024     .02672     1.80   0.072     .9959419    1.100726
             |
   obese4cat |
Obese I ..)  |   .9997422   .0396925    -0.01   0.995     .9248962    1.080645
Obese II..)  |   1.001158   .0466457     0.02   0.980     .9137846    1.096887
Obese II..)  |    .982541   .0545352    -0.32   0.751     .8812627    1.095459
             |
smoke_nomiss |
     Former  |   .8749757   .0872263    -1.34   0.180     .7196804    1.063781
    Current  |   .9940088   .0380037    -0.16   0.875     .9222454    1.071356
             |
         imd |
          4  |    .930976   .0311023    -2.14   0.032     .8719696    .9939754
5 most de..  |   .9059534   .0398929    -2.24   0.025     .8310437    .9876154
             |
tot_adults~h |
          2  |   .5017351   .3170177    -1.09   0.275     .1454283    1.731012
          3  |   .7473858    .327221    -0.67   0.506     .3168627    1.762863
             |
   ethnicity |
Asian or ..  |   .9907142   .0434322    -0.21   0.831     .9091432    1.079604
      Other  |   1.014217   .0433689     0.33   0.741     .9326797    1.102882
             |
1.htdiag_o~p |   .9438226   .0257212    -2.12   0.034     .8947328    .9956059
1.~y_disease |   .9787495   .0322351    -0.65   0.514     .9175658    1.044013
    1.asthma |   1.031563   .0493369     0.65   0.516     .9392582    1.132939
1.~c_disease |   .9611531   .0307586    -1.24   0.216     .9027192     1.02337
             |
     diabcat |
T1DM, con..  |   1.124875   .0937833     1.41   0.158     .9552955    1.324558
T1DM, unc..  |   .8384401   .1639064    -0.90   0.367      .571572     1.22991
T2DM, con..  |   .9527169   .0357658    -1.29   0.197      .885134     1.02546
T2DM, unc..  |   1.067097   .0702748     0.99   0.324     .9378798    1.214118
Diabetes,..  |   1.876748   .6117287     1.93   0.053     .9907304    3.555137
             |
cancer_exh~t |
  Last year  |   .7691576   .1856068    -1.09   0.277     .4793032    1.234299
2-5 years..  |   .8314981   .0959941    -1.60   0.110     .6631204     1.04263
   5+ years  |    .920739   .0314387    -2.42   0.016      .861137    .9844663
             |
cancer_hae~t |
  Last year  |    .953281   .1973087    -0.23   0.817     .6353903    1.430215
2-5 years..  |   1.100416   .1115636     0.94   0.345     .9021099    1.342315
   5+ years  |   .9864383   .0347961    -0.39   0.699     .9205433     1.05705
             |
1.~r_disease |   1.006118   .0312974     0.20   0.845     .9466092    1.069369
1.stroke_d~a |   .9939273   .0328439    -0.18   0.854     .9315947    1.060431
1.other_ne~o |   1.016062   .0304278     0.53   0.595     .9581407    1.077484
             |
reduced_ki~t |
Stage 3a/..  |   1.076367   .2120321     0.37   0.709      .731616     1.58357
      1.esrd |    1.00052    .026491     0.02   0.984     .9499232    1.053813
1.other_tr~t |   .9832584   .0306842    -0.54   0.588     .9249208    1.045276
  1.asplenia |   .9921447    .033453    -0.23   0.815     .9286977    1.059926
1.ra_sle_p~s |   1.009133   .0332149     0.28   0.782     .9460888    1.076379
1.other_im~o |     .99287   .0310343    -0.23   0.819     .9338695    1.055598
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod1_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod1_2ndVaccCensor.ster saved
(17,201 missing values generated)
(43,369 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
        137  observations end on or before enter()
------------------------------------------------------------------------------
    107,101  observations remaining, representing
    107,101  subjects
     31,921  failures in single-failure-per-subject data
   19045820  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(201,800 observations (episodes) created)
(cat_time: 201800 changes made)
(covidadmission: 201800 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       34.67       34.67
          1 |     82,642       26.75       61.43
          2 |     66,433       21.51       82.93
          3 |     34,638       11.21       94.14
          4 |     13,821        4.47       98.62
          5 |      4,266        1.38      100.00
------------+-----------------------------------
      Total |    308,901      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    57,743      8,690 |    66,433 
         3 |    29,859      4,779 |    34,638 
         4 |    11,603      2,218 |    13,821 
         5 |     3,910        356 |     4,266 
-----------+----------------------+----------
     Total |   276,980     31,921 |   308,901 
(242,605 observations deleted)
   1:     16.55 /        1 =      16.5540

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       66,433             Number of obs    =      66,433
No. of failures      =        8,690
Time at risk         =      3161829
                                                Wald chi2(42)    =       38.78
Log pseudolikelihood =   -74115.809             Prob > chi2      =      0.6130

                       (Std. Err. adjusted for 1,318 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.105975   .2753589     0.40   0.686     .6789197    1.801658
 only 12-18  |   .7552665   .2557663    -0.83   0.407     .3889073    1.466744
      mixed  |   .9855494   .2225808    -0.06   0.949     .6330519    1.534326
             |
        age1 |   .9981629   .0039452    -0.47   0.642     .9904604    1.005925
        age2 |   1.007098   .0125974     0.57   0.572     .9827075    1.032093
        age3 |   .9798247   .0348321    -0.57   0.566      .913879    1.050529
      1.male |   .9837136   .0219021    -0.74   0.461     .9417094    1.027591
             |
   obese4cat |
Obese I ..)  |   .9564282   .0298585    -1.43   0.154     .8996611    1.016777
Obese II..)  |   .9661885   .0376683    -0.88   0.378     .8951102    1.042911
Obese II..)  |   1.065008   .0483725     1.39   0.166     .9742971    1.164164
             |
smoke_nomiss |
     Former  |   .9612594    .073128    -0.52   0.604     .8281048    1.115824
    Current  |    .994876    .031298    -0.16   0.870      .935386     1.05815
             |
         imd |
          4  |   1.016349   .0266083     0.62   0.536     .9655132    1.069862
5 most de..  |   .9946238   .0367455    -0.15   0.884     .9251497    1.069315
             |
tot_adults~h |
          2  |   .6384232   .3195803    -0.90   0.370     .2393406    1.702946
          3  |   .7562961   .2931588    -0.72   0.471     .3537899    1.616733
             |
   ethnicity |
Asian or ..  |   1.025437   .0371482     0.69   0.488     .9551528    1.100894
      Other  |   .9691675   .0347707    -0.87   0.383      .903359     1.03977
             |
1.htdiag_o~p |   1.010427   .0227248     0.46   0.645     .9668547    1.055963
1.~y_disease |   .9902502   .0268627    -0.36   0.718     .9389755    1.044325
    1.asthma |   1.064184   .0428054     1.55   0.122     .9835091    1.151477
1.~c_disease |   .9580747   .0251448    -1.63   0.103     .9100378    1.008647
             |
     diabcat |
T1DM, con..  |   1.003698   .0716699     0.05   0.959     .8726138    1.154473
T1DM, unc..  |   .9721763    .150035    -0.18   0.855     .7184226    1.315558
T2DM, con..  |   1.008826   .0294494     0.30   0.763     .9527263    1.068229
T2DM, unc..  |   1.065779   .0619078     1.10   0.273     .9510946    1.194293
Diabetes,..  |   1.437551   .5211566     1.00   0.317     .7063766    2.925567
             |
cancer_exh~t |
  Last year  |   1.230661   .1979719     1.29   0.197     .8978607    1.686818
2-5 years..  |   1.013425   .0879683     0.15   0.878     .8548789    1.201374
   5+ years  |   1.022228   .0291209     0.77   0.440     .9667164    1.080928
             |
cancer_hae~t |
  Last year  |    .552895   .1219941    -2.69   0.007     .3587801    .8520341
2-5 years..  |   .9908568   .0855632    -0.11   0.915     .8365797    1.173585
   5+ years  |   .9830298   .0284216    -0.59   0.554     .9288735    1.040344
             |
1.~r_disease |   .9995868   .0262744    -0.02   0.987      .949394    1.052433
1.stroke_d~a |   1.035526   .0278918     1.30   0.195     .9822771    1.091662
1.other_ne~o |   1.019513   .0274665     0.72   0.473     .9670759    1.074793
             |
reduced_ki~t |
Stage 3a/..  |   .9223395   .1653342    -0.45   0.652     .6490953    1.310609
      1.esrd |   .9714051   .0210583    -1.34   0.181      .930996    1.013568
1.other_tr~t |   .9895381   .0265592    -0.39   0.695     .9388286    1.042987
  1.asplenia |   .9650047   .0253439    -1.36   0.175     .9165884    1.015978
1.ra_sle_p~s |    .987987   .0261315    -0.46   0.648     .9380751    1.040555
1.other_im~o |   .9530466   .0248534    -1.84   0.065     .9055588    1.003025
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod2_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod2_2ndVaccCensor.ster saved
(17,201 missing values generated)
(43,369 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
        137  observations end on or before enter()
------------------------------------------------------------------------------
    107,101  observations remaining, representing
    107,101  subjects
     31,921  failures in single-failure-per-subject data
   19045820  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(201,800 observations (episodes) created)
(cat_time: 201800 changes made)
(covidadmission: 201800 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       34.67       34.67
          1 |     82,642       26.75       61.43
          2 |     66,433       21.51       82.93
          3 |     34,638       11.21       94.14
          4 |     13,821        4.47       98.62
          5 |      4,266        1.38      100.00
------------+-----------------------------------
      Total |    308,901      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    57,743      8,690 |    66,433 
         3 |    29,859      4,779 |    34,638 
         4 |    11,603      2,218 |    13,821 
         5 |     3,910        356 |     4,266 
-----------+----------------------+----------
     Total |   276,980     31,921 |   308,901 
(274,400 observations deleted)
   1:      7.39 /        1 =       7.3910

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       34,638             Number of obs    =      34,638
No. of failures      =        4,779
Time at risk         =      1151240
                                                Wald chi2(42)    =       50.19
Log pseudolikelihood =   -37169.239             Prob > chi2      =      0.1806

                       (Std. Err. adjusted for 1,238 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.017623   .3692248     0.05   0.962     .4997413    2.072187
 only 12-18  |    1.40544   .5889157     0.81   0.417      .618211    3.195124
      mixed  |   1.128714   .3757005     0.36   0.716     .5878351    2.167267
             |
        age1 |   .9991322   .0052852    -0.16   0.870     .9888268    1.009545
        age2 |   1.006435   .0170679     0.38   0.705     .9735321    1.040449
        age3 |   .9847587   .0479675    -0.32   0.753     .8950925    1.083407
      1.male |   1.000532   .0284154     0.02   0.985     .9463602    1.057804
             |
   obese4cat |
Obese I ..)  |   .9911575    .041792    -0.21   0.833       .91254    1.076548
Obese II..)  |   .8935374   .0501769    -2.00   0.045     .8004112    .9974985
Obese II..)  |   1.007532   .0658422     0.11   0.909     .8864061    1.145209
             |
smoke_nomiss |
     Former  |    1.01597   .1025041     0.16   0.875     .8336823    1.238115
    Current  |   1.056468    .046134     1.26   0.208      .969808    1.150871
             |
         imd |
          4  |   1.011911   .0355884     0.34   0.736     .9445092    1.084124
5 most de..  |   .9590655    .047539    -0.84   0.399     .8702738    1.056916
             |
tot_adults~h |
          2  |   .9162369   .7012346    -0.11   0.909     .2044313    4.106465
          3  |   .7664814    .560127    -0.36   0.716      .183005    3.210259
             |
   ethnicity |
Asian or ..  |   1.036819   .0493761     0.76   0.448     .9444232    1.138255
      Other  |   .9097701   .0485954    -1.77   0.077     .8193411     1.01018
             |
1.htdiag_o~p |   1.017569   .0313071     0.57   0.571     .9580211    1.080817
1.~y_disease |    1.02286    .036811     0.63   0.530     .9531977    1.097614
    1.asthma |   .9626931    .052943    -0.69   0.489     .8643235    1.072258
1.~c_disease |   1.019033   .0368768     0.52   0.602     .9492592    1.093935
             |
     diabcat |
T1DM, con..  |   .8065974   .0818025    -2.12   0.034     .6611967    .9839725
T1DM, unc..  |   .9641279    .188464    -0.19   0.852     .6572719    1.414244
T2DM, con..  |   1.017501   .0401929     0.44   0.661     .9416968    1.099408
T2DM, unc..  |   .9628442   .0812961    -0.45   0.654     .8159927    1.136124
Diabetes,..  |   2.532118   .9561458     2.46   0.014     1.207992    5.307668
             |
cancer_exh~t |
  Last year  |   1.449851   .2788505     1.93   0.053     .9945149    2.113661
2-5 years..  |   1.062145   .1276788     0.50   0.616     .8391939    1.344329
   5+ years  |    1.00398   .0390214     0.10   0.919     .9303403    1.083449
             |
cancer_hae~t |
  Last year  |   1.096995   .2257588     0.45   0.653     .7328748    1.642025
2-5 years..  |   1.310502   .1356697     2.61   0.009     1.069836    1.605308
   5+ years  |    1.02803   .0398131     0.71   0.475     .9528855      1.1091
             |
1.~r_disease |   1.075316   .0375125     2.08   0.037      1.00425    1.151411
1.stroke_d~a |   .9552504   .0349698    -1.25   0.211      .889112    1.026309
1.other_ne~o |   1.052919   .0373874     1.45   0.146     .9821324    1.128807
             |
reduced_ki~t |
Stage 3a/..  |   1.125462    .244519     0.54   0.586     .7351876    1.722915
      1.esrd |   .9949663   .0294193    -0.17   0.864     .9389445    1.054331
1.other_tr~t |   1.028597   .0364414     0.80   0.426     .9595967    1.102559
  1.asplenia |    .993356   .0363467    -0.18   0.855     .9246123    1.067211
1.ra_sle_p~s |   1.044909   .0369998     1.24   0.215     .9748495    1.120003
1.other_im~o |    1.00462   .0348778     0.13   0.894     .9385346    1.075359
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod3_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod3_2ndVaccCensor.ster saved
(17,201 missing values generated)
(43,369 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
        137  observations end on or before enter()
------------------------------------------------------------------------------
    107,101  observations remaining, representing
    107,101  subjects
     31,921  failures in single-failure-per-subject data
   19045820  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(201,800 observations (episodes) created)
(cat_time: 201800 changes made)
(covidadmission: 201800 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       34.67       34.67
          1 |     82,642       26.75       61.43
          2 |     66,433       21.51       82.93
          3 |     34,638       11.21       94.14
          4 |     13,821        4.47       98.62
          5 |      4,266        1.38      100.00
------------+-----------------------------------
      Total |    308,901      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    57,743      8,690 |    66,433 
         3 |    29,859      4,779 |    34,638 
         4 |    11,603      2,218 |    13,821 
         5 |     3,910        356 |     4,266 
-----------+----------------------+----------
     Total |   276,980     31,921 |   308,901 
(295,217 observations deleted)
   1:      3.57 /        1 =       3.5680

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       13,821             Number of obs    =      13,821
No. of failures      =        2,218
Time at risk         =       687259
                                                Wald chi2(42)    =       47.11
Log pseudolikelihood =   -14862.511             Prob > chi2      =      0.2714

                       (Std. Err. adjusted for 1,101 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.274756   .6966157     0.44   0.657     .4367882    3.720344
 only 12-18  |   1.644907   1.043139     0.78   0.433     .4746146    5.700878
      mixed  |   1.900382   .9116901     1.34   0.181      .742139    4.866276
             |
        age1 |   .9952721   .0077337    -0.61   0.542     .9802292    1.010546
        age2 |     1.0046   .0246507     0.19   0.852     .9574289    1.054095
        age3 |   .9919736   .0699353    -0.11   0.909     .8639515    1.138966
      1.male |   1.025946   .0417486     0.63   0.529     .9472984    1.111123
             |
   obese4cat |
Obese I ..)  |   1.048103   .0629045     0.78   0.434     .9317874    1.178938
Obese II..)  |   .9008833   .0739315    -1.27   0.203     .7670333    1.058091
Obese II..)  |   1.128559    .100624     1.36   0.175     .9476104     1.34406
             |
smoke_nomiss |
     Former  |   .9780597   .1438049    -0.15   0.880     .7331832    1.304723
    Current  |   1.100165   .0714627     1.47   0.142     .9686503    1.249536
             |
         imd |
          4  |   1.170285   .0615956     2.99   0.003     1.055578    1.297457
5 most de..  |   1.155327   .0811951     2.05   0.040     1.006661    1.325947
             |
tot_adults~h |
          2  |   .4714185   .7176487    -0.49   0.621     .0238566    9.315489
          3  |    .512641   .5664834    -0.60   0.545     .0587774    4.471119
             |
   ethnicity |
Asian or ..  |   .8742647   .0668763    -1.76   0.079     .7525423    1.015676
      Other  |   1.053784   .0728835     0.76   0.449     .9201943    1.206768
             |
1.htdiag_o~p |   .9962953   .0465744    -0.08   0.937     .9090682    1.091892
1.~y_disease |   1.020935    .055057     0.38   0.701     .9185329    1.134754
    1.asthma |   1.008994   .0777595     0.12   0.908     .8675398    1.173512
1.~c_disease |   1.048544   .0555651     0.89   0.371     .9451029    1.163306
             |
     diabcat |
T1DM, con..  |   1.036277   .1346925     0.27   0.784     .8032283    1.336943
T1DM, unc..  |   1.256223   .3437672     0.83   0.405     .7347409    2.147827
T2DM, con..  |   1.057297   .0583656     1.01   0.313      .948874     1.17811
T2DM, unc..  |     1.1429   .1250346     1.22   0.222     .9223288     1.41622
Diabetes,..  |    4.32615     3.2838     1.93   0.054     .9772148    19.15196
             |
cancer_exh~t |
  Last year  |   1.083928    .390764     0.22   0.823     .5347319    2.197176
2-5 years..  |   .8732374   .1653622    -0.72   0.474     .6024805    1.265673
   5+ years  |   .9862962   .0540888    -0.25   0.801     .8857827    1.098215
             |
cancer_hae~t |
  Last year  |   .8842277   .2486539    -0.44   0.662     .5095626    1.534372
2-5 years..  |   1.145987   .1783155     0.88   0.381     .8447587    1.554628
   5+ years  |    .931219   .0530401    -1.25   0.211     .8328549      1.0412
             |
1.~r_disease |   .9807066   .0531431    -0.36   0.719     .8818885    1.090598
1.stroke_d~a |   1.002343   .0554473     0.04   0.966     .8993524    1.117128
1.other_ne~o |   1.001529   .0514697     0.03   0.976     .9055644    1.107663
             |
reduced_ki~t |
Stage 3a/..  |   1.103055   .4052819     0.27   0.790     .5368469    2.266437
      1.esrd |   1.034845   .0463705     0.76   0.445     .9478372     1.12984
1.other_tr~t |   .9622933   .0520025    -0.71   0.477     .8655823     1.06981
  1.asplenia |    1.03308   .0541534     0.62   0.535     .9322112    1.144862
1.ra_sle_p~s |   1.059481   .0580671     1.05   0.292     .9515708    1.179627
1.other_im~o |   1.056037   .0556766     1.03   0.301     .9523614    1.170998
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod4_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod4_2ndVaccCensor.ster saved
(17,201 missing values generated)
(43,369 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    107,238  total observations
        137  observations end on or before enter()
------------------------------------------------------------------------------
    107,101  observations remaining, representing
    107,101  subjects
     31,921  failures in single-failure-per-subject data
   19045820  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(201,800 observations (episodes) created)
(cat_time: 201800 changes made)
(covidadmission: 201800 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       34.67       34.67
          1 |     82,642       26.75       61.43
          2 |     66,433       21.51       82.93
          3 |     34,638       11.21       94.14
          4 |     13,821        4.47       98.62
          5 |      4,266        1.38      100.00
------------+-----------------------------------
      Total |    308,901      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    57,743      8,690 |    66,433 
         3 |    29,859      4,779 |    34,638 
         4 |    11,603      2,218 |    13,821 
         5 |     3,910        356 |     4,266 
-----------+----------------------+----------
     Total |   276,980     31,921 |   308,901 
(304,772 observations deleted)
   1:      4.07 /        1 =       4.0690

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,266             Number of obs    =       4,266
No. of failures      =          356
Time at risk         =       181174
                                                Wald chi2(39)    =    17231.50
Log pseudolikelihood =   -2083.5264             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 909 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.84e+09   1.71e+09    22.98   0.000     2.98e+08    1.14e+10
 only 12-18  |   2.43e+09          .        .       .            .           .
      mixed  |   1.02e+09   7.14e+08    29.64   0.000     2.59e+08    4.02e+09
             |
        age1 |   1.019721   .0220492     0.90   0.366     .9774078    1.063865
        age2 |   .9483625   .0619788    -0.81   0.417     .8343445    1.077962
        age3 |   1.150256    .210654     0.76   0.445     .8033565    1.646951
      1.male |   1.101729   .1123018     0.95   0.342     .9022147    1.345364
             |
   obese4cat |
Obese I ..)  |   .8538822   .1379011    -0.98   0.328     .6221997    1.171834
Obese II..)  |   1.053564   .2024206     0.27   0.786     .7229694     1.53533
Obese II..)  |   .6773739   .1855919    -1.42   0.155     .3959223    1.158903
             |
smoke_nomiss |
     Former  |   .8023266   .3334337    -0.53   0.596     .3553088    1.811743
    Current  |   1.360308   .2129067     1.97   0.049      1.00095     1.84868
             |
         imd |
          4  |   .9467678   .1297207    -0.40   0.690     .7237968    1.238427
5 most de..  |   1.300009   .2250296     1.52   0.130     .9259861    1.825105
             |
tot_adults~h |
          2  |   23.58639          .        .       .            .           .
          3  |   3.202106   4.648203     0.80   0.423     .1861335     55.0867
             |
   ethnicity |
Asian or ..  |   .9953367   .1795585    -0.03   0.979     .6988976    1.417511
      Other  |     1.1859   .1952793     1.04   0.300     .8587815    1.637621
             |
1.htdiag_o~p |   1.088483   .1213422     0.76   0.447     .8748447    1.354291
1.~y_disease |   .8031988   .1219881    -1.44   0.149     .5964094    1.081687
    1.asthma |    .848686   .1906373    -0.73   0.465     .5464428    1.318103
1.~c_disease |   .9381043    .122931    -0.49   0.626      .725618    1.212814
             |
     diabcat |
T1DM, con..  |   1.244108   .3900932     0.70   0.486      .672917    2.300141
T1DM, unc..  |    .581329   .5934436    -0.53   0.595     .0786107    4.298947
T2DM, con..  |   1.048753   .1547014     0.32   0.747     .7854392    1.400341
T2DM, unc..  |   1.604468   .3997257     1.90   0.058       .98462    2.614528
             |
cancer_exh~t |
  Last year  |   1.03e-17   3.33e-18  -120.59   0.000     5.44e-18    1.94e-17
2-5 years..  |   1.000656   .3841609     0.00   0.999     .4715211    2.123581
   5+ years  |   1.049766   .1445844     0.35   0.724     .8014133    1.375082
             |
cancer_hae~t |
  Last year  |   1.500398   .8616737     0.71   0.480     .4868149    4.624329
2-5 years..  |   1.255265   .4741577     0.60   0.547     .5986967    2.631868
   5+ years  |   1.129696   .1527456     0.90   0.367     .8667046    1.472489
             |
1.~r_disease |   1.037569   .1392862     0.27   0.784     .7975337    1.349847
1.stroke_d~a |   .7634384   .1154048    -1.79   0.074     .5676786    1.026704
1.other_ne~o |   .8531426   .1218891    -1.11   0.266     .6447775    1.128843
             |
reduced_ki~t |
Stage 3a/..  |   1.881896   1.289647     0.92   0.356     .4912183    7.209692
      1.esrd |   1.025999   .1096157     0.24   0.810     .8321592    1.264992
1.other_tr~t |    .919082   .1252438    -0.62   0.536     .7036563    1.200461
  1.asplenia |   .9111397   .1222615    -0.69   0.488     .7004325    1.185233
1.ra_sle_p~s |   .9081422   .1250102    -0.70   0.484     .6933969    1.189394
1.other_im~o |   .9039354   .1235622    -0.74   0.460     .6914863    1.181657
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod5_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod5_2ndVaccCensor.ster saved
(4,919 missing values generated)
(12,195 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
         28  observations end on or before enter()
------------------------------------------------------------------------------
     30,193  observations remaining, representing
     30,193  subjects
      8,843  failures in single-failure-per-subject data
  5,404,796  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(57,411 observations (episodes) created)
(cat_time: 57411 changes made)
(covidadmission: 57411 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       34.47       34.47
          1 |     23,447       26.76       61.23
          2 |     18,894       21.57       82.80
          3 |      9,884       11.28       94.08
          4 |      3,977        4.54       98.62
          5 |      1,209        1.38      100.00
------------+-----------------------------------
      Total |     87,604      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    16,471      2,423 |    18,894 
         3 |     8,452      1,432 |     9,884 
         4 |     3,364        613 |     3,977 
         5 |     1,115         94 |     1,209 
-----------+----------------------+----------
     Total |    78,761      8,843 |    87,604 
(57,439 observations deleted)
   1:     16.04 /        1 =      16.0430

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       30,193             Number of obs    =      30,193
No. of failures      =        2,611
Time at risk         =      2468226
                                                Wald chi2(41)    =     1268.44
Log pseudolikelihood =   -20579.624             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,204 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.617397   .6892025     1.13   0.259     .7016231    3.728457
 only 12-18  |   .8450121   .5024853    -0.28   0.777     .2634493    2.710371
      mixed  |   1.038183   .4081976     0.10   0.924     .4803905     2.24364
             |
        age1 |    1.04165   .0182598     2.33   0.020     1.006469    1.078061
        age2 |    .776757   .0713149    -2.75   0.006     .6488367    .9298972
        age3 |   1.673247   .3032608     2.84   0.005     1.172971    2.386891
      1.male |   1.086062   .0436704     2.05   0.040     1.003755    1.175117
             |
   obese4cat |
Obese I ..)  |   1.027843   .0593547     0.48   0.634      .917852    1.151015
Obese II..)  |   1.036869   .0744058     0.50   0.614      .900827    1.193455
Obese II..)  |   1.048958   .0897667     0.56   0.576     .8869823    1.240514
             |
smoke_nomiss |
     Former  |   1.092806   .1410417     0.69   0.492     .8485624    1.407351
    Current  |   .9188003    .054735    -1.42   0.155     .8175477    1.032593
             |
         imd |
          4  |   .9846695   .0492516    -0.31   0.757     .8927189    1.086091
5 most de..  |   .9974275   .0636718    -0.04   0.968     .8801242    1.130365
             |
tot_adults~h |
          2  |   1.95e+09          .        .       .            .           .
          3  |   1.34e+09   8.27e+08    34.02   0.000     3.99e+08    4.49e+09
             |
   ethnicity |
Asian or ..  |   1.047339   .0668989     0.72   0.469     .9240948    1.187019
      Other  |   .9204166   .0633888    -1.20   0.229      .804197    1.053432
             |
1.htdiag_o~p |   1.087189   .0442942     2.05   0.040      1.00375    1.177564
1.~y_disease |   .9458875   .0466683    -1.13   0.260     .8587026    1.041924
    1.asthma |   .9746606   .0746217    -0.34   0.737     .8388492     1.13246
1.~c_disease |   .9593726   .0470462    -0.85   0.398     .8714564    1.056158
             |
     diabcat |
T1DM, con..  |   .9282818    .119628    -0.58   0.564      .721083    1.195018
T1DM, unc..  |   1.050931   .2533076     0.21   0.837     .6552509    1.685546
T2DM, con..  |   .9563939    .053215    -0.80   0.423     .8575805    1.066593
T2DM, unc..  |   .9943231    .109111    -0.05   0.959     .8019029    1.232915
Diabetes,..  |    .411318   .4048471    -0.90   0.367     .0597541    2.831314
             |
cancer_exh~t |
  Last year  |   .9421878   .3032466    -0.19   0.853     .5013895    1.770516
2-5 years..  |   .7873601   .1316735    -1.43   0.153     .5673139    1.092756
   5+ years  |   .9612689   .0504734    -0.75   0.452     .8672629    1.065465
             |
cancer_hae~t |
  Last year  |   .5800996   .2377982    -1.33   0.184     .2597601    1.295486
2-5 years..  |   1.448808   .2017012     2.66   0.008     1.102828     1.90333
   5+ years  |    1.02248   .0511209     0.44   0.657     .9270377    1.127749
             |
1.~r_disease |   1.081244    .054571     1.55   0.122     .9794064     1.19367
1.stroke_d~a |   1.012669   .0486522     0.26   0.793     .9216639    1.112659
1.other_ne~o |   .9316849   .0457546    -1.44   0.150     .8461882     1.02582
             |
reduced_ki~t |
Stage 3a/..  |   .9443799   .1041734    -0.52   0.604     .7607671    1.172308
      1.esrd |   .9824068   .0397899    -0.44   0.661     .9074352    1.063573
1.other_tr~t |   .9513014   .0474325    -1.00   0.317     .8627336    1.048961
  1.asplenia |   .9764426   .0462693    -0.50   0.615     .8898402    1.071473
1.ra_sle_p~s |   .9483026   .0460218    -1.09   0.274     .8622586    1.042933
1.other_im~o |   1.012107   .0516163     0.24   0.813     .9158326    1.118502
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod0_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod0_2ndVaccCensor.ster saved
(4,919 missing values generated)
(12,195 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
         28  observations end on or before enter()
------------------------------------------------------------------------------
     30,193  observations remaining, representing
     30,193  subjects
      8,843  failures in single-failure-per-subject data
  5,404,796  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(57,411 observations (episodes) created)
(cat_time: 57411 changes made)
(covidadmission: 57411 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       34.47       34.47
          1 |     23,447       26.76       61.23
          2 |     18,894       21.57       82.80
          3 |      9,884       11.28       94.08
          4 |      3,977        4.54       98.62
          5 |      1,209        1.38      100.00
------------+-----------------------------------
      Total |     87,604      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    16,471      2,423 |    18,894 
         3 |     8,452      1,432 |     9,884 
         4 |     3,364        613 |     3,977 
         5 |     1,115         94 |     1,209 
-----------+----------------------+----------
     Total |    78,761      8,843 |    87,604 
(64,185 observations deleted)
   1:      6.27 /        1 =       6.2740

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       23,447             Number of obs    =      23,447
No. of failures      =        1,670
Time at risk         =      1460907
                                                Wald chi2(42)    =       27.66
Log pseudolikelihood =   -12774.987             Prob > chi2      =      0.9568

                       (Std. Err. adjusted for 1,170 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5518667   .2892762    -1.13   0.257     .1975392    1.541754
 only 12-18  |   .5437091   .3888456    -0.85   0.394     .1338477    2.208626
      mixed  |   .5006544   .2295371    -1.51   0.131     .2038375     1.22968
             |
        age1 |   1.006535   .0213753     0.31   0.759     .9655005    1.049314
        age2 |    1.00376   .1126377     0.03   0.973     .8055857    1.250686
        age3 |   .9746543   .2170055    -0.12   0.908     .6299872    1.507889
      1.male |   1.042119   .0529835     0.81   0.417     .9432794    1.151315
             |
   obese4cat |
Obese I ..)  |   1.057846   .0772916     0.77   0.442     .9167047    1.220719
Obese II..)  |   .9726686   .0875888    -0.31   0.758     .8152939    1.160421
Obese II..)  |   .9648766   .1048358    -0.33   0.742     .7798068    1.193869
             |
smoke_nomiss |
     Former  |   1.144617   .1895963     0.82   0.415     .8273048    1.583633
    Current  |   .9787342   .0760016    -0.28   0.782     .8405557    1.139628
             |
         imd |
          4  |   .9571321   .0625396    -0.67   0.503     .8420809    1.087902
5 most de..  |   1.034554   .0803047     0.44   0.662     .8885476    1.204552
             |
tot_adults~h |
          2  |   1.521619   2.281257     0.28   0.779     .0805673    28.73775
          3  |   2.504542   2.979853     0.77   0.440     .2432127    25.79114
             |
   ethnicity |
Asian or ..  |   1.045209   .0834881     0.55   0.580     .8937416    1.222348
      Other  |   .9721105   .0787606    -0.35   0.727     .8293754     1.13941
             |
1.htdiag_o~p |   1.017498   .0518109     0.34   0.733     .9208533    1.124286
1.~y_disease |   1.085248   .0641705     1.38   0.166     .9664909    1.218598
    1.asthma |   .9057616    .087732    -1.02   0.307     .7491462    1.095119
1.~c_disease |   1.011221   .0612031     0.18   0.854     .8981064    1.138581
             |
     diabcat |
T1DM, con..  |   1.146782   .1690935     0.93   0.353     .8589563    1.531056
T1DM, unc..  |   .9702184    .321571    -0.09   0.927     .5066938    1.857776
T2DM, con..  |   1.045411   .0662385     0.70   0.483     .9233239    1.183642
T2DM, unc..  |    1.08322     .14076     0.62   0.538      .839666     1.39742
Diabetes,..  |   1.585545   1.153292     0.63   0.526     .3810945    6.596667
             |
cancer_exh~t |
  Last year  |   .6083099   .3090138    -0.98   0.328     .2247632    1.646359
2-5 years..  |   1.056363   .2111848     0.27   0.784       .71391    1.563085
   5+ years  |   .9244509   .0582904    -1.25   0.213     .8169813    1.046058
             |
cancer_hae~t |
  Last year  |   .7490655    .333735    -0.65   0.517     .3128092    1.793742
2-5 years..  |   .7409695   .1740249    -1.28   0.202     .4676126    1.174125
   5+ years  |   1.100965   .0694161     1.53   0.127     .9729825    1.245782
             |
1.~r_disease |    1.05906   .0640861     0.95   0.343     .9406159    1.192418
1.stroke_d~a |   1.016599   .0609628     0.27   0.784     .9038685    1.143389
1.other_ne~o |   .9944273   .0578074    -0.10   0.923      .887343    1.114435
             |
reduced_ki~t |
Stage 3a/..  |   1.038035    .130514     0.30   0.767     .8113139    1.328113
      1.esrd |   .9912449    .048966    -0.18   0.859     .8997729    1.092016
1.other_tr~t |   1.004243    .062608     0.07   0.946     .8887344    1.134764
  1.asplenia |   .9601875   .0588941    -0.66   0.508     .8514256    1.082843
1.ra_sle_p~s |    1.13526   .0655764     2.20   0.028     1.013741    1.271345
1.other_im~o |   .9611342   .0561508    -0.68   0.497     .8571478    1.077736
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod1_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod1_2ndVaccCensor.ster saved
(4,919 missing values generated)
(12,195 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
         28  observations end on or before enter()
------------------------------------------------------------------------------
     30,193  observations remaining, representing
     30,193  subjects
      8,843  failures in single-failure-per-subject data
  5,404,796  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(57,411 observations (episodes) created)
(cat_time: 57411 changes made)
(covidadmission: 57411 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       34.47       34.47
          1 |     23,447       26.76       61.23
          2 |     18,894       21.57       82.80
          3 |      9,884       11.28       94.08
          4 |      3,977        4.54       98.62
          5 |      1,209        1.38      100.00
------------+-----------------------------------
      Total |     87,604      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    16,471      2,423 |    18,894 
         3 |     8,452      1,432 |     9,884 
         4 |     3,364        613 |     3,977 
         5 |     1,115         94 |     1,209 
-----------+----------------------+----------
     Total |    78,761      8,843 |    87,604 
(68,738 observations deleted)
   1:      4.62 /        1 =       4.6160

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       18,894             Number of obs    =      18,894
No. of failures      =        2,423
Time at risk         =       898678
                                                Wald chi2(42)    =       42.21
Log pseudolikelihood =   -17595.191             Prob > chi2      =      0.4618

                       (Std. Err. adjusted for 1,136 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.095013   .4626657     0.21   0.830     .4783751    2.506511
 only 12-18  |   1.961365   1.013395     1.30   0.192     .7124605     5.39953
      mixed  |   1.169764   .4513913     0.41   0.684     .5490785     2.49208
             |
        age1 |   .9707866   .0182257    -1.58   0.114     .9357142    1.007174
        age2 |   1.187144    .118991     1.71   0.087     .9754044    1.444847
        age3 |   .7082694   .1410326    -1.73   0.083     .4794075    1.046386
      1.male |   .9570432   .0393904    -1.07   0.286     .8828713    1.037446
             |
   obese4cat |
Obese I ..)  |   1.038813   .0597633     0.66   0.508     .9280417    1.162806
Obese II..)  |   .9342041   .0679481    -0.94   0.349     .8100853     1.07734
Obese II..)  |   1.090809   .0930006     1.02   0.308     .9229467    1.289201
             |
smoke_nomiss |
     Former  |   .8240619   .1364726    -1.17   0.243      .595652    1.140058
    Current  |   1.085987   .0629933     1.42   0.155     .9692822    1.216744
             |
         imd |
          4  |    .954366   .0504178    -0.88   0.377     .8604927     1.05848
5 most de..  |   .9381577    .065384    -0.92   0.360     .8183747    1.075473
             |
tot_adults~h |
          2  |   1.023682   .8879429     0.03   0.978      .186996       5.604
          3  |   .7493798    .462381    -0.47   0.640      .223612    2.511359
             |
   ethnicity |
Asian or ..  |   1.008224   .0695929     0.12   0.906     .8806483     1.15428
      Other  |   .9176245    .062393    -1.26   0.206     .8031345    1.048435
             |
1.htdiag_o~p |   1.049687   .0456476     1.12   0.265     .9639259    1.143078
1.~y_disease |   1.024079   .0516972     0.47   0.637     .9276057    1.130586
    1.asthma |   .9858204   .0750315    -0.19   0.851     .8492045    1.144414
1.~c_disease |   1.042224   .0500795     0.86   0.389     .9485498    1.145148
             |
     diabcat |
T1DM, con..  |    .950731   .1263786    -0.38   0.704     .7326715     1.23369
T1DM, unc..  |   .8906601   .2497593    -0.41   0.680     .5140646    1.543143
T2DM, con..  |   1.007739   .0588095     0.13   0.895     .8988225    1.129854
T2DM, unc..  |   1.202772    .124068     1.79   0.073     .9826078    1.472265
Diabetes,..  |   1.779539    1.04588     0.98   0.327     .5623859    5.630933
             |
cancer_exh~t |
  Last year  |   1.588096   .4161872     1.76   0.078     .9501779     2.65429
2-5 years..  |   1.120102   .1665722     0.76   0.446     .8369013    1.499137
   5+ years  |   1.027587   .0546631     0.51   0.609     .9258451    1.140509
             |
cancer_hae~t |
  Last year  |   .9500158   .2905229    -0.17   0.867     .5217064    1.729958
2-5 years..  |   .8868202   .1547766    -0.69   0.491     .6299056     1.24852
   5+ years  |   .8882184   .0474153    -2.22   0.026     .7999826    .9861864
             |
1.~r_disease |   1.067539    .055628     1.25   0.210      .963893     1.18233
1.stroke_d~a |    1.02055   .0520106     0.40   0.690     .9235367    1.127754
1.other_ne~o |   1.077338   .0573642     1.40   0.162      .970574    1.195846
             |
reduced_ki~t |
Stage 3a/..  |   .9452655   .1002907    -0.53   0.596     .7677912    1.163763
      1.esrd |   1.072428   .0440318     1.70   0.089     .9895083    1.162296
1.other_tr~t |   1.019488   .0529877     0.37   0.710     .9207481    1.128816
  1.asplenia |   1.059171   .0557934     1.09   0.275     .9552736    1.174369
1.ra_sle_p~s |   1.058707   .0532301     1.13   0.257     .9593541     1.16835
1.other_im~o |   1.020152   .0512827     0.40   0.691     .9244322    1.125782
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod2_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod2_2ndVaccCensor.ster saved
(4,919 missing values generated)
(12,195 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
         28  observations end on or before enter()
------------------------------------------------------------------------------
     30,193  observations remaining, representing
     30,193  subjects
      8,843  failures in single-failure-per-subject data
  5,404,796  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(57,411 observations (episodes) created)
(cat_time: 57411 changes made)
(covidadmission: 57411 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       34.47       34.47
          1 |     23,447       26.76       61.23
          2 |     18,894       21.57       82.80
          3 |      9,884       11.28       94.08
          4 |      3,977        4.54       98.62
          5 |      1,209        1.38      100.00
------------+-----------------------------------
      Total |     87,604      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    16,471      2,423 |    18,894 
         3 |     8,452      1,432 |     9,884 
         4 |     3,364        613 |     3,977 
         5 |     1,115         94 |     1,209 
-----------+----------------------+----------
     Total |    78,761      8,843 |    87,604 
(77,748 observations deleted)
   1:      8.27 /        1 =       8.2670

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        9,884             Number of obs    =       9,884
No. of failures      =        1,432
Time at risk         =       328581
                                                Wald chi2(42)    =     7038.52
Log pseudolikelihood =   -9336.6063             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,035 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .7818099   .4307678    -0.45   0.655     .2655213    2.301988
 only 12-18  |   .3141577   .3092492    -1.18   0.239     .0456295    2.162967
      mixed  |   .7087495    .335824    -0.73   0.468     .2800086    1.793966
             |
        age1 |   .9935035   .0232231    -0.28   0.780     .9490139    1.040079
        age2 |   1.082378   .1362317     0.63   0.529     .8457533    1.385205
        age3 |   .8259783   .2086402    -0.76   0.449     .5034509    1.355128
      1.male |   .9550582   .0524468    -0.84   0.402     .8576029    1.063588
             |
   obese4cat |
Obese I ..)  |   .9602806   .0756445    -0.51   0.607     .8228984    1.120599
Obese II..)  |   .9203975   .0905613    -0.84   0.399     .7589664    1.116165
Obese II..)  |   1.020112   .1142566     0.18   0.859     .8190493    1.270533
             |
smoke_nomiss |
     Former  |   .9143327   .1849377    -0.44   0.658     .6150859    1.359167
    Current  |   .8560414   .0776903    -1.71   0.087     .7165454    1.022694
             |
         imd |
          4  |   .9557616   .0638623    -0.68   0.498     .8384434    1.089495
5 most de..  |   .9140391   .0808532    -1.02   0.310     .7685462    1.087075
             |
tot_adults~h |
          2  |   .9624657   2.228395    -0.02   0.987     .0102944    89.98506
          3  |   5.20e+15   1.21e+16    15.61   0.000     5.53e+13    4.89e+17
             |
   ethnicity |
Asian or ..  |   1.022059   .0992598     0.22   0.822     .8449085    1.236353
      Other  |   1.032936     .09148     0.37   0.714     .8683371    1.228736
             |
1.htdiag_o~p |   1.025071   .0585759     0.43   0.665     .9164599    1.146554
1.~y_disease |   .9411952   .0622589    -0.92   0.360     .8267491    1.071484
    1.asthma |   .7866415   .0854323    -2.21   0.027     .6358183    .9732415
1.~c_disease |   .9287972   .0608634    -1.13   0.260       .81685    1.056087
             |
     diabcat |
T1DM, con..  |   .9756526   .1652683    -0.15   0.884     .7000161    1.359823
T1DM, unc..  |   1.556724   .4618577     1.49   0.136      .870307    2.784524
T2DM, con..  |   1.016281   .0708288     0.23   0.817     .8865228    1.165031
T2DM, unc..  |   1.009069   .1441736     0.06   0.950     .7626108    1.335176
Diabetes,..  |   2.338787     2.4203     0.82   0.412     .3076963    17.77702
             |
cancer_exh~t |
  Last year  |   2.002171   .7174326     1.94   0.053     .9919562    4.041197
2-5 years..  |   1.437715   .2546185     2.05   0.040     1.016074    2.034324
   5+ years  |   .9799793   .0658152    -0.30   0.763     .8591132     1.11785
             |
cancer_hae~t |
  Last year  |   .7117554   .3512468    -0.69   0.491     .2705629    1.872377
2-5 years..  |   .8646913   .2059999    -0.61   0.542     .5420944    1.379263
   5+ years  |   1.044062   .0710887     0.63   0.527     .9136271    1.193118
             |
1.~r_disease |   1.052176   .0667006     0.80   0.422     .9292411    1.191376
1.stroke_d~a |   .9858451   .0651906    -0.22   0.829     .8660074    1.122266
1.other_ne~o |   .9964999   .0673717    -0.05   0.959     .8728285    1.137694
             |
reduced_ki~t |
Stage 3a/..  |   .8754056   .1260482    -0.92   0.355     .6601554     1.16084
      1.esrd |   .8550455   .0478703    -2.80   0.005     .7661859    .9542108
1.other_tr~t |   1.004076   .0691092     0.06   0.953     .8773638    1.149089
  1.asplenia |   .9791498   .0688858    -0.30   0.765     .8530311    1.123915
1.ra_sle_p~s |   1.056158   .0668904     0.86   0.388     .9328656    1.195745
1.other_im~o |    .994642   .0660481    -0.08   0.936     .8732603    1.132896
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod3_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod3_2ndVaccCensor.ster saved
(4,919 missing values generated)
(12,195 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
         28  observations end on or before enter()
------------------------------------------------------------------------------
     30,193  observations remaining, representing
     30,193  subjects
      8,843  failures in single-failure-per-subject data
  5,404,796  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(57,411 observations (episodes) created)
(cat_time: 57411 changes made)
(covidadmission: 57411 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       34.47       34.47
          1 |     23,447       26.76       61.23
          2 |     18,894       21.57       82.80
          3 |      9,884       11.28       94.08
          4 |      3,977        4.54       98.62
          5 |      1,209        1.38      100.00
------------+-----------------------------------
      Total |     87,604      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    16,471      2,423 |    18,894 
         3 |     8,452      1,432 |     9,884 
         4 |     3,364        613 |     3,977 
         5 |     1,115         94 |     1,209 
-----------+----------------------+----------
     Total |    78,761      8,843 |    87,604 
(83,655 observations deleted)
   1:      3.42 /        1 =       3.4150

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,977             Number of obs    =       3,977
No. of failures      =          613
Time at risk         =       196810
                                                Wald chi2(42)    =     3760.62
Log pseudolikelihood =   -3335.1755             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 889 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   3.029414   3.138747     1.07   0.285     .3975911    23.08238
 only 12-18  |   6.579156   10.25877     1.21   0.227      .309675    139.7765
      mixed  |   4.765529   5.554145     1.34   0.180     .4853442    46.79209
             |
        age1 |   .9673046   .0345925    -0.93   0.353      .901826    1.037537
        age2 |   1.238794   .2365612     1.12   0.262     .8520261    1.801131
        age3 |   .6475419   .2462235    -1.14   0.253     .3073295    1.364368
      1.male |   1.094235   .0909354     1.08   0.279      .929763    1.287801
             |
   obese4cat |
Obese I ..)  |   .8660412   .1098202    -1.13   0.257     .6754607    1.110394
Obese II..)  |   .8954004   .1265859    -0.78   0.435     .6787033    1.181285
Obese II..)  |   .9300786   .1667518    -0.40   0.686     .6544998     1.32169
             |
smoke_nomiss |
     Former  |    1.00686   .3223851     0.02   0.983      .537556     1.88588
    Current  |   1.195332   .1395642     1.53   0.126     .9508332    1.502702
             |
         imd |
          4  |   .9587167   .1036658    -0.39   0.697     .7756219    1.185033
5 most de..  |   1.063566   .1396178     0.47   0.639      .822289    1.375639
             |
tot_adults~h |
          2  |   1.90e-17   1.77e-17   -41.39   0.000     3.07e-18    1.18e-16
          3  |   .2264732   .1630608    -2.06   0.039      .055227    .9287144
             |
   ethnicity |
Asian or ..  |   .8546375   .1256636    -1.07   0.285     .6406539    1.140093
      Other  |   1.179156   .1421352     1.37   0.172     .9310384    1.493396
             |
1.htdiag_o~p |   1.014885   .0858358     0.17   0.861     .8598546    1.197868
1.~y_disease |   .9198386   .0921186    -0.83   0.404     .7559044    1.119326
    1.asthma |   1.324238   .1877525     1.98   0.048     1.002955     1.74844
1.~c_disease |   .9673127   .1038791    -0.31   0.757     .7837127    1.193925
             |
     diabcat |
T1DM, con..  |   .9842478   .2446069    -0.06   0.949     .6047312    1.601941
T1DM, unc..  |   1.460018   .7560044     0.73   0.465     .5291783    4.028232
T2DM, con..  |    1.03358   .1125361     0.30   0.762     .8349592    1.279448
T2DM, unc..  |   1.279548   .2778911     1.14   0.256     .8359749    1.958483
Diabetes,..  |   3.60e-17   3.76e-17   -36.29   0.000     4.66e-18    2.78e-16
             |
cancer_exh~t |
  Last year  |   .6396187   .6601725    -0.43   0.665     .0845993     4.83588
2-5 years..  |   .9225517   .3307573    -0.22   0.822     .4568926    1.862804
   5+ years  |   1.119332   .1182954     1.07   0.286     .9099141    1.376947
             |
cancer_hae~t |
  Last year  |   .5453162    .508197    -0.65   0.515     .0877783    3.387735
2-5 years..  |   .6744493   .2648288    -1.00   0.316     .3124043    1.456068
   5+ years  |   .9651857   .1038988    -0.33   0.742     .7815956      1.1919
             |
1.~r_disease |   .9950264   .1069823    -0.05   0.963     .8059646    1.228438
1.stroke_d~a |   .8253054   .0868649    -1.82   0.068     .6714663    1.014391
1.other_ne~o |   1.156742   .1084371     1.55   0.120     .9625915    1.390053
             |
reduced_ki~t |
Stage 3a/..  |   1.158063   .2327629     0.73   0.465     .7809912    1.717188
      1.esrd |    .950148   .0849562    -0.57   0.567      .797411    1.132141
1.other_tr~t |   1.175649   .1071389     1.78   0.076     .9833452    1.405559
  1.asplenia |   1.074792   .1044248     0.74   0.458     .8884297    1.300246
1.ra_sle_p~s |   1.009194   .1046715     0.09   0.930     .8235493    1.236686
1.other_im~o |   1.243511   .1170331     2.32   0.021     1.034043    1.495411
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod4_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod4_2ndVaccCensor.ster saved
(4,919 missing values generated)
(12,195 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     30,221  total observations
         28  observations end on or before enter()
------------------------------------------------------------------------------
     30,193  observations remaining, representing
     30,193  subjects
      8,843  failures in single-failure-per-subject data
  5,404,796  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(57,411 observations (episodes) created)
(cat_time: 57411 changes made)
(covidadmission: 57411 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       34.47       34.47
          1 |     23,447       26.76       61.23
          2 |     18,894       21.57       82.80
          3 |      9,884       11.28       94.08
          4 |      3,977        4.54       98.62
          5 |      1,209        1.38      100.00
------------+-----------------------------------
      Total |     87,604      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    16,471      2,423 |    18,894 
         3 |     8,452      1,432 |     9,884 
         4 |     3,364        613 |     3,977 
         5 |     1,115         94 |     1,209 
-----------+----------------------+----------
     Total |    78,761      8,843 |    87,604 
(86,423 observations deleted)
   1:      1.72 /        1 =       1.7150

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,209             Number of obs    =       1,209
No. of failures      =           94
Time at risk         =        51594
                                                Wald chi2(40)    =    19888.51
Log pseudolikelihood =   -408.70787             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 604 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   4.01e+09   6.18e+09    14.36   0.000     1.96e+08    8.20e+10
 only 12-18  |   3.86e+11          .        .       .            .           .
      mixed  |   3.89e+09   4.02e+09    21.39   0.000     5.14e+08    2.94e+10
             |
        age1 |   1.005096   .1041384     0.05   0.961     .8203781    1.231405
        age2 |   1.054888   .5657891     0.10   0.921     .3686928    3.018202
        age3 |     .87236   .9317441    -0.13   0.898     .1075352    7.076867
      1.male |   .6926514   .1477854    -1.72   0.085     .4559327    1.052274
             |
   obese4cat |
Obese I ..)  |    .847292   .3179416    -0.44   0.659      .406092    1.767835
Obese II..)  |   .8767097   .3415377    -0.34   0.736     .4085594    1.881293
Obese II..)  |   1.491427   .6048735     0.99   0.324     .6735704    3.302336
             |
smoke_nomiss |
     Former  |   3.79e-16   1.53e-16   -87.74   0.000     1.71e-16    8.37e-16
    Current  |   .3307233   .1782172    -2.05   0.040      .115021    .9509387
             |
         imd |
          4  |   .7867508   .2264534    -0.83   0.405     .4475409    1.383062
5 most de..  |   .4510194   .2232561    -1.61   0.108     .1709415    1.189989
             |
tot_adults~h |
          2  |   1.27e-09   2.73e-09    -9.53   0.000     1.88e-11    8.59e-08
          3  |   3.02e-11   4.60e-11   -15.91   0.000     1.53e-12    5.98e-10
             |
   ethnicity |
Asian or ..  |   1.612704   .4699123     1.64   0.101     .9110247    2.854823
      Other  |   .5546271   .2490267    -1.31   0.189      .230045    1.337178
             |
1.htdiag_o~p |   .9359094   .2263847    -0.27   0.784     .5825576    1.503588
1.~y_disease |   .9945303   .2632951    -0.02   0.983     .5919271    1.670967
    1.asthma |   1.083939   .4708737     0.19   0.853      .462631    2.539657
1.~c_disease |   .7072124   .2165012    -1.13   0.258     .3881225    1.288638
             |
     diabcat |
T1DM, con..  |   1.359312   .7072476     0.59   0.555     .4902759    3.768754
T1DM, unc..  |   3.85e-16   2.76e-16   -49.50   0.000     9.45e-17    1.57e-15
T2DM, con..  |   .5243113   .1894091    -1.79   0.074     .2582796     1.06436
T2DM, unc..  |   1.362034   .6766008     0.62   0.534     .5144543    3.606026
             |
cancer_exh~t |
  Last year  |   3.41e-16   2.18e-16   -55.63   0.000     9.71e-17    1.19e-15
2-5 years..  |   1.047342   1.120441     0.04   0.966       .12867    8.525101
   5+ years  |   .9922881   .2911492    -0.03   0.979     .5583224    1.763561
             |
cancer_hae~t |
  Last year  |   11.01151    7.84587     3.37   0.001     2.724913    44.49806
2-5 years..  |   1.681983   1.281173     0.68   0.495     .3779705    7.484885
   5+ years  |   1.236487    .311965     0.84   0.400     .7541047    2.027436
             |
1.~r_disease |   .7179658    .217984    -1.09   0.275     .3959749    1.301787
1.stroke_d~a |   1.103969   .3013034     0.36   0.717     .6466074    1.884834
1.other_ne~o |   .9001407   .2616466    -0.36   0.717     .5092008    1.591225
             |
reduced_ki~t |
Stage 3a/..  |   .5432175   .3021046    -1.10   0.273     .1826363    1.615699
      1.esrd |   1.115531   .2469101     0.49   0.621     .7228998    1.721415
1.other_tr~t |   .6573335   .1955996    -1.41   0.159     .3668578    1.177806
  1.asplenia |   .8352207   .2339081    -0.64   0.520     .4824115    1.446055
1.ra_sle_p~s |      1.229   .3310846     0.77   0.444     .7248426    2.083819
1.other_im~o |   .6977107   .2198618    -1.14   0.253     .3762234    1.293913
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod5_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod5_2ndVaccCensor.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covidadmission_2nd
> VaccCensor.log
  log type:  text
 closed on:  15 Mar 2023, 14:05:25
-------------------------------------------------------------------------------
