-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covidadmission.log
  log type:  text
 opened on:  15 Mar 2023, 14:10:43

. 
. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents ("Exposure") _tab ("exposure_level") _tab ("time_
> period") _tab ("events") _tab ("person_years") _tab ("rate") _tab ("age_sex_a
> dj_hr") _tab ("demog_adj_hr") _tab ("full_adj_hr") _n
  3. foreach period in 0 1 2 3 4 5 {
  4. forvalues x=0/1 {
  5. file write tablecontents ("age") ("`x'") _n
  6. forvalues i=`min'/`max'{
  7. local endwith "_tab"
  8. 
. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  9. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. *Omicron period +7 days: 27th December 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
 10. stsplit cat_time, at(0,85,154, 216, 263, 372, 500)
 11. recode cat_time 85=1 154=2 216=3 263=4 372=5
 12. recode `outcome' .=0 
 13. tab cat_time
 14. tab cat_time `outcome'
 15. }
 16. if "`outcome'"=="covid_test_ever" {
 17. stsplit cat_time, at(0,85,154, 216, 263, 372, 500)
 18. recode cat_time 85=1 154=2 216=3 263=4 372=5
 19. recode `outcome' .=0 
 20. tab cat_time
 21. tab cat_time `outcome'
 22. }
 23. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. *Omicron period +14 days: 3rd January 2022
. 
. if "`outcome'"=="covidadmission" {
 24. stsplit cat_time, at(0,92,161,222,270, 379, 500)
 25. recode cat_time 92=1 161=2 222=3 270=4 379=5
 26. recode `outcome' .=0 
 27. tab cat_time
 28. tab cat_time `outcome'
 29. }
 30. 
. if  "`outcome'"=="covid_death" {
 31. stsplit cat_time, at(0,92,161,222,270, 379, 500)
 32. recode cat_time 92=1 161=2 222=3 270=4 379=5
 33. recode `outcome' .=0 
 34. tab cat_time
 35. tab cat_time `outcome'
 36. }
 37. 
. keep if cat_time==`period'
 38. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents ("`variable'") _tab ("`i'") _tab ("`period'"
> ) _tab 
 39.         
.         *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 40.         local event = r(N)
 41.     bysort `variable': egen total_follow_up = total(_t)
 42.         su total_follow_up if `variable' == `i'
 43.         local person_days = r(mean)
 44.         local person_years=`person_days'/365.25
 45.         local rate = 100000*(`event'/`person_years')
 46.         
.         file write tablecontents (`event') _tab %10.0f (`person_years') _tab 
> %3.2f (`rate') _tab
 47.         drop total_follow_up
 48.         
.         
.         *models
.         foreach modeltype of any minadj demogadj fulladj  {
 49.         
.                 local noestimatesflag 0 /*reset*/
 50. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 51. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
.                 
.                 if "`modeltype'"=="minadj" {
 52.                         cap estimates use ./output/an_univariable_cox_mode
> ls_`variable'_`outcome'_AGESEX_ageband_`x'_timeperiod`period'
 53.                         if _rc!=0 local noestimatesflag 1
 54.                         }
 55.                 if "`modeltype'"=="demogadj" {
 56.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_DEMOGADJ_ageband_`x'_timeperiod`period'
 57.                         if _rc!=0 local noestimatesflag 1
 58.                         }
 59.                 if "`modeltype'"=="fulladj" {
 60.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_FULLYADJMODEL_ageband_`x'_timeperiod`period' 
 61.                         if _rc!=0 local noestimatesflag 1
 62.                         }
 63.                 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
.                 
.                 if `noestimatesflag'==0{
 64.                         cap lincom `i'.`variable', eform
 65.                         if _rc==0 file write tablecontents %4.2f (r(estima
> te)) (" (") %4.2f (r(lb)) ("-") %4.2f (r(ub)) (")") `endwith'
 66.                                 else file write tablecontents %4.2f ("ERR 
> IN MODEL") `endwith'
 67.                         }
 68.                         else file write tablecontents %4.2f ("DID NOT FIT"
> ) `endwith' 
 69.                         
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 70.                         if "`modeltype'"=="fulladj" {
 71.                                 local hr = r(estimate)
 72.                                 local lb = r(lb)
 73.                                 local ub = r(ub)
 74.                                 cap gen `variable'=.
 75.                                 testparm i.`variable'
 76.                                 *drop `variable'
.                                 }
 77.                 }       
 78.                 } /*min adj, full adj*/
 79.                 
. } /*variable levels*/
 80. 
. } /*agebands*/
 81. 
. } /*Waves*/
 82. end

. *****************************************************************************
> ******************************************
. /*Generic code to write a full row of "ref category" to the output file
> cap prog drop refline
> prog define refline
> file write tablecontents _tab _tab ("1.00 (ref)") _tab ("1.00 (ref)")  _n
> end*/
. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. cap file close tablecontents

. file open tablecontents using ./output/an_tablecontents_HRtable_`outcome'.txt
> , t w replace 
(note: file ./output/an_tablecontents_HRtable_covidadmission.txt not found)

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(272,891 observations deleted)
  31

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        345       27961           0      27961      27961

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.01
         Prob > chi2 =    0.5695
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(272,891 observations deleted)
  93

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        928       75101           0      75101      75101

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.01
         Prob > chi2 =    0.5695
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(272,891 observations deleted)
  13

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        196       15927           0      15927      15927

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.01
         Prob > chi2 =    0.5695
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(272,891 observations deleted)
  9,594

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    105,632     8605455           0    8605455    8605455

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.01
         Prob > chi2 =    0.5695
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(77,461 observations deleted)
  6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         88        7104           0       7104       7104

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    6.78
         Prob > chi2 =    0.0791
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(77,461 observations deleted)
  35

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        266       21125           0      21125      21125

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    6.78
         Prob > chi2 =    0.0791
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(77,461 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         60        4699           0       4699       4699

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    6.78
         Prob > chi2 =    0.0791
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(77,461 observations deleted)
  2,566

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     29,779     2435298           0    2435298    2435298

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    6.78
         Prob > chi2 =    0.0791
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(297,350 observations deleted)
  21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        267       41279           0      41279      41279

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    6.14
         Prob > chi2 =    0.1049
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(297,350 observations deleted)
  46

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        721      111494           0     111494     111494

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    6.14
         Prob > chi2 =    0.1049
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(297,350 observations deleted)
  17

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        152       23026           0      23026      23026

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    6.14
         Prob > chi2 =    0.1049
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(297,350 observations deleted)
  6,063

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     81,502    1.26e+07           0   1.26e+07   1.26e+07

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    6.14
         Prob > chi2 =    0.1049
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(84,207 observations deleted)
  8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         69       10681           0      10681      10681

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.36
         Prob > chi2 =    0.5008
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(84,207 observations deleted)
  14

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        189       28913           0      28913      28913

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.36
         Prob > chi2 =    0.5008
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(84,207 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         41        6322           0       6322       6322

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.36
         Prob > chi2 =    0.5008
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(84,207 observations deleted)
  1,645

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     23,148     3572115           0    3572115    3572115

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.36
         Prob > chi2 =    0.5008
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(313,559 observations deleted)
  13

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        218       47383           0      47383      47383

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.70
         Prob > chi2 =    0.4406
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(313,559 observations deleted)
  39

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        582      125650           0     125650     125650

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.70
         Prob > chi2 =    0.4406
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(313,559 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        109       23678           0      23678      23678

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.70
         Prob > chi2 =    0.4406
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(313,559 observations deleted)
  4,682

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     65,524    1.42e+07           0   1.42e+07   1.42e+07

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.70
         Prob > chi2 =    0.4406
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(88,760 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         56       12145           0      12145      12145

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.93
         Prob > chi2 =    0.5861
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(88,760 observations deleted)
  10

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        148       31747           0      31747      31747

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.93
         Prob > chi2 =    0.5861
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(88,760 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         35        7392           0       7392       7392

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.93
         Prob > chi2 =    0.5861
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(88,760 observations deleted)
  1,317

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     18,655     4029082           0    4029082    4029082

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.93
         Prob > chi2 =    0.5861
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(326,499 observations deleted)
  16

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        177       47020           0      47020      47020

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.40
         Prob > chi2 =    0.4931
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(326,499 observations deleted)
  31

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        466      123423           0     123423     123423

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.40
         Prob > chi2 =    0.4931
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(326,499 observations deleted)
  6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         89       23729           0      23729      23729

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.40
         Prob > chi2 =    0.4931
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(326,499 observations deleted)
  3,189

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     52,761    1.40e+07           0   1.40e+07   1.40e+07

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.40
         Prob > chi2 =    0.4931
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(92,486 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         46       12188           0      12188      12188

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.99
         Prob > chi2 =    0.8034
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(92,486 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        116       30980           0      30980      30980

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.99
         Prob > chi2 =    0.8034
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(92,486 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         24        6372           0       6372       6372

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.99
         Prob > chi2 =    0.8034
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(92,486 observations deleted)
  914

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     14,982     3982787           0    3982787    3982787

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.99
         Prob > chi2 =    0.8034
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(335,854 observations deleted)
  15

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        142       50596           0      50596      50596

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.47
         Prob > chi2 =    0.4813
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(335,854 observations deleted)
  47

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        377      134585           0     134585     134585

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.47
         Prob > chi2 =    0.4813
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(335,854 observations deleted)
  12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         75       26944           0      26944      26944

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.47
         Prob > chi2 =    0.4813
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(335,854 observations deleted)
  5,894

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     43,544    1.55e+07           0   1.55e+07   1.55e+07

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.47
         Prob > chi2 =    0.4813
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(95,149 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         36       12726           0      12726      12726

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.82
         Prob > chi2 =    0.8456
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(95,149 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         98       34982           0      34982      34982

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.82
         Prob > chi2 =    0.8456
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(95,149 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         20        7218           0       7218       7218

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.82
         Prob > chi2 =    0.8456
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(95,149 observations deleted)
  1,681

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     12,351     4397844           0    4397844    4397844

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.82
         Prob > chi2 =    0.8456
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(353,944 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         83       35169           0      35169      35169

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.77
         Prob > chi2 =    0.8578
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(353,944 observations deleted)
  19

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        230       97247           0      97247      97247

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.77
         Prob > chi2 =    0.8578
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(353,944 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         45       18957           0      18957      18957

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.77
         Prob > chi2 =    0.8578
(272,754 observations (episodes) created)
(cat_time: 272754 changes made)
(covidadmission: 272754 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,101       28.20       28.20
          1 |     82,642       21.76       49.95
          2 |     66,433       17.49       67.44
          3 |     53,493       14.08       81.52
          4 |     44,138       11.62       93.14
          5 |     26,048        6.86      100.00
------------+-----------------------------------
      Total |    379,855      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,370      9,731 |   107,101 
         1 |    76,495      6,147 |    82,642 
         2 |    61,695      4,738 |    66,433 
         3 |    50,251      3,242 |    53,493 
         4 |    38,170      5,968 |    44,138 
         5 |    23,953      2,095 |    26,048 
-----------+----------------------+----------
     Total |   347,934     31,921 |   379,855 
(353,944 observations deleted)
  2,066

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     25,690    1.08e+07           0   1.08e+07   1.08e+07

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.77
         Prob > chi2 =    0.8578
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(100,235 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         21        8877           0       8877       8877

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    5.72
         Prob > chi2 =    0.1261
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(100,235 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         61       25716           0      25716      25716

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    5.72
         Prob > chi2 =    0.1261
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(100,235 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         13        5400           0       5400       5400

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    5.72
         Prob > chi2 =    0.1261
(77,433 observations (episodes) created)
(cat_time: 77433 changes made)
(covidadmission: 77433 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,193       28.05       28.05
          1 |     23,447       21.79       49.84
          2 |     18,894       17.56       67.39
          3 |     15,168       14.09       81.49
          4 |     12,505       11.62       93.11
          5 |      7,419        6.89      100.00
------------+-----------------------------------
      Total |    107,626      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,582      2,611 |    30,193 
         1 |    21,777      1,670 |    23,447 
         2 |    17,560      1,334 |    18,894 
         3 |    14,246        922 |    15,168 
         4 |    10,806      1,699 |    12,505 
         5 |     6,812        607 |     7,419 
-----------+----------------------+----------
     Total |    98,783      8,843 |   107,626 
(100,235 observations deleted)
  592

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      7,324     3086608           0    3086608    3086608

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    5.72
         Prob > chi2 =    0.1261

. file write tablecontents _n

. 
. file close tablecontents

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covidadmission.log
  log type:  text
 closed on:  15 Mar 2023, 14:12:52
-------------------------------------------------------------------------------
