-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covid_death.log
  log type:  text
 opened on:  15 Mar 2023, 14:09:14

. 
. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents ("Exposure") _tab ("exposure_level") _tab ("time_
> period") _tab ("events") _tab ("person_years") _tab ("rate") _tab ("age_sex_a
> dj_hr") _tab ("demog_adj_hr") _tab ("full_adj_hr") _n
  3. foreach period in 0 1 2 3 4 5 {
  4. forvalues x=0/1 {
  5. file write tablecontents ("age") ("`x'") _n
  6. forvalues i=`min'/`max'{
  7. local endwith "_tab"
  8. 
. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  9. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. *Omicron period +7 days: 27th December 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
 10. stsplit cat_time, at(0,85,154, 216, 263, 372, 500)
 11. recode cat_time 85=1 154=2 216=3 263=4 372=5
 12. recode `outcome' .=0 
 13. tab cat_time
 14. tab cat_time `outcome'
 15. }
 16. if "`outcome'"=="covid_test_ever" {
 17. stsplit cat_time, at(0,85,154, 216, 263, 372, 500)
 18. recode cat_time 85=1 154=2 216=3 263=4 372=5
 19. recode `outcome' .=0 
 20. tab cat_time
 21. tab cat_time `outcome'
 22. }
 23. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. *Omicron period +14 days: 3rd January 2022
. 
. if "`outcome'"=="covidadmission" {
 24. stsplit cat_time, at(0,92,161,222,270, 379, 500)
 25. recode cat_time 92=1 161=2 222=3 270=4 379=5
 26. recode `outcome' .=0 
 27. tab cat_time
 28. tab cat_time `outcome'
 29. }
 30. 
. if  "`outcome'"=="covid_death" {
 31. stsplit cat_time, at(0,92,161,222,270, 379, 500)
 32. recode cat_time 92=1 161=2 222=3 270=4 379=5
 33. recode `outcome' .=0 
 34. tab cat_time
 35. tab cat_time `outcome'
 36. }
 37. 
. keep if cat_time==`period'
 38. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents ("`variable'") _tab ("`i'") _tab ("`period'"
> ) _tab 
 39.         
.         *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 40.         local event = r(N)
 41.     bysort `variable': egen total_follow_up = total(_t)
 42.         su total_follow_up if `variable' == `i'
 43.         local person_days = r(mean)
 44.         local person_years=`person_days'/365.25
 45.         local rate = 100000*(`event'/`person_years')
 46.         
.         file write tablecontents (`event') _tab %10.0f (`person_years') _tab 
> %3.2f (`rate') _tab
 47.         drop total_follow_up
 48.         
.         
.         *models
.         foreach modeltype of any minadj demogadj fulladj  {
 49.         
.                 local noestimatesflag 0 /*reset*/
 50. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 51. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
.                 
.                 if "`modeltype'"=="minadj" {
 52.                         cap estimates use ./output/an_univariable_cox_mode
> ls_`variable'_`outcome'_AGESEX_ageband_`x'_timeperiod`period'
 53.                         if _rc!=0 local noestimatesflag 1
 54.                         }
 55.                 if "`modeltype'"=="demogadj" {
 56.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_DEMOGADJ_ageband_`x'_timeperiod`period'
 57.                         if _rc!=0 local noestimatesflag 1
 58.                         }
 59.                 if "`modeltype'"=="fulladj" {
 60.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_FULLYADJMODEL_ageband_`x'_timeperiod`period' 
 61.                         if _rc!=0 local noestimatesflag 1
 62.                         }
 63.                 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
.                 
.                 if `noestimatesflag'==0{
 64.                         cap lincom `i'.`variable', eform
 65.                         if _rc==0 file write tablecontents %4.2f (r(estima
> te)) (" (") %4.2f (r(lb)) ("-") %4.2f (r(ub)) (")") `endwith'
 66.                                 else file write tablecontents %4.2f ("ERR 
> IN MODEL") `endwith'
 67.                         }
 68.                         else file write tablecontents %4.2f ("DID NOT FIT"
> ) `endwith' 
 69.                         
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 70.                         if "`modeltype'"=="fulladj" {
 71.                                 local hr = r(estimate)
 72.                                 local lb = r(lb)
 73.                                 local ub = r(ub)
 74.                                 cap gen `variable'=.
 75.                                 testparm i.`variable'
 76.                                 *drop `variable'
.                                 }
 77.                 }       
 78.                 } /*min adj, full adj*/
 79.                 
. } /*variable levels*/
 80. 
. } /*agebands*/
 81. 
. } /*Waves*/
 82. end

. *****************************************************************************
> ******************************************
. /*Generic code to write a full row of "ref category" to the output file
> cap prog drop refline
> prog define refline
> file write tablecontents _tab _tab ("1.00 (ref)") _tab ("1.00 (ref)")  _n
> end*/
. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. cap file close tablecontents

. file open tablecontents using ./output/an_tablecontents_HRtable_`outcome'.txt
> , t w replace 
(note: file ./output/an_tablecontents_HRtable_covid_death.txt not found)

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(345,960 observations deleted)
  30

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        347       29535           0      29535      29535

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.12
         Prob > chi2 =    0.7716
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(345,960 observations deleted)
  73

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        929       79313           0      79313      79313

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.12
         Prob > chi2 =    0.7716
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(345,960 observations deleted)
  19

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        197       16624           0      16624      16624

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.12
         Prob > chi2 =    0.7716
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(345,960 observations deleted)
  9,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    105,753     9037574           0    9037574    9037574

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.12
         Prob > chi2 =    0.7716
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(97,341 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         88        7364           0       7364       7364

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    7.31
         Prob > chi2 =    0.0627
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(97,341 observations deleted)
  27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        266       22557           0      22557      22557

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    7.31
         Prob > chi2 =    0.0627
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(97,341 observations deleted)
  10

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         60        4861           0       4861       4861

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    7.31
         Prob > chi2 =    0.0627
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(97,341 observations deleted)
  2,637

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     29,803     2548127           0    2548127    2548127

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    7.31
         Prob > chi2 =    0.0627
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(361,509 observations deleted)
  19

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        295       46426           0      46426      46426

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =   10.48
         Prob > chi2 =    0.0149
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(361,509 observations deleted)
  60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        804      125899           0     125899     125899

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =   10.48
         Prob > chi2 =    0.0149
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(361,509 observations deleted)
  22

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        165       25543           0      25543      25543

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =   10.48
         Prob > chi2 =    0.0149
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(361,509 observations deleted)
  6,934

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     90,413    1.42e+07           0   1.42e+07   1.42e+07

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =   10.48
         Prob > chi2 =    0.0149
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(101,708 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         74       11711           0      11711      11711

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.39
         Prob > chi2 =    0.9425
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(101,708 observations deleted)
  18

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        221       34438           0      34438      34438

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.39
         Prob > chi2 =    0.9425
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(101,708 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         45        7070           0       7070       7070

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.39
         Prob > chi2 =    0.9425
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(101,708 observations deleted)
  1,988

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     25,510     3995568           0    3995568    3995568

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.39
         Prob > chi2 =    0.9425
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(373,188 observations deleted)
  17

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        262       57075           0      57075      57075

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    7.19
         Prob > chi2 =    0.0662
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(373,188 observations deleted)
  73

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        700      152272           0     152272     152272

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    7.19
         Prob > chi2 =    0.0662
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(373,188 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        137       29893           0      29893      29893

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    7.19
         Prob > chi2 =    0.0662
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(373,188 observations deleted)
  6,002

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     78,899    1.72e+07           0   1.72e+07   1.72e+07

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    7.19
         Prob > chi2 =    0.0662
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(105,039 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         69       14992           0      14992      14992

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.21
         Prob > chi2 =    0.7512
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(105,039 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        188       40758           0      40758      40758

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.21
         Prob > chi2 =    0.7512
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(105,039 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         41        8830           0       8830       8830

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.21
         Prob > chi2 =    0.7512
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(105,039 observations deleted)
  1,755

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     22,221     4844249           0    4844249    4844249

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.21
         Prob > chi2 =    0.7512
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(383,458 observations deleted)
  13

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        223       59712           0      59712      59712

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.00
         Prob > chi2 =    0.2620
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(383,458 observations deleted)
  53

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        594      158355           0     158355     158355

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.00
         Prob > chi2 =    0.2620
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(383,458 observations deleted)
  10

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        117       31384           0      31384      31384

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.00
         Prob > chi2 =    0.2620
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(383,458 observations deleted)
  4,950

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     68,794    1.84e+07           0   1.84e+07   1.84e+07

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.00
         Prob > chi2 =    0.2620
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(108,010 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         59       15774           0      15774      15774

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.35
         Prob > chi2 =    0.7178
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(108,010 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        158       42321           0      42321      42321

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.35
         Prob > chi2 =    0.7178
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(108,010 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         33        8824           0       8824       8824

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.35
         Prob > chi2 =    0.7178
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(108,010 observations deleted)
  1,358

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     19,298     5157859           0    5157859    5157859

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.35
         Prob > chi2 =    0.7178
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(391,718 observations deleted)
  43

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        201       72846           0      72846      72846

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.00
         Prob > chi2 =    0.2613
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(391,718 observations deleted)
  100

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        513      185599           0     185599     185599

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.00
         Prob > chi2 =    0.2613
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(391,718 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        105       38668           0      38668      38668

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.00
         Prob > chi2 =    0.2613
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(391,718 observations deleted)
  10,865

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     60,649    2.20e+07           0   2.20e+07   2.20e+07

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.00
         Prob > chi2 =    0.2613
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(110,288 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         50       18191           0      18191      18191

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.46
         Prob > chi2 =    0.3263
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(110,288 observations deleted)
  23

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        139       50383           0      50383      50383

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.46
         Prob > chi2 =    0.3263
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(110,288 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         30       11018           0      11018      11018

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.46
         Prob > chi2 =    0.3263
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(110,288 observations deleted)
  3,051

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     17,051     6189042           0    6189042    6189042

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.46
         Prob > chi2 =    0.3263
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(410,109 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        134       56953           0      56953      56953

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    8.39
         Prob > chi2 =    0.0386
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(410,109 observations deleted)
  31

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        357      151495           0     151495     151495

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    8.39
         Prob > chi2 =    0.0386
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(410,109 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         79       33473           0      33473      33473

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    8.39
         Prob > chi2 =    0.0386
(345,948 observations (episodes) created)
(cat_time: 345948 changes made)
(covid_death: 345948 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.66       23.66
          1 |     91,677       20.23       43.89
          2 |     79,998       17.65       61.54
          3 |     69,728       15.39       76.93
          4 |     61,468       13.56       90.49
          5 |     43,077        9.51      100.00
------------+-----------------------------------
      Total |    453,174      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    50,449     11,019 |    61,468 
         5 |    38,130      4,947 |    43,077 
-----------+----------------------+----------
     Total |   409,751     43,423 |   453,174 
(410,109 observations deleted)
  4,902

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     42,507    1.80e+07           0   1.80e+07   1.80e+07

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    8.39
         Prob > chi2 =    0.0386
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(115,408 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         37       15675           0      15675      15675

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.35
         Prob > chi2 =    0.7179
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(115,408 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        102       43352           0      43352      43352

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.35
         Prob > chi2 =    0.7179
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(115,408 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         24       10182           0      10182      10182

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.35
         Prob > chi2 =    0.7179
(97,337 observations (episodes) created)
(cat_time: 97337 changes made)
(covid_death: 97337 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.69       23.69
          1 |     25,850       20.27       43.96
          2 |     22,519       17.65       61.61
          3 |     19,548       15.33       76.94
          4 |     17,270       13.54       90.47
          5 |     12,150        9.53      100.00
------------+-----------------------------------
      Total |    127,554      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    14,186      3,084 |    17,270 
         5 |    10,764      1,386 |    12,150 
-----------+----------------------+----------
     Total |   115,238     12,316 |   127,554 
(115,408 observations deleted)
  1,369

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     11,987     5074323           0    5074323    5074323

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.35
         Prob > chi2 =    0.7179

. file write tablecontents _n

. 
. file close tablecontents

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covid_death.log
  log type:  text
 closed on:  15 Mar 2023, 14:11:35
-------------------------------------------------------------------------------
