-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_death_s
> tratified.log
  log type:  text
 opened on:  15 Mar 2023, 14:27:49

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. replace covid_vacc_second_dose_date=. if covid_vacc_date>=covid_vacc_second_d
> ose_date
  4. replace covid_vacc_second_dose_date=. if covid_vacc_date==. 
  5. drop if covid_vacc_date<d(20dec2020)
  6. drop if covid_vacc_second_dose_date<d(20dec2020)
  7. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
  8. replace `outcome'=0 if stime_`outcome'<date_`outcome'
  9. *Drop those without any eligible follow-up
. drop if enter_date>=stime_`outcome'
 10. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 11. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 12. format first_vacc_plus_7d second_vacc_plus_7d %td
 13. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 14. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 15. 
. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 16. 
. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 17. recode `outcome' .=0 
 18. stsplit split2, after(second_vacc_plus_7d) at(0)
 19. recode `outcome' .=0 
 20. 
. stset
 21. bysort patient_id (_t): gen vaccine=_n
 22. strate vaccine if kids_cat4==0, per(100000)
 23. strate vaccine if kids_cat4==1, per(100000)
 24. 
. 
. 
. 
. foreach int_type in  vaccine  {
 25. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 26. 
. 
. *Unadjusted  model (interaction)
. stcox   i.`exposure_type'       ///
>                         i.`int_type'##i.`exposure_type' ///
>                         , strata(stp) vce(cluster household_id) 
 27. 
. if _rc==0 {
 28. *testparm 1.`int_type'#i.`exposure_type'
. di _n "kids_cat4=0 " _n "****************"
 29. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 30. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 31. lincom 0.`exposure_type' + 3.`int_type'#0.`exposure_type', eform
 32. 
. di _n "kids_cat4=1 " _n "****************"
 33. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 34. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 35. lincom 1.`exposure_type' + 3.`int_type'#1.`exposure_type', eform
 36. 
. di _n "kids_cat4=2 " _n "****************"
 37. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 38. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 39. lincom 2.`exposure_type' + 3.`int_type'#2.`exposure_type', eform
 40. 
. di _n "kids_cat4=3 " _n "****************"
 41. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 42. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 43. lincom 3.`exposure_type' + 3.`int_type'#3.`exposure_type', eform
 44. }
 45. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"             
>       
 46. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         i.`int_type'##i.`exposure_type' ///
>                         , strata(stp) vce(cluster household_id) 
 47. if _rc==0{
 48. *testparm 1.`int_type'#i.`exposure_type'
. di _n "`exposure_type' " _n "****************"
 49. 
. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 50. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 51. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 52. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 53. 
. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 54. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 55. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 56. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 57. 
. lincom 0.`exposure_type' + 3.`int_type'#0.`exposure_type', eform
 58. lincom 1.`exposure_type' + 3.`int_type'#1.`exposure_type', eform
 59. lincom 2.`exposure_type' + 3.`int_type'#2.`exposure_type', eform
 60. lincom 3.`exposure_type' + 3.`int_type'#3.`exposure_type', eform
 61. 
. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`
> int_type'_`x'_stratified, replace
 62. }
 63. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 64. }
 65. }
 66. }
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(72,676 real changes made)
(24,104 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(25,003 real changes made, 25,003 to missing)
(81,497 real changes made, 81,497 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(70,916 observations (episodes) created)
(covid_death: 70916 changes made)
(3,397 observations (episodes) created)
(covid_death: 3397 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    176,034  total observations
          0  exclusions
------------------------------------------------------------------------------
    176,034  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(777 records included in the analysis)

  +-----------------------------------------------------+
  | vaccine    D        Y      Rate     Lower     Upper |
  |-----------------------------------------------------|
  |       1   38   0.3231   117.611    85.578   161.633 |
  |       2   39   0.3548   109.906    80.301   150.425 |
  |       3   51   0.2671   190.961   145.129   251.268 |
  +-----------------------------------------------------+


         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(2022 records included in the analysis)

  +------------------------------------------------------+
  | vaccine     D        Y      Rate     Lower     Upper |
  |------------------------------------------------------|
  |       1    94   0.8952   105.002    85.783   128.527 |
  |       2   135   0.8609   156.805   132.465   185.618 |
  |       3   135   0.6864   196.675   166.146   232.814 |
  +------------------------------------------------------+


         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -152284.92
Iteration 1:   log pseudolikelihood = -152277.75
Iteration 2:   log pseudolikelihood = -152277.33
Iteration 3:   log pseudolikelihood = -152277.32
Iteration 4:   log pseudolikelihood = -152277.32
Refining estimates:
Iteration 0:   log pseudolikelihood = -152277.32

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      101,721             Number of obs    =     176,034
No. of failures      =       17,083
Time at risk         =     15503440
                                                Wald chi2(11)    =       17.16
Log pseudolikelihood =   -152277.32             Prob > chi2      =      0.1031

                       (Std. Err. adjusted for 1,370 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8856723   .1731212    -0.62   0.535     .6037954    1.299141
 only 12-18  |   1.092751     .30497     0.32   0.751      .632359    1.888332
      mixed  |   .9303457    .147132    -0.46   0.648      .682384    1.268411
             |
     vaccine |
          2  |   .7616141   .1604607    -1.29   0.196      .503964    1.150987
          3  |    .896462   .2172717    -0.45   0.652     .5574806    1.441564
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |   1.626828   .4241944     1.87   0.062     .9758686    2.712014
          2 #|
 only 12-18  |   1.885084   .6656653     1.80   0.073     .9435226    3.766249
    2#mixed  |   1.285211   .2710955     1.19   0.234     .8500149    1.943221
          3 #|
only <12 ..  |   1.176621   .3094295     0.62   0.536     .7027265    1.970093
          3 #|
 only 12-18  |   .8474437   .5778265    -0.24   0.808      .222701    3.224776
    3#mixed  |   1.210861   .2974628     0.78   0.436     .7481456    1.959758
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4=0 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

kids_cat4=1 
****************

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8856723   .1731212    -0.62   0.535     .6037954    1.299141
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.440836   .2465255     2.13   0.033     1.030327    2.014904
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.042101   .1653822     0.26   0.795     .7635251    1.422316
------------------------------------------------------------------------------

kids_cat4=2 
****************

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.092751     .30497     0.32   0.751      .632359    1.888332
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.059926   .4672373     3.19   0.001     1.320627    3.213092
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9260446   .5602863    -0.13   0.899     .2828967    3.031348
------------------------------------------------------------------------------

kids_cat4=3 
****************

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9303457    .147132    -0.46   0.648      .682384    1.268411
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.195691   .1749578     1.22   0.222     .8975691    1.592831
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.126519   .1856748     0.72   0.470     .8155341    1.556091
------------------------------------------------------------------------------

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -152284.92
Iteration 1:   log pseudolikelihood = -152260.95
Iteration 2:   log pseudolikelihood = -152260.33
Iteration 3:   log pseudolikelihood = -152260.33
Iteration 4:   log pseudolikelihood = -152260.33
Refining estimates:
Iteration 0:   log pseudolikelihood = -152260.33

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      101,721             Number of obs    =     176,034
No. of failures      =       17,083
Time at risk         =     15503440
                                                Wald chi2(50)    =       53.48
Log pseudolikelihood =   -152260.33             Prob > chi2      =      0.3423

                       (Std. Err. adjusted for 1,370 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8797039   .1729226    -0.65   0.514     .5984345    1.293172
 only 12-18  |   1.082213    .299493     0.29   0.775     .6291443    1.861553
      mixed  |     .92162   .1493988    -0.50   0.615     .6707616    1.266297
             |
        age1 |   1.002838   .0029987     0.95   0.343     .9969778    1.008732
        age2 |   .9886292    .009323    -1.21   0.225     .9705244    1.007072
        age3 |   1.038921   .0278705     1.42   0.155      .985707    1.095008
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.014668   .0164085     0.90   0.368     .9830124    1.047343
             |
   ethnicity |
Asian or ..  |   .9646478   .0246338    -1.41   0.159     .9175549    1.014158
      Other  |   1.028234    .026272     1.09   0.276     .9780095    1.081037
             |
   obese4cat |
Obese I ..)  |   .9962342   .0221829    -0.17   0.865     .9536916    1.040674
Obese II..)  |   .9734226    .027629    -0.95   0.343     .9207494    1.029109
Obese II..)  |   1.053961   .0331617     1.67   0.095     .9909285    1.121002
             |
smoke_nomiss |
     Former  |   1.108016   .0550134     2.07   0.039     1.005272    1.221261
    Current  |   .9732158   .0231736    -1.14   0.254       .92884    1.019712
             |
         imd |
          4  |   .9985106   .0191153    -0.08   0.938     .9617394    1.036688
5 most de..  |   1.003304   .0250373     0.13   0.895      .955413    1.053596
             |
tot_adults~h |
          2  |    .909269   .2265976    -0.38   0.703      .557912      1.4819
          3  |   .9748916   .1971509    -0.13   0.900      .655872    1.449084
             |
1.htdiag_o~p |   1.002576   .0166164     0.16   0.877     .9705316    1.035678
1.~y_disease |   1.023803   .0203472     1.18   0.237     .9846902     1.06447
    1.asthma |   .9979567   .0264021    -0.08   0.938     .9475283    1.051069
1.~c_disease |   .9941152   .0186878    -0.31   0.754     .9581544    1.031426
             |
     diabcat |
T1DM, con..  |   1.014309   .0483194     0.30   0.766     .9238919    1.113576
T1DM, unc..  |   .9644124   .1053672    -0.33   0.740     .7785106    1.194706
T2DM, con..  |   1.005277   .0209289     0.25   0.800     .9650825    1.047145
T2DM, unc..  |   1.036252   .0409068     0.90   0.367     .9590993    1.119611
Diabetes,..  |    1.58916   .3393067     2.17   0.030     1.045743    2.414963
             |
cancer_exh~t |
  Last year  |   1.231457   .1457863     1.76   0.079     .9764494    1.553063
2-5 years..  |    1.06976   .0678047     1.06   0.287     .9447884    1.211262
   5+ years  |   1.020263   .0199941     1.02   0.306     .9818182    1.060213
             |
cancer_hae~t |
  Last year  |   1.030814   .1203876     0.26   0.795     .8199161    1.295959
2-5 years..  |    .973888   .0636802    -0.40   0.686     .8567438     1.10705
   5+ years  |     1.0089   .0191967     0.47   0.641      .971968    1.047235
             |
1.~r_disease |   1.017683   .0189012     0.94   0.345     .9813032    1.055411
1.stroke_d~a |   1.011632   .0201781     0.58   0.562     .9728466    1.051963
1.other_ne~o |   1.016453   .0191997     0.86   0.388     .9795101    1.054789
             |
reduced_ki~t |
Stage 3a/..  |   1.008794   .1329286     0.07   0.947     .7791833    1.306066
      1.esrd |   .9919135    .015342    -0.52   0.600     .9622949    1.022444
1.other_tr~t |   .9864654    .019699    -0.68   0.495     .9486019     1.02584
  1.asplenia |   1.005778   .0184983     0.31   0.754     .9701678    1.042695
1.ra_sle_p~s |   .9874558   .0180782    -0.69   0.490     .9526514    1.023532
1.other_im~o |   .9989252   .0197702    -0.05   0.957     .9609182    1.038436
             |
     vaccine |
          2  |   .7607442   .1598835    -1.30   0.193     .5038996    1.148506
          3  |   .8894436   .2152026    -0.48   0.628     .5535649    1.429118
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |   1.631201   .4247947     1.88   0.060     .9791267     2.71754
          2 #|
 only 12-18  |   1.888884    .661985     1.81   0.070     .9503644    3.754226
    2#mixed  |   1.287259   .2708537     1.20   0.230     .8522431    1.944322
          3 #|
only <12 ..  |   1.189881   .3125951     0.66   0.508     .7110225    1.991241
          3 #|
 only 12-18  |   .8697415   .5893783    -0.21   0.837     .2304493    3.282502
    3#mixed  |    1.21849   .2987423     0.81   0.420     .7535799    1.970219
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8797039   .1729226    -0.65   0.514     .5984345    1.293172
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.082213    .299493     0.29   0.775     .6291443    1.861553
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .92162   .1493988    -0.50   0.615     .6707616    1.266297
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.434974   .2498552     2.07   0.038      1.02008    2.018616
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.044175   .4629082     3.16   0.002      1.31148    3.186212
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.186363   .1789599     1.13   0.257     .8827061    1.594481
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.046743   .1710207     0.28   0.780     .7599196    1.441825
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9412457   .5669766    -0.10   0.920     .2890454    3.065066
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.122985    .191564     0.68   0.497     .8038443     1.56883
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_0_
> stratified.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_0_stratif
> ied.ster saved
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(20,498 real changes made)
(6,792 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(6,997 real changes made, 6,997 to missing)
(22,999 real changes made, 22,999 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,048 observations (episodes) created)
(covid_death: 20048 changes made)
(916 observations (episodes) created)
(covid_death: 916 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     49,701  total observations
          0  exclusions
------------------------------------------------------------------------------
     49,701  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(189 records included in the analysis)

  +-----------------------------------------------------+
  | vaccine    D        Y      Rate     Lower     Upper |
  |-----------------------------------------------------|
  |       1    9   0.0864   104.191    54.212   200.246 |
  |       2   11   0.0897   122.576    67.883   221.337 |
  |       3   13   0.0612   212.245   123.241   365.526 |
  +-----------------------------------------------------+


         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(577 records included in the analysis)

  +-----------------------------------------------------+
  | vaccine    D        Y      Rate     Lower     Upper |
  |-----------------------------------------------------|
  |       1   32   0.2558   125.093    88.463   176.891 |
  |       2   31   0.2471   125.476    88.243   178.418 |
  |       3   33   0.1877   175.850   125.016   247.353 |
  +-----------------------------------------------------+


         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -37641.633
Iteration 1:   log pseudolikelihood = -37638.804
Iteration 2:   log pseudolikelihood = -37638.475
Iteration 3:   log pseudolikelihood = -37638.472
Iteration 4:   log pseudolikelihood = -37638.472
Refining estimates:
Iteration 0:   log pseudolikelihood = -37638.472

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       28,737             Number of obs    =      49,701
No. of failures      =        4,909
Time at risk         =      4376397
                                                Wald chi2(11)    =        7.12
Log pseudolikelihood =   -37638.472             Prob > chi2      =      0.7892

                       (Std. Err. adjusted for 1,198 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.228551   .4593539     0.55   0.582     .5903772    2.556563
 only 12-18  |   1.926683   .9654944     1.31   0.191     .7215366    5.144725
      mixed  |   1.064578   .3498057     0.19   0.849     .5590931    2.027078
             |
     vaccine |
          2  |   1.037971   .4474063     0.09   0.931     .4459481    2.415942
          3  |   1.438363   .6905002     0.76   0.449     .5613594    3.685497
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |   .8482797   .4215512    -0.33   0.741     .3202845    2.246685
          2 #|
 only 12-18  |   .8947336   .5557753    -0.18   0.858      .264825    3.022933
    2#mixed  |   .9716812   .4193371    -0.07   0.947     .4170429     2.26395
          3 #|
only <12 ..  |   .7298645   .3831007    -0.60   0.549     .2608871    2.041888
          3 #|
 only 12-18  |   .6075741   .4229612    -0.72   0.474     .1552521    2.377722
    3#mixed  |   .8231765   .4033688    -0.40   0.691     .3150587    2.150772
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4=0 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

kids_cat4=1 
****************

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.228551   .4593539     0.55   0.582     .5903772    2.556563
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.042154   .3419838     0.13   0.900     .5477844    1.982689
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8966755    .285559    -0.34   0.732     .4803504    1.673834
------------------------------------------------------------------------------

kids_cat4=2 
****************

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.926683   .9654944     1.31   0.191     .7215366    5.144725
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.723868   .6809272     1.38   0.168       .79484    3.738766
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.170603   .6999016     0.26   0.792     .3626414    3.778693
------------------------------------------------------------------------------

kids_cat4=3 
****************

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.064578   .3498057     0.19   0.849     .5590931    2.027078
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.03443   .2953934     0.12   0.906     .5910589    1.810387
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8763353   .2886517    -0.40   0.689     .4595124    1.671257
------------------------------------------------------------------------------

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -37641.633
Iteration 1:   log pseudolikelihood = -37618.048
Iteration 2:   log pseudolikelihood = -37617.224
Iteration 3:   log pseudolikelihood = -37617.211
Iteration 4:   log pseudolikelihood = -37617.211
Refining estimates:
Iteration 0:   log pseudolikelihood = -37617.211

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       28,737             Number of obs    =      49,701
No. of failures      =        4,909
Time at risk         =      4376397
                                                Wald chi2(50)    =       54.67
Log pseudolikelihood =   -37617.211             Prob > chi2      =      0.3018

                       (Std. Err. adjusted for 1,198 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9960036    .374713    -0.01   0.992     .4764583    2.082078
 only 12-18  |   1.603576   .8116747     0.93   0.351     .5946217    4.324524
      mixed  |   .8755777   .2911824    -0.40   0.689     .4562667    1.680237
             |
        age1 |   1.027482   .0135633     2.05   0.040     1.001239    1.054412
        age2 |   .8482793   .0588454    -2.37   0.018     .7404416    .9718225
        age3 |   1.391726   .1909098     2.41   0.016     1.063629     1.82103
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.000985   .0288011     0.03   0.973     .9460979    1.059056
             |
   ethnicity |
Asian or ..  |   1.072872   .0511248     1.48   0.140     .9772059    1.177903
      Other  |   1.010482   .0478142     0.22   0.826     .9209822    1.108679
             |
   obese4cat |
Obese I ..)  |   .9902298   .0400922    -0.24   0.808     .9146875    1.072011
Obese II..)  |   .9990932     .05156    -0.02   0.986     .9029801    1.105436
Obese II..)  |   .9728787   .0611497    -0.44   0.662     .8601159    1.100425
             |
smoke_nomiss |
     Former  |   .8027599   .0940282    -1.88   0.061     .6380922    1.009922
    Current  |   .9697678   .0450567    -0.66   0.509     .8853599    1.062223
             |
         imd |
          4  |   .9737856   .0353933    -0.73   0.465     .9068292    1.045686
5 most de..  |   .9872422    .048747    -0.26   0.795     .8961774     1.08756
             |
tot_adults~h |
          2  |   4.356262   2.865158     2.24   0.025     1.200245    15.81095
          3  |   3.528635   2.097947     2.12   0.034     1.100337    11.31587
             |
1.htdiag_o~p |   .9847084   .0300652    -0.50   0.614     .9275103    1.045434
1.~y_disease |   1.011407   .0346781     0.33   0.741     .9456725    1.081711
    1.asthma |   .9596758   .0477366    -0.83   0.408     .8705299    1.057951
1.~c_disease |   1.054658   .0365799     1.53   0.125     .9853458    1.128847
             |
     diabcat |
T1DM, con..  |   1.067506    .098092     0.71   0.477     .8915672    1.278163
T1DM, unc..  |    1.31658   .2147514     1.69   0.092     .9563241    1.812547
T2DM, con..  |   1.035164   .0415226     0.86   0.389     .9568985    1.119832
T2DM, unc..  |   .9787053   .0770574    -0.27   0.785     .8387517    1.142012
Diabetes,..  |   .5160834   .3759349    -0.91   0.364     .1237862     2.15163
             |
cancer_exh~t |
  Last year  |   1.381766   .2761876     1.62   0.106     .9338911    2.044433
2-5 years..  |   1.180796   .1211197     1.62   0.105     .9657463    1.443731
   5+ years  |   .9227358   .0342593    -2.17   0.030     .8579737    .9923863
             |
cancer_hae~t |
  Last year  |   1.025355    .243224     0.11   0.916      .644112    1.632253
2-5 years..  |   .9165907   .1106176    -0.72   0.470     .7235178    1.161186
   5+ years  |   1.015617    .038369     0.41   0.682     .9431319    1.093673
             |
1.~r_disease |   .9816332   .0364939    -0.50   0.618     .9126502     1.05583
1.stroke_d~a |   1.038723   .0352718     1.12   0.263     .9718414    1.110206
1.other_ne~o |   1.011062   .0370429     0.30   0.764     .9410044    1.086335
             |
reduced_ki~t |
Stage 3a/..  |   1.002969   .0746381     0.04   0.968     .8668494    1.160464
      1.esrd |   1.007785   .0311491     0.25   0.802     .9485467    1.070724
1.other_tr~t |   1.003321   .0368338     0.09   0.928     .9336644    1.078175
  1.asplenia |   1.040543   .0355492     1.16   0.245     .9731492    1.112604
1.ra_sle_p~s |   .9880891   .0351841    -0.34   0.736      .921481    1.059512
1.other_im~o |    .990207   .0339018    -0.29   0.774     .9259411    1.058933
             |
     vaccine |
          2  |    .981144   .4215072    -0.04   0.965     .4227172    2.277276
          3  |   1.328767   .6465476     0.58   0.559     .5120045    3.448451
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |   .9014346   .4446218    -0.21   0.833     .3428382    2.370168
          2 #|
 only 12-18  |   .9212118    .568602    -0.13   0.894     .2747705    3.088509
    2#mixed  |   1.025793   .4411352     0.06   0.953      .441577     2.38294
          3 #|
only <12 ..  |   .7667866   .4040507    -0.50   0.614     .2729871    2.153807
          3 #|
 only 12-18  |   .6479743   .4540797    -0.62   0.536     .1640827    2.558896
    3#mixed  |   .8816795   .4327779    -0.26   0.798     .3368939    2.307429
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9960036    .374713    -0.01   0.992     .4764583    2.082078
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.603576   .8116747     0.93   0.351     .5946217    4.324524
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8755777   .2911824    -0.40   0.689     .4562667    1.680237
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8978321   .3046892    -0.32   0.751     .4616688    1.746062
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.477233   .6006297     0.96   0.337      .665822    3.277479
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8981615   .2723068    -0.35   0.723     .4957755    1.627136
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7637222   .2505257    -0.82   0.411      .401526    1.452637
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.039076   .6318717     0.06   0.950     .3155178    3.421928
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7719789    .260313    -0.77   0.443     .3986377     1.49497
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_1_
> stratified.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_1_stratif
> ied.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_death_s
> tratified.log
  log type:  text
 closed on:  15 Mar 2023, 14:30:18
-------------------------------------------------------------------------------
