-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_tpp_pro
> b_stratified.log
  log type:  text
 opened on:  15 Mar 2023, 14:23:41

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. replace covid_vacc_second_dose_date=. if covid_vacc_date>=covid_vacc_second_d
> ose_date
  4. replace covid_vacc_second_dose_date=. if covid_vacc_date==. 
  5. drop if covid_vacc_date<d(20dec2020)
  6. drop if covid_vacc_second_dose_date<d(20dec2020)
  7. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
  8. replace `outcome'=0 if stime_`outcome'<date_`outcome'
  9. *Drop those without any eligible follow-up
. drop if enter_date>=stime_`outcome'
 10. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 11. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 12. format first_vacc_plus_7d second_vacc_plus_7d %td
 13. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 14. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 15. 
. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 16. 
. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 17. recode `outcome' .=0 
 18. stsplit split2, after(second_vacc_plus_7d) at(0)
 19. recode `outcome' .=0 
 20. 
. stset
 21. bysort patient_id (_t): gen vaccine=_n
 22. strate vaccine if kids_cat4==0, per(100000)
 23. strate vaccine if kids_cat4==1, per(100000)
 24. 
. 
. 
. 
. foreach int_type in  vaccine  {
 25. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 26. 
. 
. *Unadjusted  model (interaction)
. stcox   i.`exposure_type'       ///
>                         i.`int_type'##i.`exposure_type' ///
>                         , strata(stp) vce(cluster household_id) 
 27. 
. if _rc==0 {
 28. *testparm 1.`int_type'#i.`exposure_type'
. di _n "kids_cat4=0 " _n "****************"
 29. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 30. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 31. lincom 0.`exposure_type' + 3.`int_type'#0.`exposure_type', eform
 32. 
. di _n "kids_cat4=1 " _n "****************"
 33. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 34. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 35. lincom 1.`exposure_type' + 3.`int_type'#1.`exposure_type', eform
 36. 
. di _n "kids_cat4=2 " _n "****************"
 37. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 38. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 39. lincom 2.`exposure_type' + 3.`int_type'#2.`exposure_type', eform
 40. 
. di _n "kids_cat4=3 " _n "****************"
 41. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 42. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 43. lincom 3.`exposure_type' + 3.`int_type'#3.`exposure_type', eform
 44. }
 45. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"             
>       
 46. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         i.`int_type'##i.`exposure_type' ///
>                         , strata(stp) vce(cluster household_id) 
 47. if _rc==0{
 48. *testparm 1.`int_type'#i.`exposure_type'
. di _n "`exposure_type' " _n "****************"
 49. 
. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 50. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 51. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 52. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 53. 
. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 54. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 55. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 56. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 57. 
. lincom 0.`exposure_type' + 3.`int_type'#0.`exposure_type', eform
 58. lincom 1.`exposure_type' + 3.`int_type'#1.`exposure_type', eform
 59. lincom 2.`exposure_type' + 3.`int_type'#2.`exposure_type', eform
 60. lincom 3.`exposure_type' + 3.`int_type'#3.`exposure_type', eform
 61. 
. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`
> int_type'_`x'_stratified, replace
 62. }
 63. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 64. }
 65. }
 66. }
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(49,212 real changes made)
(52,667 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(36,475 real changes made, 36,475 to missing)
(82,806 real changes made, 82,806 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(59,411 observations (episodes) created)
(covid_tpp_prob: 59411 changes made)
(2,151 observations (episodes) created)
(covid_tpp_prob: 2151 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    163,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    163,283  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(662 records included in the analysis)

  +--------------------------------------------------+
  | vaccine    D        Y     Rate    Lower    Upper |
  |--------------------------------------------------|
  |       1   60   0.2797   214.53   166.57   276.30 |
  |       2   63   0.2335   269.82   210.78   345.39 |
  |       3   57   0.1040   547.97   422.68   710.40 |
  +--------------------------------------------------+


         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(1711 records included in the analysis)

  +---------------------------------------------------+
  | vaccine     D        Y     Rate    Lower    Upper |
  |---------------------------------------------------|
  |       1   163   0.7717   211.23   181.17   246.28 |
  |       2   169   0.6077   278.11   239.19   323.36 |
  |       3   134   0.2754   486.62   410.82   576.40 |
  +---------------------------------------------------+


         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -253003.86
Iteration 1:   log pseudolikelihood = -253001.39
Iteration 2:   log pseudolikelihood = -253001.29
Iteration 3:   log pseudolikelihood = -253001.29
Iteration 4:   log pseudolikelihood = -253001.29
Refining estimates:
Iteration 0:   log pseudolikelihood = -253001.29

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      101,721             Number of obs    =     163,283
No. of failures      =       28,779
Time at risk         =     13051954
                                                Wald chi2(11)    =        6.18
Log pseudolikelihood =   -253001.29             Prob > chi2      =      0.8608

                       (Std. Err. adjusted for 1,370 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9734982    .139586    -0.19   0.851     .7349956    1.289394
 only 12-18  |   .8470651   .1732178    -0.81   0.417     .5673527    1.264679
      mixed  |   1.003122   .1260614     0.02   0.980     .7841225    1.283286
             |
     vaccine |
          2  |   1.007461   .1764967     0.04   0.966     .7146719    1.420202
          3  |   1.176958   .2456344     0.78   0.435     .7818311    1.771777
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |   1.057509   .2152037     0.27   0.783     .7096824    1.575811
          2 #|
 only 12-18  |   1.125279   .3435883     0.39   0.699     .6185255    2.047212
    2#mixed  |   .9845976   .1726547    -0.09   0.929     .6982257    1.388423
          3 #|
only <12 ..  |   .9067112   .1925092    -0.46   0.645     .5980608    1.374651
          3 #|
 only 12-18  |   .4179422   .2696761    -1.35   0.176     .1179996    1.480307
    3#mixed  |   .8094353   .1697573    -1.01   0.313     .5366184    1.220953
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4=0 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

kids_cat4=1 
****************

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9734982    .139586    -0.19   0.851     .7349956    1.289394
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.029483   .1580149     0.19   0.850      .762024    1.390816
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8826817   .1509665    -0.73   0.466     .6312796    1.234203
------------------------------------------------------------------------------

kids_cat4=2 
****************

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8470651   .1732178    -0.81   0.417     .5673527    1.264679
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9531845   .2083247    -0.22   0.826     .6210711    1.462893
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3540242   .2084207    -1.76   0.078     .1116644    1.122409
------------------------------------------------------------------------------

kids_cat4=3 
****************

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.003122   .1260614     0.02   0.980     .7841225    1.283286
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9876713   .1314568    -0.09   0.926     .7608857    1.282051
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8119622   .1443612    -1.17   0.241     .5730573    1.150465
------------------------------------------------------------------------------

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -253003.86
Iteration 1:   log pseudolikelihood =  -252979.5
Iteration 2:   log pseudolikelihood = -252979.37
Iteration 3:   log pseudolikelihood = -252979.37
Iteration 4:   log pseudolikelihood = -252979.37
Refining estimates:
Iteration 0:   log pseudolikelihood = -252979.37

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      101,721             Number of obs    =     163,283
No. of failures      =       28,779
Time at risk         =     13051954
                                                Wald chi2(50)    =       52.46
Log pseudolikelihood =   -252979.37             Prob > chi2      =      0.3789

                       (Std. Err. adjusted for 1,370 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9202237   .1376787    -0.56   0.578     .6863434    1.233802
 only 12-18  |   .8135809   .1680121    -1.00   0.318     .5427748      1.2195
      mixed  |   .9417449   .1265153    -0.45   0.655     .7237385     1.22542
             |
        age1 |   .9983279   .0021891    -0.76   0.445     .9940467    1.002628
        age2 |   1.009289   .0069821     1.34   0.181     .9956968    1.023067
        age3 |   .9686035   .0191784    -1.61   0.107     .9317346    1.006931
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.008911   .0125585     0.71   0.476      .984595    1.033828
             |
   ethnicity |
Asian or ..  |   .9748808   .0190868    -1.30   0.194     .9381799    1.013017
      Other  |   .9845047   .0201187    -0.76   0.445      .945852    1.024737
             |
   obese4cat |
Obese I ..)  |   .9907462   .0170264    -0.54   0.589     .9579308    1.024686
Obese II..)  |   .9657829   .0205812    -1.63   0.102     .9262752    1.006976
Obese II..)  |   .9408215   .0258002    -2.22   0.026      .891589    .9927726
             |
smoke_nomiss |
     Former  |   1.017079    .042961     0.40   0.688     .9362682    1.104865
    Current  |   1.007005   .0179386     0.39   0.695     .9724524    1.042785
             |
         imd |
          4  |   .9887076   .0146625    -0.77   0.444     .9603832    1.017867
5 most de..  |   1.010961   .0198089     0.56   0.578     .9728722    1.050541
             |
tot_adults~h |
          2  |   1.210425   .2938767     0.79   0.432     .7521009    1.948047
          3  |   1.356172   .2804725     1.47   0.141     .9042244    2.034012
             |
1.htdiag_o~p |    .981884    .012787    -1.40   0.160      .957139    1.007269
1.~y_disease |   1.026773   .0148761     1.82   0.068     .9980269    1.056348
    1.asthma |   .9937536    .020888    -0.30   0.766     .9536456    1.035548
1.~c_disease |   .9752931   .0151172    -1.61   0.107     .9461095    1.005377
             |
     diabcat |
T1DM, con..  |   .9951367     .03791    -0.13   0.898     .9235407    1.072283
T1DM, unc..  |   1.121302   .0854332     1.50   0.133     .9657586    1.301897
T2DM, con..  |   .9889845   .0161759    -0.68   0.498      .957783    1.021202
T2DM, unc..  |   .9850797   .0316266    -0.47   0.640     .9250028    1.049059
Diabetes,..  |   .7544745   .1743306    -1.22   0.223     .4796937    1.186657
             |
cancer_exh~t |
  Last year  |   .9205627   .0903358    -0.84   0.399     .7594935    1.115791
2-5 years..  |   .9909644   .0468099    -0.19   0.848     .9033375    1.087091
   5+ years  |   .9916675   .0158047    -0.53   0.600     .9611697    1.023133
             |
cancer_hae~t |
  Last year  |   1.034291   .0938826     0.37   0.710     .8657233    1.235681
2-5 years..  |   .9372558   .0453941    -1.34   0.181     .8523774    1.030586
   5+ years  |     1.0034   .0156699     0.22   0.828     .9731532    1.034588
             |
1.~r_disease |   .9693244   .0146833    -2.06   0.040     .9409688    .9985346
1.stroke_d~a |   1.012315   .0146812     0.84   0.399     .9839453    1.041502
1.other_ne~o |   .9952729   .0151439    -0.31   0.755     .9660296    1.025402
             |
reduced_ki~t |
Stage 3a/..  |   .9658621   .0984385    -0.34   0.733     .7909746    1.179418
      1.esrd |   .9829109   .0117679    -1.44   0.150     .9601147    1.006248
1.other_tr~t |   .9975072   .0147593    -0.17   0.866     .9689948    1.026858
  1.asplenia |   .9853356   .0147623    -0.99   0.324     .9568228    1.014698
1.ra_sle_p~s |   .9930537   .0143528    -0.48   0.630     .9653175    1.021587
1.other_im~o |   1.006065   .0144107     0.42   0.673     .9782136     1.03471
             |
     vaccine |
          2  |   1.003244   .1767642     0.02   0.985     .7102828     1.41704
          3  |   1.187044   .2481251     0.82   0.412     .7880285    1.788099
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |   1.058151   .2161949     0.28   0.782     .7089826    1.579283
          2 #|
 only 12-18  |   1.134851   .3475021     0.41   0.680       .62272    2.068163
    2#mixed  |   .9887148   .1743574    -0.06   0.949     .6997836    1.396942
          3 #|
only <12 ..  |   .8922293   .1893506    -0.54   0.591     .5886171    1.352447
          3 #|
 only 12-18  |   .4529755   .2957369    -1.21   0.225     .1259927    1.628561
    3#mixed  |   .8042311   .1685805    -1.04   0.299     .5332791     1.21285
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9202237   .1376787    -0.56   0.578     .6863434    1.233802
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8135809   .1680121    -1.00   0.318     .5427748      1.2195
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9417449   .1265153    -0.45   0.655     .7237385     1.22542
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .973736   .1548156    -0.17   0.867     .7130295    1.329765
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .923293   .2037363    -0.36   0.718     .5991163    1.422879
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9311171   .1303583    -0.51   0.610     .7076759    1.225108
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8210506   .1457838    -1.11   0.267     .5797391    1.162806
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3685322   .2187921    -1.68   0.093     .1151144    1.179834
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7573805   .1396155    -1.51   0.132     .5277201    1.086988
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine
> _0_stratified.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine_0_stra
> tified.ster saved
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(13,827 real changes made)
(14,840 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(10,177 real changes made, 10,177 to missing)
(23,363 real changes made, 23,363 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(16,876 observations (episodes) created)
(covid_tpp_prob: 16876 changes made)
(570 observations (episodes) created)
(covid_tpp_prob: 570 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     46,183  total observations
          0  exclusions
------------------------------------------------------------------------------
     46,183  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(149 records included in the analysis)

  +---------------------------------------------------+
  | vaccine    D        Y     Rate    Lower     Upper |
  |---------------------------------------------------|
  |       1   21   0.0665   315.79   205.90    484.33 |
  |       2   24   0.0557   430.80   288.75    642.73 |
  |       3   13   0.0196   663.27   385.13   1142.27 |
  +---------------------------------------------------+


         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(482 records included in the analysis)

  +--------------------------------------------------+
  | vaccine    D        Y     Rate    Lower    Upper |
  |--------------------------------------------------|
  |       1   51   0.2103   242.49   184.29   319.07 |
  |       2   59   0.1605   367.56   284.78   474.39 |
  |       3   24   0.0771   311.32   208.67   464.48 |
  +--------------------------------------------------+


         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -62081.923
Iteration 1:   log pseudolikelihood =  -62070.35
Iteration 2:   log pseudolikelihood = -62069.724
Iteration 3:   log pseudolikelihood = -62069.604
Iteration 4:   log pseudolikelihood = -62069.561
Iteration 5:   log pseudolikelihood = -62069.545
Iteration 6:   log pseudolikelihood = -62069.539
Iteration 7:   log pseudolikelihood = -62069.537
Iteration 8:   log pseudolikelihood = -62069.536
Iteration 9:   log pseudolikelihood = -62069.536
Iteration 10:  log pseudolikelihood = -62069.536
Iteration 11:  log pseudolikelihood = -62069.536
Iteration 12:  log pseudolikelihood = -62069.536
Iteration 13:  log pseudolikelihood = -62069.536
Iteration 14:  log pseudolikelihood = -62069.536
Iteration 15:  log pseudolikelihood = -62069.536
Iteration 16:  log pseudolikelihood = -62069.536
Iteration 17:  log pseudolikelihood = -62069.536
Iteration 18:  log pseudolikelihood = -62069.536
Iteration 19:  log pseudolikelihood = -62069.536
Iteration 20:  log pseudolikelihood = -62069.536
Iteration 21:  log pseudolikelihood = -62069.536
Iteration 22:  log pseudolikelihood = -62069.536
Iteration 23:  log pseudolikelihood = -62069.536
Iteration 24:  log pseudolikelihood = -62069.536
Iteration 25:  log pseudolikelihood = -62069.536
Iteration 26:  log pseudolikelihood = -62069.536
Iteration 27:  log pseudolikelihood = -62069.536
Iteration 28:  log pseudolikelihood = -62069.536
Iteration 29:  log pseudolikelihood = -62069.536
Iteration 30:  log pseudolikelihood = -62069.536
Iteration 31:  log pseudolikelihood = -62069.536
Iteration 32:  log pseudolikelihood = -62069.536
Iteration 33:  log pseudolikelihood = -62069.536
Iteration 34:  log pseudolikelihood = -62069.536
Iteration 35:  log pseudolikelihood = -62069.536
Iteration 36:  log pseudolikelihood = -62069.536
Iteration 37:  log pseudolikelihood = -62069.536
Iteration 38:  log pseudolikelihood = -62069.536
Iteration 39:  log pseudolikelihood = -62069.536
Iteration 40:  log pseudolikelihood = -62069.536
Iteration 41:  log pseudolikelihood = -62069.536
Iteration 42:  log pseudolikelihood = -62069.536
Iteration 43:  log pseudolikelihood = -62069.536
Iteration 44:  log pseudolikelihood = -62069.536
Iteration 45:  log pseudolikelihood = -62069.536
Refining estimates:
Iteration 0:   log pseudolikelihood = -62069.536

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       28,737             Number of obs    =      46,183
No. of failures      =        8,247
Time at risk         =      3683080
                                                Wald chi2(10)    =       28.65
Log pseudolikelihood =   -62069.536             Prob > chi2      =      0.0014

                       (Std. Err. adjusted for 1,198 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .7577731   .1919477    -1.10   0.274     .4612385    1.244952
 only 12-18  |   .6730339   .2190607    -1.22   0.224     .3556196    1.273762
      mixed  |   .6709727   .1410801    -1.90   0.058     .4443544    1.013165
             |
     vaccine |
          2  |   1.021705   .2838123     0.08   0.938     .5927562    1.761063
          3  |   .7137109   .2442132    -0.99   0.324     .3649753    1.395665
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |   1.105528   .3656419     0.30   0.762     .5781543    2.113955
          2 #|
 only 12-18  |   .6047761   .3067961    -0.99   0.322     .2237637    1.634555
    2#mixed  |   .9759455   .2714378    -0.09   0.930     .5658256    1.683327
          3 #|
only <12 ..  |   .5939936   .2281858    -1.36   0.175     .2797616    1.261175
          3 #|
 only 12-18  |   3.00e-20          .        .       .            .           .
    3#mixed  |   1.328834    .440854     0.86   0.391     .6935473    2.546041
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4=0 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

kids_cat4=1 
****************

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7577731   .1919477    -1.10   0.274     .4612385    1.244952
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8377395   .1833395    -0.81   0.419     .5455358    1.286455
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4501123   .1302441    -2.76   0.006     .2552807    .7936404
------------------------------------------------------------------------------

kids_cat4=2 
****************

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6730339   .2190607    -1.22   0.224     .3556196    1.273762
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4070348    .163784    -2.23   0.025      .184979    .8956549
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.02e-20   6.57e-21  -139.33   0.000     1.07e-20    3.82e-20
------------------------------------------------------------------------------

kids_cat4=3 
****************

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6709727   .1410801    -1.90   0.058     .4443544    1.013165
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6548327   .1199251    -2.31   0.021     .4573436    .9376012
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8916113    .240309    -0.43   0.670     .5257241    1.512144
------------------------------------------------------------------------------

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -62081.923
Iteration 1:   log pseudolikelihood = -62055.708
Iteration 2:   log pseudolikelihood = -62053.472
Iteration 3:   log pseudolikelihood = -62053.305
Iteration 4:   log pseudolikelihood = -62053.263
Iteration 5:   log pseudolikelihood = -62053.247
Iteration 6:   log pseudolikelihood = -62053.241
Iteration 7:   log pseudolikelihood = -62053.239
Iteration 8:   log pseudolikelihood = -62053.239
Iteration 9:   log pseudolikelihood = -62053.238
Iteration 10:  log pseudolikelihood = -62053.238
Iteration 11:  log pseudolikelihood = -62053.238
Iteration 12:  log pseudolikelihood = -62053.238
Iteration 13:  log pseudolikelihood = -62053.238
Iteration 14:  log pseudolikelihood = -62053.238
Iteration 15:  log pseudolikelihood = -62053.238
Iteration 16:  log pseudolikelihood = -62053.238
Iteration 17:  log pseudolikelihood = -62053.238
Iteration 18:  log pseudolikelihood = -62053.238
Iteration 19:  log pseudolikelihood = -62053.238
Iteration 20:  log pseudolikelihood = -62053.238
Iteration 21:  log pseudolikelihood = -62053.238
Iteration 22:  log pseudolikelihood = -62053.238
Iteration 23:  log pseudolikelihood = -62053.238
Iteration 24:  log pseudolikelihood = -62053.238
Iteration 25:  log pseudolikelihood = -62053.238
Iteration 26:  log pseudolikelihood = -62053.238
Iteration 27:  log pseudolikelihood = -62053.238
Iteration 28:  log pseudolikelihood = -62053.238
Iteration 29:  log pseudolikelihood = -62053.238
Iteration 30:  log pseudolikelihood = -62053.238
Iteration 31:  log pseudolikelihood = -62053.238
Iteration 32:  log pseudolikelihood = -62053.238
Iteration 33:  log pseudolikelihood = -62053.238
Refining estimates:
Iteration 0:   log pseudolikelihood = -62053.238
Iteration 1:   log pseudolikelihood = -62053.238

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       28,737             Number of obs    =      46,183
No. of failures      =        8,247
Time at risk         =      3683080
                                                Wald chi2(50)    =     2902.23
Log pseudolikelihood =   -62053.238             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,198 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8821985   .2294122    -0.48   0.630     .5299254    1.468649
 only 12-18  |   .7736048   .2584954    -0.77   0.442      .401879    1.489166
      mixed  |    .792732   .1747411    -1.05   0.292     .5146322    1.221113
             |
        age1 |   .9942849   .0095579    -0.60   0.551     .9757272    1.013196
        age2 |   1.017557   .0515236     0.34   0.731     .9214219    1.123722
        age3 |   .9708515   .0975602    -0.29   0.768     .7972896    1.182196
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    1.04892   .0229696     2.18   0.029     1.004853    1.094919
             |
   ethnicity |
Asian or ..  |   1.057928   .0388899     1.53   0.126     .9843862    1.136964
      Other  |   .9884983   .0347234    -0.33   0.742     .9227315    1.058952
             |
   obese4cat |
Obese I ..)  |   .9865225   .0316706    -0.42   0.673     .9263618     1.05059
Obese II..)  |   .9878668    .038543    -0.31   0.754       .91514    1.066373
Obese II..)  |    1.00833   .0470939     0.18   0.859     .9201261    1.104989
             |
smoke_nomiss |
     Former  |   .9581213    .078232    -0.52   0.600     .8164295    1.124404
    Current  |   1.044671   .0354947     1.29   0.198     .9773688    1.116608
             |
         imd |
          4  |   1.028243   .0281568     1.02   0.309      .974511    1.084937
5 most de..  |   .9470515   .0371474    -1.39   0.165     .8769723    1.022731
             |
tot_adults~h |
          2  |   .5393575   .1904556    -1.75   0.080      .269963    1.077579
          3  |   .5304198   .1363314    -2.47   0.014     .3205082    .8778094
             |
1.htdiag_o~p |   1.016561   .0226766     0.74   0.462     .9730732    1.061992
1.~y_disease |   .9815242   .0250592    -0.73   0.465     .9336176    1.031889
    1.asthma |   1.014058   .0398454     0.36   0.722     .9388937    1.095239
1.~c_disease |   1.045598   .0285771     1.63   0.103     .9910615    1.103135
             |
     diabcat |
T1DM, con..  |   .9197153   .0685746    -1.12   0.262     .7946707    1.064436
T1DM, unc..  |   .9933695   .1382652    -0.05   0.962     .7561949    1.304932
T2DM, con..  |   1.009045   .0286816     0.32   0.751     .9543676    1.066856
T2DM, unc..  |   .9502504   .0563536    -0.86   0.390     .8459769    1.067377
Diabetes,..  |   1.308802   .4942889     0.71   0.476     .6243164    2.743741
             |
cancer_exh~t |
  Last year  |   .9221156   .1689957    -0.44   0.658      .643852    1.320641
2-5 years..  |   1.008648   .0866141     0.10   0.920     .8524046    1.193531
   5+ years  |   1.036586    .030718     1.21   0.225     .9780951    1.098575
             |
cancer_hae~t |
  Last year  |   .9979609   .1796855    -0.01   0.991      .701217    1.420282
2-5 years..  |   1.187791   .1039096     1.97   0.049     1.000635    1.409952
   5+ years  |    1.01363   .0287477     0.48   0.633     .9588231     1.07157
             |
1.~r_disease |   .9949737   .0264939    -0.19   0.850     .9443783     1.04828
1.stroke_d~a |    .978497   .0280582    -0.76   0.448     .9250207    1.035065
1.other_ne~o |    1.00464   .0269393     0.17   0.863     .9532031    1.058852
             |
reduced_ki~t |
Stage 3a/..  |   1.056776   .0614581     0.95   0.342     .9429318    1.184365
      1.esrd |   .9937827   .0225572    -0.27   0.783     .9505403    1.038992
1.other_tr~t |   1.006739   .0263512     0.26   0.797     .9563945    1.059735
  1.asplenia |   1.000559   .0267792     0.02   0.983     .9494251    1.054446
1.ra_sle_p~s |   .9939602   .0273494    -0.22   0.826     .9417762    1.049036
1.other_im~o |   .9758853    .027615    -0.86   0.388     .9232345    1.031539
             |
     vaccine |
          2  |   1.079335   .2966335     0.28   0.781     .6298258    1.849659
          3  |   .7200089   .2339971    -1.01   0.312     .3808064    1.361355
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |    1.05761   .3480561     0.17   0.865     .5548782    2.015827
          2 #|
 only 12-18  |   .5775043   .2921785    -1.09   0.278     .2142418    1.556705
    2#mixed  |   .9237265   .2542371    -0.29   0.773     .5386012    1.584235
          3 #|
only <12 ..  |   .5953744   .2221587    -1.39   0.165     .2865311     1.23711
          3 #|
 only 12-18  |   1.85e-15   1.35e-15   -46.53   0.000     4.43e-16    7.72e-15
    3#mixed  |   1.293807   .4138599     0.81   0.421     .6911766    2.421864
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8821985   .2294122    -0.48   0.630     .5299254    1.468649
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7736048   .2584954    -0.77   0.442      .401879    1.489166
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .792732   .1747411    -1.05   0.292     .5146322    1.221113
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9330218   .2089588    -0.31   0.757     .6015301    1.447192
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4467601   .1826582    -1.97   0.049     .2004749    .9956091
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7322676   .1416705    -1.61   0.107      .501175    1.069917
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5252384   .1522712    -2.22   0.026     .2975676    .9271013
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.43e-15   9.81e-16   -49.88   0.000     3.74e-16    5.48e-15
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.025642   .2817747     0.09   0.927     .5986117    1.757302
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine
> _1_stratified.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine_1_stra
> tified.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_tpp_pro
> b_stratified.log
  log type:  text
 closed on:  15 Mar 2023, 14:26:20
-------------------------------------------------------------------------------
