-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_sex_covid_tpp_prob.lo
> g
  log type:  text
 opened on:  15 Mar 2023, 14:13:36

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 12. stsplit cat_time, at(0,92,161,222,270, 400)
 13. recode cat_time 92=1 161=2 222=3 270=4
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18.  
. foreach int_type in  male  {
 19. 
. tab male `outcome'
 20. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 21. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         1.`int_type'#0.`exposure_type' 1.`int_type'#1.`exposu
> re_type' 1.`int_type'#2.`exposure_type' 1.`int_type'#3.`exposure_type' ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id) 
 22.         if _rc==0{
 23. testparm 1.`int_type'#i.`exposure_type'
 24. di _n "`exposure_type' " _n "****************"
 25. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 26. di "`exposure_type'" _n "****************"
 27. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 28. di "`exposure_type'" _n "****************"
 29. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 30. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_timeperiod`period', replace
 31. }
 32. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 33. }
 34. drop cat_time
 35. }
 36. }
 37. }
(220,644 observations (episodes) created)
(cat_time: 210664 changes made)
(covid_tpp_prob: 220644 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       32.70       32.70
          1 |     78,089       23.82       56.52
          2 |     58,050       17.71       74.23
          3 |     42,487       12.96       87.18
          4 |     32,038        9.77       96.96
        400 |      9,980        3.04      100.00
------------+-----------------------------------
      Total |    327,870      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    44,601     13,449 |    58,050 
         3 |    33,640      8,847 |    42,487 
         4 |    14,574     17,464 |    32,038 
       400 |     7,924      2,056 |     9,980 
-----------+----------------------+----------
     Total |   242,020     85,850 |   327,870 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,202     43,913 |   168,115 
         1 |   117,819     41,948 |   159,767 
-----------+----------------------+----------
     Total |   242,021     85,861 |   327,882 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -240349.78
Iteration 1:   log pseudolikelihood = -240333.32
Iteration 2:   log pseudolikelihood = -240333.29
Iteration 3:   log pseudolikelihood = -240333.29
Refining estimates:
Iteration 0:   log pseudolikelihood = -240333.29

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      107,226             Number of obs    =     107,226
No. of failures      =       26,318
Time at risk         =      7859535
                                                Wald chi2(45)    =       33.11
Log pseudolikelihood =   -240333.29             Prob > chi2      =      0.9053

                       (Std. Err. adjusted for 1,373 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8721713   .1569083    -0.76   0.447     .6130079    1.240902
 only 12-18  |   .9494801   .2503608    -0.20   0.844     .5662906    1.591961
      mixed  |   .9551198   .1458517    -0.30   0.764      .708068     1.28837
             |
        age1 |   1.001597   .0024049     0.66   0.506     .9968949    1.006322
        age2 |   .9925502   .0074923    -0.99   0.322     .9779737    1.007344
        age3 |   1.025012   .0219822     1.15   0.249     .9828209    1.069015
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.008198   .2122443     0.04   0.969     .6673475    1.523138
             |
   ethnicity |
Asian or ..  |   .9899692   .0204117    -0.49   0.625     .9507606    1.030795
      Other  |   .9888848   .0210991    -0.52   0.600     .9483841    1.031115
             |
   obese4cat |
Obese I ..)  |   1.001252   .0179919     0.07   0.944     .9666026    1.037144
Obese II..)  |   .9677303   .0221255    -1.43   0.151     .9253225    1.012082
Obese II..)  |   1.003111   .0272935     0.11   0.909     .9510186    1.058058
             |
smoke_nomiss |
     Former  |    1.09033   .0463549     2.03   0.042     1.003159    1.185077
    Current  |   .9699824   .0186882    -1.58   0.114     .9340372    1.007311
             |
         imd |
          4  |   .9908257    .014574    -0.63   0.531      .962669    1.019806
5 most de..  |   1.003263   .0207119     0.16   0.875     .9634792     1.04469
             |
tot_adults~h |
          2  |   .7124927   .2336034    -1.03   0.301     .3747131    1.354759
          3  |   .9830517   .2433867    -0.07   0.945     .6051087    1.597053
             |
1.htdiag_o~p |   .9907777   .0135785    -0.68   0.499     .9645186    1.017752
1.~y_disease |   1.024051   .0146665     1.66   0.097     .9957055    1.053204
    1.asthma |   1.020547   .0223499     0.93   0.353      .977669    1.065306
1.~c_disease |   1.013679   .0161407     0.85   0.394     .9825327    1.045813
             |
     diabcat |
T1DM, con..  |   1.009308   .0390785     0.24   0.811       .93555    1.088882
T1DM, unc..  |   1.131401   .0935984     1.49   0.136     .9620521    1.330561
T2DM, con..  |   1.002656    .016806     0.16   0.874     .9702518    1.036142
T2DM, unc..  |    1.00202   .0320929     0.06   0.950     .9410526    1.066937
Diabetes,..  |    1.17241   .2129434     0.88   0.381     .8212529    1.673718
             |
cancer_exh~t |
  Last year  |   .9832373   .1008436    -0.16   0.869     .8041864    1.202154
2-5 years..  |   1.026628   .0500412     0.54   0.590     .9330884    1.129545
   5+ years  |   .9826178   .0157535    -1.09   0.274     .9522216    1.013984
             |
cancer_hae~t |
  Last year  |   1.028071   .0974709     0.29   0.770     .8537315    1.238013
2-5 years..  |   .9263818   .0496092    -1.43   0.153     .8340783      1.0289
   5+ years  |   .9956871   .0163516    -0.26   0.792     .9641488    1.028257
             |
1.~r_disease |   .9814591   .0152263    -1.21   0.228     .9520652    1.011761
1.stroke_d~a |   1.004283   .0155839     0.28   0.783     .9741992    1.035296
1.other_ne~o |   .9957427   .0151919    -0.28   0.780     .9664078    1.025968
             |
reduced_ki~t |
Stage 3a/..  |   .9501832   .0974874    -0.50   0.618     .7770972    1.161821
      1.esrd |    .997997   .0126642    -0.16   0.874     .9734818     1.02313
1.other_tr~t |    1.00408   .0150019     0.27   0.785     .9751029    1.033917
  1.asplenia |   .9719437   .0144338    -1.92   0.055     .9440617    1.000649
1.ra_sle_p~s |   1.006435   .0150098     0.43   0.667     .9774426    1.036288
1.other_im~o |   1.008204   .0153105     0.54   0.591      .978638    1.038663
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.034726   .2738617     0.13   0.897      .615938    1.738255
          1 #|
 only 12-18  |   1.012334   .3541583     0.04   0.972     .5099603    2.009606
    1#mixed  |   .9971331   .2102848    -0.01   0.989     .6595439    1.507518
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    0.06
         Prob > chi2 =    0.9965

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .902458   .1596051    -0.58   0.562     .6380974    1.276342
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9611907   .2080261    -0.18   0.855     .6289092    1.469032
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9523815   .1363821    -0.34   0.733      .719313    1.260968
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_
> timeperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_timeper
> iod0.ster saved
(no new episodes generated)
(cat_time: 210664 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       32.70       32.70
          1 |     78,089       23.82       56.52
          2 |     58,050       17.71       74.23
          3 |     42,487       12.96       87.18
          4 |     32,038        9.77       96.96
        400 |      9,980        3.04      100.00
------------+-----------------------------------
      Total |    327,870      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    44,601     13,449 |    58,050 
         3 |    33,640      8,847 |    42,487 
         4 |    14,574     17,464 |    32,038 
       400 |     7,924      2,056 |     9,980 
-----------+----------------------+----------
     Total |   242,020     85,850 |   327,870 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,202     43,913 |   168,115 
         1 |   117,819     41,948 |   159,767 
-----------+----------------------+----------
     Total |   242,021     85,861 |   327,882 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -156342.52
Iteration 1:   log pseudolikelihood = -156324.56
Iteration 2:   log pseudolikelihood = -156324.54
Iteration 3:   log pseudolikelihood = -156324.54
Refining estimates:
Iteration 0:   log pseudolikelihood = -156324.54

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       78,089             Number of obs    =      78,089
No. of failures      =       17,716
Time at risk         =      4686825
                                                Wald chi2(45)    =       35.72
Log pseudolikelihood =   -156324.54             Prob > chi2      =      0.8373

                       (Std. Err. adjusted for 1,341 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9688662   .2089236    -0.15   0.883     .6349114    1.478477
 only 12-18  |    .985938    .282305    -0.05   0.961     .5625017    1.728126
      mixed  |   .9592006   .1744521    -0.23   0.819     .6715825    1.369997
             |
        age1 |   .9970215   .0027973    -1.06   0.288      .991554    1.002519
        age2 |   1.010199   .0091499     1.12   0.263     .9924234    1.028292
        age3 |   .9712547   .0252474    -1.12   0.262     .9230102    1.022021
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.254702   .3049564     0.93   0.351     .7792111    2.020346
             |
   ethnicity |
Asian or ..  |   .9486407   .0246954    -2.03   0.043     .9014527    .9982988
      Other  |   1.004667   .0247035     0.19   0.850     .9573974    1.054271
             |
   obese4cat |
Obese I ..)  |   .9673285   .0215784    -1.49   0.136     .9259468     1.01056
Obese II..)  |   .9554765   .0260694    -1.67   0.095     .9057234    1.007962
Obese II..)  |   .9430462   .0316964    -1.74   0.081     .8829245    1.007262
             |
smoke_nomiss |
     Former  |     1.0091   .0521141     0.18   0.861     .9119579    1.116591
    Current  |   1.027298   .0229648     1.20   0.228     .9832597    1.073309
             |
         imd |
          4  |   .9942935   .0191039    -0.30   0.766     .9575467     1.03245
5 most de..  |   1.000919   .0257191     0.04   0.971     .9517591    1.052619
             |
tot_adults~h |
          2  |   .8067862   .3191361    -0.54   0.587     .3715808    1.751716
          3  |   1.125325   .3456203     0.38   0.701     .6163811    2.054504
             |
1.htdiag_o~p |   .9949671   .0159943    -0.31   0.754     .9641075    1.026814
1.~y_disease |   1.033157   .0186321     1.81   0.070      .997277    1.070329
    1.asthma |   .9900815   .0276486    -0.36   0.721     .9373475    1.045782
1.~c_disease |   .9879212   .0184796    -0.65   0.516     .9523577    1.024813
             |
     diabcat |
T1DM, con..  |   1.008482   .0467683     0.18   0.855     .9208605    1.104442
T1DM, unc..  |   1.112158   .1100638     1.07   0.283     .9160682    1.350221
T2DM, con..  |   1.002606   .0204589     0.13   0.899     .9632989    1.043517
T2DM, unc..  |   1.030894   .0406172     0.77   0.440     .9542819    1.113657
Diabetes,..  |    1.11787   .2716695     0.46   0.647     .6942705    1.799923
             |
cancer_exh~t |
  Last year  |    1.01226    .121645     0.10   0.919     .7998378    1.281099
2-5 years..  |    1.06143   .0670211     0.94   0.345     .9378737    1.201263
   5+ years  |   1.043752   .0206941     2.16   0.031     1.003971     1.08511
             |
cancer_hae~t |
  Last year  |   1.017866   .1192754     0.15   0.880     .8089939    1.280666
2-5 years..  |   .9706832    .061967    -0.47   0.641      .856521    1.100062
   5+ years  |   1.008122   .0199596     0.41   0.683     .9697512    1.048011
             |
1.~r_disease |   .9966624   .0190234    -0.18   0.861     .9600661    1.034654
1.stroke_d~a |   1.024794   .0192365     1.30   0.192     .9877764    1.063199
1.other_ne~o |   .9866965   .0186505    -0.71   0.479     .9508111    1.023936
             |
reduced_ki~t |
Stage 3a/..  |   .8982304   .1226831    -0.79   0.432      .687271    1.173944
      1.esrd |   .9779413   .0156061    -1.40   0.162     .9478273    1.009012
1.other_tr~t |   1.008232   .0186187     0.44   0.657      .972392    1.045392
  1.asplenia |   .9933541   .0185967    -0.36   0.722     .9575658     1.03048
1.ra_sle_p~s |    .980973   .0180133    -1.05   0.295     .9462952    1.016921
1.other_im~o |   .9829394   .0182955    -0.92   0.355     .9477272     1.01946
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .8416488   .2434088    -0.60   0.551     .4774846    1.483551
          1 #|
 only 12-18  |   .7752545   .3144202    -0.63   0.530     .3501243    1.716589
    1#mixed  |   .7999857   .1948001    -0.92   0.359     .4963762    1.289299
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    0.95
         Prob > chi2 =    0.8141

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8154451   .1620002    -1.03   0.304     .5524475    1.203645
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7643529   .2095493    -0.98   0.327     .4466165    1.308136
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7673468   .1346022    -1.51   0.131      .544102    1.082189
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_
> timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_timeper
> iod1.ster saved
(no new episodes generated)
(cat_time: 210664 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       32.70       32.70
          1 |     78,089       23.82       56.52
          2 |     58,050       17.71       74.23
          3 |     42,487       12.96       87.18
          4 |     32,038        9.77       96.96
        400 |      9,980        3.04      100.00
------------+-----------------------------------
      Total |    327,870      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    44,601     13,449 |    58,050 
         3 |    33,640      8,847 |    42,487 
         4 |    14,574     17,464 |    32,038 
       400 |     7,924      2,056 |     9,980 
-----------+----------------------+----------
     Total |   242,020     85,850 |   327,870 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,202     43,913 |   168,115 
         1 |   117,819     41,948 |   159,767 
-----------+----------------------+----------
     Total |   242,021     85,861 |   327,882 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -114614.14
Iteration 1:   log pseudolikelihood =  -114598.1
Iteration 2:   log pseudolikelihood = -114597.95
Iteration 3:   log pseudolikelihood = -114597.95
Refining estimates:
Iteration 0:   log pseudolikelihood = -114597.95

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       58,050             Number of obs    =      58,050
No. of failures      =       13,449
Time at risk         =      3112250
                                                Wald chi2(45)    =       37.35
Log pseudolikelihood =   -114597.95             Prob > chi2      =      0.7840

                       (Std. Err. adjusted for 1,304 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9607617   .2129424    -0.18   0.857     .6222374    1.483458
 only 12-18  |   .8025544   .2644409    -0.67   0.504     .4207308    1.530892
      mixed  |   .7991531   .1541531    -1.16   0.245     .5475665    1.166334
             |
        age1 |   .9997062    .003111    -0.09   0.925     .9936272    1.005822
        age2 |   .9949597   .0098824    -0.51   0.611     .9757779    1.014519
        age3 |   1.021354   .0288903     0.75   0.455     .9662715    1.079578
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .7873238   .2054054    -0.92   0.359     .4721531    1.312877
             |
   ethnicity |
Asian or ..  |   .9939422   .0286466    -0.21   0.833     .9393523    1.051704
      Other  |     .98242   .0287244    -0.61   0.544      .927704    1.040363
             |
   obese4cat |
Obese I ..)  |   .9995892   .0264457    -0.02   0.988     .9490775    1.052789
Obese II..)  |   .9987929   .0307996    -0.04   0.969     .9402148    1.061021
Obese II..)  |   1.010132    .037543     0.27   0.786     .9391654    1.086462
             |
smoke_nomiss |
     Former  |   1.055919   .0665735     0.86   0.388     .9331767    1.194805
    Current  |   .9864954   .0254099    -0.53   0.598     .9379292    1.037576
             |
         imd |
          4  |   .9789095    .021183    -0.99   0.325     .9382596    1.021321
5 most de..  |   1.006891    .030528     0.23   0.821     .9488006    1.068539
             |
tot_adults~h |
          2  |    1.45922   .5970618     0.92   0.356     .6543933    3.253888
          3  |   1.098656   .3841421     0.27   0.788     .5536582    2.180129
             |
1.htdiag_o~p |   .9818722   .0184561    -0.97   0.330      .946357     1.01872
1.~y_disease |   1.001667   .0214976     0.08   0.938     .9604068    1.044701
    1.asthma |   1.020059    .033147     0.61   0.541      .957118     1.08714
1.~c_disease |   .9835178   .0206036    -0.79   0.428     .9439534    1.024741
             |
     diabcat |
T1DM, con..  |   1.002177   .0570506     0.04   0.970     .8963724    1.120471
T1DM, unc..  |   1.127397   .1384843     0.98   0.329     .8861739    1.434282
T2DM, con..  |    .961484   .0227202    -1.66   0.096     .9179688    1.007062
T2DM, unc..  |   .9917789   .0463722    -0.18   0.860     .9049313    1.086961
Diabetes,..  |   .8945412   .2921167    -0.34   0.733      .471668    1.696541
             |
cancer_exh~t |
  Last year  |   .9792223   .1402474    -0.15   0.883     .7395532    1.296562
2-5 years..  |   .9325664    .067044    -0.97   0.331     .8100003    1.073679
   5+ years  |   .9823847   .0220133    -0.79   0.428     .9401733    1.026491
             |
cancer_hae~t |
  Last year  |   1.191966   .1430329     1.46   0.143     .9421537    1.508016
2-5 years..  |   .9737151   .0732067    -0.35   0.723     .8403035    1.128308
   5+ years  |   1.029384   .0227638     1.31   0.190     .9857212    1.074982
             |
1.~r_disease |   1.002908   .0218737     0.13   0.894     .9609399    1.046709
1.stroke_d~a |   1.004354   .0206788     0.21   0.833     .9646308    1.045712
1.other_ne~o |   .9588589   .0212233    -1.90   0.058     .9181514    1.001371
             |
reduced_ki~t |
Stage 3a/..  |   .9970667    .140849    -0.02   0.983     .7559283    1.315127
      1.esrd |      .9769   .0173021    -1.32   0.187     .9435704    1.011407
1.other_tr~t |   1.008414   .0214589     0.39   0.694     .9672207    1.051362
  1.asplenia |   1.008769    .021171     0.42   0.677     .9681166    1.051129
1.ra_sle_p~s |   1.003361   .0218938     0.15   0.878     .9613541    1.047202
1.other_im~o |   .9870695   .0221271    -0.58   0.562       .94464    1.031405
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.266431   .3847961     0.78   0.437     .6981518    2.297276
          1 #|
 only 12-18  |   1.580713   .6575337     1.10   0.271     .6994815     3.57215
    1#mixed  |   1.303131   .3406784     1.01   0.311     .7806532    2.175296
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    1.41
         Prob > chi2 =    0.7038

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.216738   .3090805     0.77   0.440     .7395571    2.001809
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.268608    .437313     0.69   0.490     .6455089    2.493174
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.041401   .2429355     0.17   0.862     .6592529     1.64507
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_
> timeperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_timeper
> iod2.ster saved
(no new episodes generated)
(cat_time: 210664 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       32.70       32.70
          1 |     78,089       23.82       56.52
          2 |     58,050       17.71       74.23
          3 |     42,487       12.96       87.18
          4 |     32,038        9.77       96.96
        400 |      9,980        3.04      100.00
------------+-----------------------------------
      Total |    327,870      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    44,601     13,449 |    58,050 
         3 |    33,640      8,847 |    42,487 
         4 |    14,574     17,464 |    32,038 
       400 |     7,924      2,056 |     9,980 
-----------+----------------------+----------
     Total |   242,020     85,850 |   327,870 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,202     43,913 |   168,115 
         1 |   117,819     41,948 |   159,767 
-----------+----------------------+----------
     Total |   242,021     85,861 |   327,882 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -72752.172
Iteration 1:   log pseudolikelihood = -72736.424
Iteration 2:   log pseudolikelihood = -72736.383
Iteration 3:   log pseudolikelihood = -72736.383
Refining estimates:
Iteration 0:   log pseudolikelihood = -72736.383

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       42,487             Number of obs    =      42,487
No. of failures      =        8,847
Time at risk         =      1752809
                                                Wald chi2(45)    =       32.44
Log pseudolikelihood =   -72736.383             Prob > chi2      =      0.9192

                       (Std. Err. adjusted for 1,255 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    .720853   .2294833    -1.03   0.304     .3862486    1.345323
 only 12-18  |   .7304413   .3377568    -0.68   0.497     .2951134    1.807931
      mixed  |   .8252089   .2128845    -0.74   0.456     .4977072    1.368214
             |
        age1 |   .9978758   .0039086    -0.54   0.587     .9902444    1.005566
        age2 |   1.003349   .0124629     0.27   0.788     .9792167    1.028075
        age3 |   .9944797   .0353662    -0.16   0.876     .9275237    1.066269
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.008699    .358885     0.02   0.981     .5022413    2.025865
             |
   ethnicity |
Asian or ..  |   1.004727    .035963     0.13   0.895     .9366565    1.077745
      Other  |    .944784   .0349211    -1.54   0.124     .8787603    1.015768
             |
   obese4cat |
Obese I ..)  |   1.015406   .0328269     0.47   0.636     .9530625    1.081828
Obese II..)  |   1.024346     .04046     0.61   0.543     .9480374    1.106796
Obese II..)  |   1.048286   .0460266     1.07   0.283     .9618477    1.142491
             |
smoke_nomiss |
     Former  |   .9580074   .0755929    -0.54   0.587     .8207362    1.118238
    Current  |   1.052561    .032916     1.64   0.101     .9899846    1.119094
             |
         imd |
          4  |   .9989712   .0267518    -0.04   0.969     .9478908    1.052804
5 most de..  |   1.022814   .0374676     0.62   0.538     .9519531    1.098949
             |
tot_adults~h |
          2  |   .9664575   .6003162    -0.05   0.956     .2860606    3.265183
          3  |   1.442838   .6922817     0.76   0.445     .5633861    3.695122
             |
1.htdiag_o~p |   1.005637   .0237769     0.24   0.812     .9600981    1.053335
1.~y_disease |   .9882277   .0259809    -0.45   0.652     .9385958    1.040484
    1.asthma |   1.013767   .0412256     0.34   0.737     .9361021    1.097875
1.~c_disease |   .9684488   .0258309    -1.20   0.229     .9191218    1.020423
             |
     diabcat |
T1DM, con..  |   1.100134   .0708137     1.48   0.138     .9697398    1.248061
T1DM, unc..  |   1.056031   .1591954     0.36   0.718     .7858847    1.419039
T2DM, con..  |   1.001804   .0287879     0.06   0.950     .9469406    1.059847
T2DM, unc..  |   1.099658   .0618963     1.69   0.091     .9847961    1.227918
Diabetes,..  |   1.350637   .4569119     0.89   0.374      .695957    2.621167
             |
cancer_exh~t |
  Last year  |   1.030305   .1770111     0.17   0.862     .7357417      1.4428
2-5 years..  |    .987205   .0860146    -0.15   0.883     .8322287    1.171041
   5+ years  |   .9867761   .0271222    -0.48   0.628     .9350242    1.041392
             |
cancer_hae~t |
  Last year  |   .7938148   .1468666    -1.25   0.212     .5523766    1.140783
2-5 years..  |   .9215924   .0829825    -0.91   0.365     .7724931    1.099469
   5+ years  |   1.024385    .028937     0.85   0.394     .9692115      1.0827
             |
1.~r_disease |   .9972996   .0260315    -0.10   0.917      .947562    1.049648
1.stroke_d~a |    .987707   .0264255    -0.46   0.644     .9372486    1.040882
1.other_ne~o |   1.035723   .0278533     1.31   0.192     .9825458    1.091779
             |
reduced_ki~t |
Stage 3a/..  |   .9551978    .158494    -0.28   0.782     .6900097    1.322304
      1.esrd |   .9862726   .0213064    -0.64   0.522     .9453845    1.028929
1.other_tr~t |   1.023085   .0259938     0.90   0.369      .973386    1.075322
  1.asplenia |   1.001847    .027424     0.07   0.946     .9495138    1.057065
1.ra_sle_p~s |    .988758   .0248556    -0.45   0.653     .9412225    1.038694
1.other_im~o |   .9989819   .0268274    -0.04   0.970      .947761    1.052971
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |     1.2953   .5722739     0.59   0.558     .5448823    3.079201
          1 #|
 only 12-18  |   .9290664   .6479652    -0.11   0.916     .2368031    3.645072
    1#mixed  |   .9395591    .334973    -0.17   0.861     .4671458    1.889712
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    1.49
         Prob > chi2 =    0.6843

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9337209   .2981811    -0.21   0.830     .4993307    1.746006
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6786286    .344121    -0.76   0.445       .25119     1.83342
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7753326   .2137803    -0.92   0.356      .451636    1.331029
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_
> timeperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_timeper
> iod3.ster saved
(no new episodes generated)
(cat_time: 210664 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       32.70       32.70
          1 |     78,089       23.82       56.52
          2 |     58,050       17.71       74.23
          3 |     42,487       12.96       87.18
          4 |     32,038        9.77       96.96
        400 |      9,980        3.04      100.00
------------+-----------------------------------
      Total |    327,870      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    44,601     13,449 |    58,050 
         3 |    33,640      8,847 |    42,487 
         4 |    14,574     17,464 |    32,038 
       400 |     7,924      2,056 |     9,980 
-----------+----------------------+----------
     Total |   242,020     85,850 |   327,870 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,202     43,913 |   168,115 
         1 |   117,819     41,948 |   159,767 
-----------+----------------------+----------
     Total |   242,021     85,861 |   327,882 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -133052.82
Iteration 1:   log pseudolikelihood = -133033.39
Iteration 2:   log pseudolikelihood = -133033.31
Iteration 3:   log pseudolikelihood = -133033.31
Refining estimates:
Iteration 0:   log pseudolikelihood = -133033.31

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       32,038             Number of obs    =      32,038
No. of failures      =       17,464
Time at risk         =      2753673
                                                Wald chi2(45)    =       43.12
Log pseudolikelihood =   -133033.31             Prob > chi2      =      0.5517

                       (Std. Err. adjusted for 1,222 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9988855   .2214489    -0.01   0.996     .6468562    1.542495
 only 12-18  |   .7430868   .2555414    -0.86   0.388     .3787202    1.458011
      mixed  |   .9369998   .1867504    -0.33   0.744     .6340001    1.384808
             |
        age1 |   1.003616   .0027943     1.30   0.195     .9981545    1.009108
        age2 |   .9936865   .0087955    -0.72   0.474     .9765963    1.011076
        age3 |   1.009561    .025695     0.37   0.709     .9604353      1.0612
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    .838442   .2293639    -0.64   0.519      .490477    1.433268
             |
   ethnicity |
Asian or ..  |   1.034779   .0249066     1.42   0.155     .9870963    1.084765
      Other  |   1.017706   .0263331     0.68   0.498     .9673811    1.070649
             |
   obese4cat |
Obese I ..)  |      1.041   .0234533     1.78   0.075     .9960326    1.087998
Obese II..)  |   1.011205   .0270589     0.42   0.677     .9595373    1.065655
Obese II..)  |    1.00678    .035152     0.19   0.847     .9401876    1.078089
             |
smoke_nomiss |
     Former  |   .9528128   .0527711    -0.87   0.383     .8547994    1.062065
    Current  |   1.022287   .0237859     0.95   0.343     .9767147    1.069986
             |
         imd |
          4  |   1.030138   .0190918     1.60   0.109     .9933905    1.068245
5 most de..  |   .9910575   .0262779    -0.34   0.735     .9408691    1.043923
             |
tot_adults~h |
          2  |   1.523994   .5899284     1.09   0.276     .7136552    3.254452
          3  |   .9965442   .3303928    -0.01   0.992     .5203439    1.908546
             |
1.htdiag_o~p |   1.005599   .0167517     0.34   0.738     .9732964    1.038973
1.~y_disease |   .9953843    .018515    -0.25   0.804      .959749    1.032343
    1.asthma |   .9822862   .0264878    -0.66   0.507     .9317192    1.035598
1.~c_disease |   .9738746   .0190015    -1.36   0.175     .9373354    1.011838
             |
     diabcat |
T1DM, con..  |   1.041144   .0506188     0.83   0.407     .9465136    1.145236
T1DM, unc..  |    .858538   .1068722    -1.23   0.220     .6726677    1.095768
T2DM, con..  |   .9859352   .0201161    -0.69   0.488     .9472862    1.026161
T2DM, unc..  |   .9902299   .0398224    -0.24   0.807     .9151763    1.071439
Diabetes,..  |   1.184101   .3093222     0.65   0.518     .7096264    1.975822
             |
cancer_exh~t |
  Last year  |    1.04065   .1185709     0.35   0.727     .8323759    1.301038
2-5 years..  |   .9875464   .0612666    -0.20   0.840     .8744795    1.115232
   5+ years  |   .9889353   .0194047    -0.57   0.571     .9516248    1.027709
             |
cancer_hae~t |
  Last year  |   .9213012   .1127574    -0.67   0.503     .7248092    1.171061
2-5 years..  |   .9501641   .0576976    -0.84   0.400     .8435492    1.070254
   5+ years  |   1.037777   .0211365     1.82   0.069     .9971666    1.080042
             |
1.~r_disease |   .9830386   .0186619    -0.90   0.368      .947134    1.020304
1.stroke_d~a |   1.010274   .0180463     0.57   0.567     .9755157     1.04627
1.other_ne~o |   .9912172   .0183368    -0.48   0.633     .9559214    1.027816
             |
reduced_ki~t |
Stage 3a/..  |   1.061371   .1197102     0.53   0.597     .8508671    1.323954
      1.esrd |   1.005704   .0154183     0.37   0.711     .9759336    1.036382
1.other_tr~t |   1.000205    .018985     0.01   0.991     .9636786    1.038115
  1.asplenia |   .9691413   .0179678    -1.69   0.091     .9345571    1.005005
1.ra_sle_p~s |   1.017606   .0196308     0.90   0.366     .9798483    1.056818
1.other_im~o |    1.00817   .0191652     0.43   0.669     .9712984    1.046442
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |    1.27501   .3960162     0.78   0.434     .6936365    2.343665
          1 #|
 only 12-18  |   1.295076   .6180565     0.54   0.588     .5082431    3.300039
    1#mixed  |    1.22502   .3356247     0.74   0.459     .7160366    2.095806
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    0.64
         Prob > chi2 =    0.8862

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.273589   .2806731     1.10   0.272     .8268791    1.961629
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9623538   .2699443    -0.14   0.891     .5553531    1.667633
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.147843   .2255989     0.70   0.483     .7808834    1.687249
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_
> timeperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_timeper
> iod4.ster saved
(61,805 observations (episodes) created)
(cat_time: 59002 changes made)
(covid_tpp_prob: 61805 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       32.84       32.84
          1 |     22,010       23.92       56.75
          2 |     16,278       17.69       74.44
          3 |     11,809       12.83       87.28
          4 |      8,905        9.68       96.95
        400 |      2,803        3.05      100.00
------------+-----------------------------------
      Total |     92,022      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |    12,396      3,882 |    16,278 
         3 |     9,346      2,463 |    11,809 
         4 |     4,071      4,834 |     8,905 
       400 |     2,216        587 |     2,803 
-----------+----------------------+----------
     Total |    67,758     24,264 |    92,022 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    35,011     12,409 |    47,420 
         1 |    32,747     11,859 |    44,606 
-----------+----------------------+----------
     Total |    67,758     24,268 |    92,026 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -58147.268
Iteration 1:   log pseudolikelihood = -58128.706
Iteration 2:   log pseudolikelihood = -58128.532
Iteration 3:   log pseudolikelihood = -58128.531
Refining estimates:
Iteration 0:   log pseudolikelihood = -58128.531

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       30,217             Number of obs    =      30,217
No. of failures      =        7,393
Time at risk         =      2219911
                                                Wald chi2(45)    =       47.47
Log pseudolikelihood =   -58128.531             Prob > chi2      =      0.3723

                       (Std. Err. adjusted for 1,204 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9491065   .3457952    -0.14   0.886     .4647187    1.938383
 only 12-18  |   .5021697   .2635079    -1.31   0.189     .1795527    1.404458
      mixed  |   .8785627   .2934341    -0.39   0.698     .4565381    1.690707
             |
        age1 |   1.001751   .0100168     0.18   0.861     .9823101    1.021578
        age2 |   .9684665   .0520128    -0.60   0.551     .8717052    1.075968
        age3 |   1.075662   .1147436     0.68   0.494      .872722    1.325793
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.105667   .5055062     0.22   0.826     .4512933    2.708882
             |
   ethnicity |
Asian or ..  |   1.003383   .0406293     0.08   0.934     .9268295     1.08626
      Other  |   1.000658   .0367486     0.02   0.986     .9311632    1.075339
             |
   obese4cat |
Obese I ..)  |   1.000745   .0320889     0.02   0.981     .9397875    1.065657
Obese II..)  |   1.050152   .0418859     1.23   0.220     .9711836    1.135541
Obese II..)  |   .9990552   .0489244    -0.02   0.985     .9076231    1.099698
             |
smoke_nomiss |
     Former  |   .8378196   .0719489    -2.06   0.039     .7080313    .9913992
    Current  |   1.013602   .0369147     0.37   0.711     .9437725    1.088598
             |
         imd |
          4  |   .9811838   .0276558    -0.67   0.500     .9284496    1.036913
5 most de..  |    .959311   .0385589    -1.03   0.301     .8866371    1.037942
             |
tot_adults~h |
          2  |   1.330193   .8192081     0.46   0.643     .3978289    4.447672
          3  |   1.033206    .492196     0.07   0.945     .4061568    2.628332
             |
1.htdiag_o~p |   1.031854   .0249149     1.30   0.194     .9841588     1.08186
1.~y_disease |   .9607974   .0272934    -1.41   0.159     .9087652    1.015809
    1.asthma |   .9605607    .038907    -0.99   0.321     .8872528    1.039926
1.~c_disease |   1.051105   .0296245     1.77   0.077     .9946167    1.110802
             |
     diabcat |
T1DM, con..  |   1.032626   .0749891     0.44   0.658     .8956302    1.190576
T1DM, unc..  |   1.303598   .1707491     2.02   0.043     1.008442    1.685142
T2DM, con..  |   1.008777   .0315621     0.28   0.780     .9487753    1.072574
T2DM, unc..  |   .9859178   .0591468    -0.24   0.813      .876548    1.108934
Diabetes,..  |   1.174246   .4351556     0.43   0.665      .567961    2.427728
             |
cancer_exh~t |
  Last year  |    .725629   .1556822    -1.49   0.135     .4765309    1.104939
2-5 years..  |   1.008356   .0898774     0.09   0.926     .8467285    1.200836
   5+ years  |    .986528   .0305588    -0.44   0.661     .9284157    1.048278
             |
cancer_hae~t |
  Last year  |    1.03805   .1841665     0.21   0.833     .7331647    1.469721
2-5 years..  |    .945719   .0967293    -0.55   0.585     .7739273    1.155644
   5+ years  |   .9887192   .0291547    -0.38   0.700     .9331969    1.047545
             |
1.~r_disease |    .999872   .0290549    -0.00   0.996     .9445167    1.058472
1.stroke_d~a |   1.007064   .0309281     0.23   0.819     .9482344    1.069544
1.other_ne~o |   .9975012   .0291318    -0.09   0.932     .9420073    1.056264
             |
reduced_ki~t |
Stage 3a/..  |   1.108203   .0692027     1.65   0.100     .9805402    1.252488
      1.esrd |   .9828926   .0238146    -0.71   0.476     .9373077    1.030694
1.other_tr~t |   1.007771   .0287753     0.27   0.786     .9529215    1.065778
  1.asplenia |   1.016091   .0284917     0.57   0.569     .9617555    1.073497
1.ra_sle_p~s |   1.006578   .0284558     0.23   0.817     .9523228    1.063925
1.other_im~o |   .9937132   .0297594    -0.21   0.833     .9370645    1.053786
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.088796   .5516333     0.17   0.867     .4033565    2.939028
          1 #|
 only 12-18  |   2.289373   1.498662     1.27   0.206     .6346082    8.258999
    1#mixed  |   .9572381   .4380776    -0.10   0.924      .390364    2.347309
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    3.74
         Prob > chi2 =    0.2904

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.033383   .3387588     0.10   0.920     .5435311    1.964709
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.149654   .4470865     0.36   0.720     .5364694    2.463707
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8409937   .2544452    -0.57   0.567     .4647925     1.52169
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_
> timeperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_timeper
> iod0.ster saved
(no new episodes generated)
(cat_time: 59002 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       32.84       32.84
          1 |     22,010       23.92       56.75
          2 |     16,278       17.69       74.44
          3 |     11,809       12.83       87.28
          4 |      8,905        9.68       96.95
        400 |      2,803        3.05      100.00
------------+-----------------------------------
      Total |     92,022      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |    12,396      3,882 |    16,278 
         3 |     9,346      2,463 |    11,809 
         4 |     4,071      4,834 |     8,905 
       400 |     2,216        587 |     2,803 
-----------+----------------------+----------
     Total |    67,758     24,264 |    92,022 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    35,011     12,409 |    47,420 
         1 |    32,747     11,859 |    44,606 
-----------+----------------------+----------
     Total |    67,758     24,268 |    92,026 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -38573.597
Iteration 1:   log pseudolikelihood = -38548.029
Iteration 2:   log pseudolikelihood =  -38546.14
Iteration 3:   log pseudolikelihood = -38546.034
Iteration 4:   log pseudolikelihood = -38546.033
Refining estimates:
Iteration 0:   log pseudolikelihood = -38546.033

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       22,010             Number of obs    =      22,010
No. of failures      =        5,105
Time at risk         =      1318257
                                                Wald chi2(45)    =       64.46
Log pseudolikelihood =   -38546.033             Prob > chi2      =      0.0300

                       (Std. Err. adjusted for 1,160 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.440554   .7075755     0.74   0.457       .55009    3.772465
 only 12-18  |   2.111002    1.27288     1.24   0.215      .647494    6.882424
      mixed  |    1.60225   .6916486     1.09   0.275     .6875263    3.733974
             |
        age1 |   1.012786   .0121051     1.06   0.288     .9893361    1.036792
        age2 |   .9042501   .0570369    -1.60   0.111     .7990938    1.023244
        age3 |   1.237536   .1550576     1.70   0.089      .968069    1.582011
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.408178   .7358396     0.66   0.512     .5056672    3.921486
             |
   ethnicity |
Asian or ..  |    1.04161   .0490075     0.87   0.386      .949853    1.142231
      Other  |   1.011251   .0464256     0.24   0.807     .9242319    1.106463
             |
   obese4cat |
Obese I ..)  |   .9981051   .0419624    -0.05   0.964     .9191577    1.083833
Obese II..)  |   .9983687   .0492007    -0.03   0.974     .9064478    1.099611
Obese II..)  |   1.014492   .0637378     0.23   0.819     .8969536    1.147433
             |
smoke_nomiss |
     Former  |   1.118177   .1048312     1.19   0.233     .9304842    1.343731
    Current  |   .9893272   .0436594    -0.24   0.808     .9073527    1.078708
             |
         imd |
          4  |   1.071155    .036591     2.01   0.044     1.001786    1.145327
5 most de..  |   .9634529   .0465322    -0.77   0.441      .876435     1.05911
             |
tot_adults~h |
          2  |   .3017764   .2178161    -1.66   0.097      .073334    1.241839
          3  |   .3261369   .1474938    -2.48   0.013     .1344151    .7913191
             |
1.htdiag_o~p |   1.017244   .0291329     0.60   0.551     .9617181    1.075977
1.~y_disease |   1.071496   .0358435     2.06   0.039     1.003498    1.144102
    1.asthma |   1.085794   .0553783     1.61   0.107     .9825031    1.199944
1.~c_disease |    1.05884   .0382849     1.58   0.114     .9864005      1.1366
             |
     diabcat |
T1DM, con..  |   .8064724   .0799691    -2.17   0.030     .6640261    .9794762
T1DM, unc..  |    .805295   .1588287    -1.10   0.272     .5471068    1.185326
T2DM, con..  |   1.056308   .0390985     1.48   0.139     .9823901    1.135788
T2DM, unc..  |   1.059467   .0762046     0.80   0.422     .9201589    1.219866
Diabetes,..  |   .4601635   .3229493    -1.11   0.269     .1162858    1.820948
             |
cancer_exh~t |
  Last year  |   1.096146   .2205368     0.46   0.648     .7389455    1.626013
2-5 years..  |   1.095271   .1161399     0.86   0.391      .889738    1.348283
   5+ years  |   .9964064   .0385267    -0.09   0.926     .9236857    1.074852
             |
cancer_hae~t |
  Last year  |   .9521932   .2229315    -0.21   0.834     .6017805    1.506649
2-5 years..  |   1.290689   .1364224     2.41   0.016     1.049184    1.587783
   5+ years  |   1.019825   .0363233     0.55   0.582     .9510603    1.093561
             |
1.~r_disease |   .9487233    .035262    -1.42   0.157     .8820684    1.020415
1.stroke_d~a |   .9954058   .0334812    -0.14   0.891     .9319002    1.063239
1.other_ne~o |   .9896061   .0328675    -0.31   0.753     .9272389    1.056168
             |
reduced_ki~t |
Stage 3a/..  |    .891724   .0701366    -1.46   0.145     .7643303    1.040351
      1.esrd |   .9891887   .0287107    -0.37   0.708     .9344874    1.047092
1.other_tr~t |    .940052   .0334068    -1.74   0.082     .8768042    1.007862
  1.asplenia |   1.031364   .0353079     0.90   0.367     .9644324    1.102941
1.ra_sle_p~s |   .9917232   .0345376    -0.24   0.811     .9262892    1.061779
1.other_im~o |   1.025703   .0362325     0.72   0.472      .957091    1.099233
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .7804215   .4903603    -0.39   0.693     .2277697    2.674007
          1 #|
 only 12-18  |   .4174973   .3250399    -1.12   0.262     .0907729    1.920221
    1#mixed  |   .6948297   .3636714    -0.70   0.487     .2490935    1.938181
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    1.37
         Prob > chi2 =    0.7126

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.124239   .5203318     0.25   0.800     .4538339     2.78497
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8813375   .5461302    -0.20   0.838     .2616291    2.968919
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.113291   .4368388     0.27   0.784     .5159526    2.402191
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_
> timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_timeper
> iod1.ster saved
(no new episodes generated)
(cat_time: 59002 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       32.84       32.84
          1 |     22,010       23.92       56.75
          2 |     16,278       17.69       74.44
          3 |     11,809       12.83       87.28
          4 |      8,905        9.68       96.95
        400 |      2,803        3.05      100.00
------------+-----------------------------------
      Total |     92,022      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |    12,396      3,882 |    16,278 
         3 |     9,346      2,463 |    11,809 
         4 |     4,071      4,834 |     8,905 
       400 |     2,216        587 |     2,803 
-----------+----------------------+----------
     Total |    67,758     24,264 |    92,022 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    35,011     12,409 |    47,420 
         1 |    32,747     11,859 |    44,606 
-----------+----------------------+----------
     Total |    67,758     24,268 |    92,026 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -28133.287
Iteration 1:   log pseudolikelihood =  -28103.26
Iteration 2:   log pseudolikelihood = -28101.696
Iteration 3:   log pseudolikelihood = -28101.658
Iteration 4:   log pseudolikelihood = -28101.658
Refining estimates:
Iteration 0:   log pseudolikelihood = -28101.658

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,278             Number of obs    =      16,278
No. of failures      =        3,882
Time at risk         =       866742
                                                Wald chi2(45)    =       75.03
Log pseudolikelihood =   -28101.658             Prob > chi2      =      0.0033

                       (Std. Err. adjusted for 1,115 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.570355   .8744807     0.81   0.418     .5272184    4.677404
 only 12-18  |   .3676929   .4290149    -0.86   0.391     .0373529    3.619477
      mixed  |   1.232917   .6247427     0.41   0.679     .4566816    3.328542
             |
        age1 |    .987696   .0138703    -0.88   0.378     .9608815    1.015259
        age2 |   1.090203   .0816639     1.15   0.249     .9413396    1.262607
        age3 |   .8301712   .1237204    -1.25   0.212     .6198879    1.111788
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   2.868816   1.654099     1.83   0.068     .9266544    8.881529
             |
   ethnicity |
Asian or ..  |   1.014937    .053714     0.28   0.779     .9149357    1.125868
      Other  |   1.003111   .0520554     0.06   0.952     .9061014    1.110507
             |
   obese4cat |
Obese I ..)  |    .912468   .0442125    -1.89   0.059     .8298006    1.003371
Obese II..)  |   .9535878   .0582898    -0.78   0.437     .8459203    1.074959
Obese II..)  |    .971179   .0691414    -0.41   0.681      .844694    1.116604
             |
smoke_nomiss |
     Former  |   .8872195   .1024044    -1.04   0.300     .7075937    1.112444
    Current  |   .9125992   .0470621    -1.77   0.076     .8248675    1.009662
             |
         imd |
          4  |   .9771997   .0407742    -0.55   0.580     .9004642    1.060474
5 most de..  |   1.053801   .0542057     1.02   0.308     .9527398    1.165582
             |
tot_adults~h |
          2  |   1.530489   1.920796     0.34   0.735     .1307841    17.91042
          3  |   2.081864   2.453022     0.62   0.534     .2067745    20.96079
             |
1.htdiag_o~p |   1.014561   .0333091     0.44   0.660     .9513323    1.081992
1.~y_disease |   1.009715   .0378624     0.26   0.797     .9381672    1.086719
    1.asthma |    .966671   .0579308    -0.57   0.572     .8595434     1.08715
1.~c_disease |   1.003671   .0394321     0.09   0.926     .9292859     1.08401
             |
     diabcat |
T1DM, con..  |   .9497284   .0957708    -0.51   0.609     .7794066     1.15727
T1DM, unc..  |   .6764148   .1605288    -1.65   0.099     .4248185    1.077018
T2DM, con..  |   1.045083   .0463539     0.99   0.320     .9580676        1.14
T2DM, unc..  |   .8659485   .0808092    -1.54   0.123     .7212056    1.039741
Diabetes,..  |   1.151207    .577659     0.28   0.779     .4305589    3.078038
             |
cancer_exh~t |
  Last year  |   .9421966   .2455334    -0.23   0.819     .5653549    1.570225
2-5 years..  |    .779358   .1103255    -1.76   0.078     .5905292    1.028567
   5+ years  |   .9266061   .0384154    -1.84   0.066     .8542912    1.005042
             |
cancer_hae~t |
  Last year  |   .8201232   .2263186    -0.72   0.472     .4775119    1.408555
2-5 years..  |   .8596536   .1253701    -1.04   0.300     .6459309    1.144092
   5+ years  |   1.085174   .0441622     2.01   0.045      1.00198    1.175276
             |
1.~r_disease |   1.012287   .0417821     0.30   0.767     .9336201    1.097582
1.stroke_d~a |   .9256556   .0379902    -1.88   0.060     .8541122    1.003192
1.other_ne~o |   1.030219   .0398633     0.77   0.442     .9549771    1.111388
             |
reduced_ki~t |
Stage 3a/..  |    1.02448   .0841412     0.29   0.768     .8721549    1.203409
      1.esrd |   1.020295   .0342078     0.60   0.549     .9554042    1.089593
1.other_tr~t |   1.100882   .0435368     2.43   0.015     1.018775    1.189607
  1.asplenia |   .9664513   .0385335    -0.86   0.392     .8938026    1.045005
1.ra_sle_p~s |   .9584427   .0406312    -1.00   0.317     .8820257     1.04148
1.other_im~o |   .9395201   .0385727    -1.52   0.129     .8668808    1.018246
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .3896415   .2566346    -1.43   0.152     .1071587    1.416782
          1 #|
 only 12-18  |   2.529121   3.242539     0.72   0.469     .2049558    31.20895
    1#mixed  |   .3602044    .208101    -1.77   0.077     .1160871    1.117671
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    6.12
         Prob > chi2 =    0.1058

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6118754   .2336753    -1.29   0.198     .2894603    1.293412
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .92994   .4247923    -0.16   0.874     .3798656    2.276564
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .444102   .1387332    -2.60   0.009     .2407551       .8192
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_
> timeperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_timeper
> iod2.ster saved
(no new episodes generated)
(cat_time: 59002 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       32.84       32.84
          1 |     22,010       23.92       56.75
          2 |     16,278       17.69       74.44
          3 |     11,809       12.83       87.28
          4 |      8,905        9.68       96.95
        400 |      2,803        3.05      100.00
------------+-----------------------------------
      Total |     92,022      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |    12,396      3,882 |    16,278 
         3 |     9,346      2,463 |    11,809 
         4 |     4,071      4,834 |     8,905 
       400 |     2,216        587 |     2,803 
-----------+----------------------+----------
     Total |    67,758     24,264 |    92,022 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    35,011     12,409 |    47,420 
         1 |    32,747     11,859 |    44,606 
-----------+----------------------+----------
     Total |    67,758     24,268 |    92,026 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -17102.388
Iteration 1:   log pseudolikelihood = -17079.771
Iteration 2:   log pseudolikelihood = -17079.291
Iteration 3:   log pseudolikelihood = -17079.289
Iteration 4:   log pseudolikelihood = -17079.289
Refining estimates:
Iteration 0:   log pseudolikelihood = -17079.289

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       11,809             Number of obs    =      11,809
No. of failures      =        2,463
Time at risk         =       488045
                                                Wald chi2(45)    =       54.76
Log pseudolikelihood =   -17079.289             Prob > chi2      =      0.1511

                       (Std. Err. adjusted for 1,067 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5774509   .2918463    -1.09   0.277      .214444    1.554949
 only 12-18  |   .5859152   .6284088    -0.50   0.618     .0715978    4.794793
      mixed  |   .6887521   .2575171    -1.00   0.319     .3309845    1.433238
             |
        age1 |     1.0169   .0184656     0.92   0.356     .9813444    1.053744
        age2 |   .9451413   .0886797    -0.60   0.548     .7863775    1.135958
        age3 |   1.094779   .2026676     0.49   0.625     .7616411     1.57363
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.193071   .7051992     0.30   0.765     .3745753    3.800088
             |
   ethnicity |
Asian or ..  |    .941264   .0664157    -0.86   0.391     .8196918    1.080867
      Other  |   .9897558   .0691915    -0.15   0.883     .8630233    1.135098
             |
   obese4cat |
Obese I ..)  |   .9987919   .0587767    -0.02   0.984     .8899871    1.120899
Obese II..)  |   .8810797   .0668853    -1.67   0.095     .7592732    1.022427
Obese II..)  |   1.016442   .0859193     0.19   0.847     .8612535    1.199594
             |
smoke_nomiss |
     Former  |   1.195714   .1594236     1.34   0.180     .9207406    1.552806
    Current  |   .9798396   .0579808    -0.34   0.731     .8725417    1.100332
             |
         imd |
          4  |   1.018696   .0499425     0.38   0.706     .9253665    1.121439
5 most de..  |   .9663852   .0643489    -0.51   0.608     .8481471    1.101107
             |
tot_adults~h |
          2  |   .8088709   1.103134    -0.16   0.876     .0558489    11.71503
          3  |   1.853739   1.940599     0.59   0.555     .2382115    14.42562
             |
1.htdiag_o~p |   1.025807    .042254     0.62   0.536     .9462459    1.112059
1.~y_disease |   .9766301   .0509884    -0.45   0.651     .8816376    1.081858
    1.asthma |   .9605391   .0772779    -0.50   0.617     .8204151    1.124596
1.~c_disease |   .9594459   .0501334    -0.79   0.428     .8660504    1.062913
             |
     diabcat |
T1DM, con..  |   .6626341   .1033844    -2.64   0.008     .4880553    .8996602
T1DM, unc..  |   1.286812   .2874416     1.13   0.259     .8305736    1.993666
T2DM, con..  |   .9178357   .0547355    -1.44   0.151     .8165883    1.031637
T2DM, unc..  |   1.206283   .1182526     1.91   0.056     .9954184    1.461817
Diabetes,..  |   .8695108   .6217956    -0.20   0.845     .2140782    3.531648
             |
cancer_exh~t |
  Last year  |   .6551639   .2509444    -1.10   0.270     .3092561    1.387975
2-5 years..  |   1.202026   .1639171     1.35   0.177     .9201059    1.570327
   5+ years  |   .9846916   .0494836    -0.31   0.759     .8923288    1.086615
             |
cancer_hae~t |
  Last year  |   1.650959   .3685709     2.25   0.025      1.06588    2.557197
2-5 years..  |   1.033469   .1816801     0.19   0.851     .7322498    1.458598
   5+ years  |   .9543511   .0489063    -0.91   0.362     .8631532    1.055185
             |
1.~r_disease |   .9297845   .0475958    -1.42   0.155     .8410255    1.027911
1.stroke_d~a |   1.019972   .0501387     0.40   0.687      .926288    1.123132
1.other_ne~o |   .9908446   .0499709    -0.18   0.855     .8975884     1.09379
             |
reduced_ki~t |
Stage 3a/..  |   1.067734   .1167967     0.60   0.549     .8616922    1.323042
      1.esrd |   1.018003   .0447351     0.41   0.685     .9339935    1.109569
1.other_tr~t |   .9966783   .0504915    -0.07   0.948     .9024712     1.10072
  1.asplenia |   .9931904   .0491353    -0.14   0.890     .9014087    1.094317
1.ra_sle_p~s |   1.047709   .0523177     0.93   0.351      .950026    1.155435
1.other_im~o |   .9263494   .0471484    -1.50   0.133        .8384    1.023525
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .6493179   .5256479    -0.53   0.594     .1328547    3.173495
          1 #|
 only 12-18  |    1.04217   1.426457     0.03   0.976     .0712635    15.24087
    1#mixed  |   .9096309   .5386528    -0.16   0.873     .2849787    2.903475
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    0.41
         Prob > chi2 =    0.9387

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3749492    .247575    -1.49   0.137     .1027857    1.367766
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6106232   .5265858    -0.57   0.567     .1126468    3.309998
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6265102   .3065529    -0.96   0.339     .2401227    1.634643
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_
> timeperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_timeper
> iod3.ster saved
(no new episodes generated)
(cat_time: 59002 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       32.84       32.84
          1 |     22,010       23.92       56.75
          2 |     16,278       17.69       74.44
          3 |     11,809       12.83       87.28
          4 |      8,905        9.68       96.95
        400 |      2,803        3.05      100.00
------------+-----------------------------------
      Total |     92,022      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |    12,396      3,882 |    16,278 
         3 |     9,346      2,463 |    11,809 
         4 |     4,071      4,834 |     8,905 
       400 |     2,216        587 |     2,803 
-----------+----------------------+----------
     Total |    67,758     24,264 |    92,022 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    35,011     12,409 |    47,420 
         1 |    32,747     11,859 |    44,606 
-----------+----------------------+----------
     Total |    67,758     24,268 |    92,026 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -30664.143
Iteration 1:   log pseudolikelihood = -30648.452
Iteration 2:   log pseudolikelihood = -30645.053
Iteration 3:   log pseudolikelihood = -30644.852
Iteration 4:   log pseudolikelihood =  -30644.85
Iteration 5:   log pseudolikelihood =  -30644.85
Refining estimates:
Iteration 0:   log pseudolikelihood =  -30644.85

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        8,905             Number of obs    =       8,905
No. of failures      =        4,834
Time at risk         =       770042
                                                Wald chi2(45)    =       52.40
Log pseudolikelihood =    -30644.85             Prob > chi2      =      0.2089

                       (Std. Err. adjusted for 1,024 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .4857268   .1614569    -2.17   0.030     .2531922    .9318236
 only 12-18  |   .8054471   .2760738    -0.63   0.528     .4114154    1.576861
      mixed  |   .6048257   .1481326    -2.05   0.040     .3742448    .9774727
             |
        age1 |   1.003986    .012649     0.32   0.752     .9794982    1.029086
        age2 |   1.030848   .0693463     0.45   0.652     .9035107    1.176131
        age3 |   .9209507   .1232292    -0.62   0.538     .7085003    1.197106
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9232041   .3387802    -0.22   0.828     .4497173    1.895203
             |
   ethnicity |
Asian or ..  |   1.033735   .0489334     0.70   0.483     .9421416    1.134232
      Other  |     1.0439   .0488984     0.92   0.359      .952329    1.144277
             |
   obese4cat |
Obese I ..)  |   .9437277    .040257    -1.36   0.175     .8680337    1.026022
Obese II..)  |   .9371521   .0470968    -1.29   0.196     .8492446    1.034159
Obese II..)  |   .9691907    .062426    -0.49   0.627      .854246    1.099602
             |
smoke_nomiss |
     Former  |   .9560612   .0958677    -0.45   0.654     .7854756    1.163694
    Current  |   .9045386   .0417489    -2.17   0.030     .8263042    .9901802
             |
         imd |
          4  |   1.005184    .036141     0.14   0.886     .9367867    1.078574
5 most de..  |   1.062902   .0519738     1.25   0.212     .9657641     1.16981
             |
tot_adults~h |
          2  |   1.449028   .6764797     0.79   0.427     .5803539    3.617935
          3  |   .6047438   .2089639    -1.46   0.146     .3072177     1.19041
             |
1.htdiag_o~p |   .9962243   .0312476    -0.12   0.904     .9368247     1.05939
1.~y_disease |   1.002809   .0371113     0.08   0.940     .9326478    1.078249
    1.asthma |   .9692361   .0536363    -0.56   0.572     .8696112    1.080274
1.~c_disease |   1.017634   .0358305     0.50   0.620     .9497759     1.09034
             |
     diabcat |
T1DM, con..  |   .9951236   .0941755    -0.05   0.959     .8266504    1.197932
T1DM, unc..  |   .9827608   .1743401    -0.10   0.922     .6941385    1.391392
T2DM, con..  |   .9863236   .0390678    -0.35   0.728      .912649    1.065946
T2DM, unc..  |   .9248701   .0705643    -1.02   0.306     .7964107     1.07405
Diabetes,..  |   .4698661   .2465428    -1.44   0.150     .1680124    1.314035
             |
cancer_exh~t |
  Last year  |   .9539977   .2363155    -0.19   0.849     .5870777     1.55024
2-5 years..  |   .9459684   .1117056    -0.47   0.638      .750519    1.192317
   5+ years  |   1.013636   .0380415     0.36   0.718     .9417525    1.091007
             |
cancer_hae~t |
  Last year  |    1.03181   .2389446     0.14   0.892     .6553601    1.624499
2-5 years..  |   .9714541   .1267653    -0.22   0.824     .7522267    1.254573
   5+ years  |   1.012775   .0400088     0.32   0.748     .9373181    1.094306
             |
1.~r_disease |   .9703891   .0363897    -0.80   0.423     .9016245    1.044398
1.stroke_d~a |   .9720157   .0347571    -0.79   0.427     .9062254    1.042582
1.other_ne~o |   1.012903   .0372532     0.35   0.727      .942458    1.088614
             |
reduced_ki~t |
Stage 3a/..  |   1.075543   .0805733     0.97   0.331     .9286683    1.245646
      1.esrd |    1.00339   .0286829     0.12   0.906     .9487188    1.061213
1.other_tr~t |   1.008172   .0369543     0.22   0.824     .9382831    1.083266
  1.asplenia |   .9795263   .0357547    -0.57   0.571     .9118964    1.052172
1.ra_sle_p~s |    1.00342   .0356687     0.10   0.923     .9358899    1.075822
1.other_im~o |   1.023919   .0352515     0.69   0.492     .9571066    1.095395
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.466786   .7619433     0.74   0.461     .5299049    4.060091
          1 #|
 only 12-18  |   .3279708    .273756    -1.34   0.182     .0638764    1.683952
    1#mixed  |   1.086107   .3996408     0.22   0.822       .52804    2.233975
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    3.39
         Prob > chi2 =    0.3358

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7124574   .2944188    -0.82   0.412     .3169603    1.601448
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2641631   .1922714    -1.83   0.067     .0634343     1.10007
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6569053   .2099866    -1.31   0.189      .351081    1.229131
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_
> timeperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_timeper
> iod4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_sex_covid_tpp_prob.lo
> g
  log type:  text
 closed on:  15 Mar 2023, 14:16:31
-------------------------------------------------------------------------------
