-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_shield_covid_tpp_prob
> .log
  log type:  text
 opened on:  15 Mar 2023, 14:18:35

. 
. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 12. stsplit cat_time, at(0,92,161,222,270, 400)
 13. recode cat_time 92=1 161=2 222=3 270=4
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18.  
. foreach int_type in  shield  {
 19. 
. tab shield `outcome'
 20. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 21. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         1.`int_type'#0.`exposure_type' 1.`int_type'#1.`exposu
> re_type' 1.`int_type'#2.`exposure_type' 1.`int_type'#3.`exposure_type' ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id) 
 22. if _rc==0{
 23. *testparm 1.`int_type'#i.`exposure_type'
. di _n "`exposure_type' " _n "****************"
 24. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 25. di "`exposure_type'" _n "****************"
 26. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 27. di "`exposure_type'" _n "****************"
 28. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 29. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_timeperiod`period', replace
 30. }
 31. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 32. }
 33. drop cat_time
 34. }
 35. }
 36. }
(220,644 observations (episodes) created)
(cat_time: 210664 changes made)
(covid_tpp_prob: 220644 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       32.70       32.70
          1 |     78,089       23.82       56.52
          2 |     58,050       17.71       74.23
          3 |     42,487       12.96       87.18
          4 |     32,038        9.77       96.96
        400 |      9,980        3.04      100.00
------------+-----------------------------------
      Total |    327,870      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    44,601     13,449 |    58,050 
         3 |    33,640      8,847 |    42,487 
         4 |    14,574     17,464 |    32,038 
       400 |     7,924      2,056 |     9,980 
-----------+----------------------+----------
     Total |   242,020     85,850 |   327,870 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    36,790     13,184 |    49,974 
         1 |   205,231     72,677 |   277,908 
-----------+----------------------+----------
     Total |   242,021     85,861 |   327,882 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -240349.78
Iteration 1:   log pseudolikelihood = -240331.66
Iteration 2:   log pseudolikelihood = -240331.58
Iteration 3:   log pseudolikelihood = -240331.58
Refining estimates:
Iteration 0:   log pseudolikelihood = -240331.58

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      107,226             Number of obs    =     107,226
No. of failures      =       26,318
Time at risk         =      7859535
                                                Wald chi2(46)    =       37.43
Log pseudolikelihood =   -240331.58             Prob > chi2      =      0.8118

                       (Std. Err. adjusted for 1,373 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.201316   .4041149     0.55   0.586     .6213242    2.322715
 only 12-18  |   1.851604   .7633035     1.49   0.135     .8253716     4.15381
      mixed  |   1.263258    .362106     0.82   0.415     .7202772    2.215564
             |
        age1 |   1.001594   .0024051     0.66   0.507      .996891    1.006319
        age2 |   .9925731   .0074929    -0.99   0.323     .9779954    1.007368
        age3 |   1.024944   .0219827     1.15   0.251      .982752    1.068948
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |     1.0057   .0126744     0.45   0.652     .9811627     1.03085
             |
   ethnicity |
Asian or ..  |   .9898586   .0204157    -0.49   0.621     .9506425    1.030693
      Other  |   .9889204   .0211008    -0.52   0.602     .9484165    1.031154
             |
   obese4cat |
Obese I ..)  |   1.001257   .0179907     0.07   0.944     .9666099    1.037147
Obese II..)  |   .9675655   .0221255    -1.44   0.149     .9251576    1.011917
Obese II..)  |    1.00323   .0272951     0.12   0.906     .9511337    1.058179
             |
smoke_nomiss |
     Former  |   1.090589   .0463705     2.04   0.041     1.003388    1.185368
    Current  |   .9700274   .0186938    -1.58   0.114     .9340717    1.007367
             |
         imd |
          4  |   .9907674   .0145703    -0.63   0.528     .9626178     1.01974
5 most de..  |   1.003404   .0207129     0.16   0.869      .963618    1.044833
             |
tot_adults~h |
          2  |   .7279517   .2401111    -0.96   0.336     .3813626    1.389527
          3  |   .9881349   .2450279    -0.05   0.962     .6077763     1.60653
             |
    1.shield |   1.359337   .4041246     1.03   0.302     .7590475    2.434364
1.htdiag_o~p |   .9907369   .0135841    -0.68   0.497     .9644671    1.017722
1.~y_disease |    1.02833   .0154527     1.86   0.063     .9984848    1.059067
    1.asthma |   1.024173   .0227063     1.08   0.281     .9806223    1.069657
1.~c_disease |   1.013746   .0161389     0.86   0.391     .9826032    1.045877
             |
     diabcat |
T1DM, con..  |   1.009095   .0390722     0.23   0.815     .9353483    1.088655
T1DM, unc..  |   1.131784   .0936704     1.50   0.135     .9623099    1.331103
T2DM, con..  |   1.002697   .0168072     0.16   0.872      .970291    1.036186
T2DM, unc..  |   1.002379    .032115     0.07   0.941     .9413704    1.067341
Diabetes,..  |   1.172625    .212928     0.88   0.380     .8214781    1.673872
             |
cancer_exh~t |
  Last year  |   .9875815   .1012097    -0.12   0.903     .8078669    1.207275
2-5 years..  |   1.031013   .0504089     0.62   0.532     .9367999    1.134702
   5+ years  |   .9867322      .0162    -0.81   0.416     .9554863       1.019
             |
cancer_hae~t |
  Last year  |   1.031666    .097946     0.33   0.743     .8564982    1.242659
2-5 years..  |   .9302439   .0499025    -1.35   0.178     .8374031    1.033378
   5+ years  |   .9998197   .0171325    -0.01   0.992     .9667983    1.033969
             |
1.~r_disease |   .9816581   .0152296    -1.19   0.233     .9522579    1.011966
1.stroke_d~a |   1.004334   .0155802     0.28   0.780     .9742568    1.035339
1.other_ne~o |   .9957089   .0151881    -0.28   0.778     .9663814    1.025926
             |
reduced_ki~t |
Stage 3a/..  |   .9499267   .0974478    -0.50   0.617     .7769086    1.161476
      1.esrd |   1.003257   .0137318     0.24   0.812     .9767005    1.030535
1.other_tr~t |   1.008301   .0157787     0.53   0.597     .9778446    1.039706
  1.asplenia |   .9760715   .0149203    -1.58   0.113     .9472619    1.005757
1.ra_sle_p~s |   1.006485   .0150122     0.43   0.665     .9774873    1.036342
1.other_im~o |   1.012526   .0159298     0.79   0.429     .9817805    1.044234
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .7003099   .2506644    -1.00   0.320     .3472295     1.41242
          1 #|
 only 12-18  |   .4575611   .1929417    -1.85   0.064     .2002255    1.045632
    1#mixed  |   .7198267   .2140437    -1.11   0.269     .4019013    1.289248
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8412931   .1076203    -1.35   0.177      .654726    1.081023
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .847222   .1431618    -0.98   0.327     .6083632    1.179863
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9093267   .0986602    -0.88   0.381     .7351335    1.124796
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 0_timeperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_0_timep
> eriod0.ster saved
(no new episodes generated)
(cat_time: 210664 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       32.70       32.70
          1 |     78,089       23.82       56.52
          2 |     58,050       17.71       74.23
          3 |     42,487       12.96       87.18
          4 |     32,038        9.77       96.96
        400 |      9,980        3.04      100.00
------------+-----------------------------------
      Total |    327,870      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    44,601     13,449 |    58,050 
         3 |    33,640      8,847 |    42,487 
         4 |    14,574     17,464 |    32,038 
       400 |     7,924      2,056 |     9,980 
-----------+----------------------+----------
     Total |   242,020     85,850 |   327,870 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    36,790     13,184 |    49,974 
         1 |   205,231     72,677 |   277,908 
-----------+----------------------+----------
     Total |   242,021     85,861 |   327,882 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -156342.52
Iteration 1:   log pseudolikelihood = -156322.15
Iteration 2:   log pseudolikelihood = -156322.11
Iteration 3:   log pseudolikelihood = -156322.11
Refining estimates:
Iteration 0:   log pseudolikelihood = -156322.11

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       78,089             Number of obs    =      78,089
No. of failures      =       17,716
Time at risk         =      4686825
                                                Wald chi2(46)    =       41.03
Log pseudolikelihood =   -156322.11             Prob > chi2      =      0.6799

                       (Std. Err. adjusted for 1,341 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.525859   .5882737     1.10   0.273     .7167129    3.248503
 only 12-18  |    .925095   .5929958    -0.12   0.903     .2633644    3.249493
      mixed  |   1.223955   .4251142     0.58   0.561     .6196109    2.417752
             |
        age1 |    .997026   .0027975    -1.06   0.288     .9915581    1.002524
        age2 |   1.010186     .00915     1.12   0.263     .9924101    1.028279
        age3 |   .9713164   .0252488    -1.12   0.263     .9230691    1.022085
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.004989    .014957     0.33   0.738     .9760969    1.034736
             |
   ethnicity |
Asian or ..  |   .9482174   .0246694    -2.04   0.041     .9010783    .9978226
      Other  |   1.004785   .0247061     0.19   0.846     .9575099    1.054394
             |
   obese4cat |
Obese I ..)  |   .9674949   .0215765    -1.48   0.138     .9261166    1.010722
Obese II..)  |   .9555019   .0260624    -1.67   0.095     .9057619    1.007973
Obese II..)  |   .9430328   .0317016    -1.74   0.081     .8829015    1.007259
             |
smoke_nomiss |
     Former  |   1.008872   .0521104     0.17   0.864     .9117374    1.116356
    Current  |   1.027038   .0229652     1.19   0.233     .9829993     1.07305
             |
         imd |
          4  |   .9940569   .0190993    -0.31   0.756     .9573191    1.032205
5 most de..  |   1.000676    .025714     0.03   0.979     .9515254    1.052365
             |
tot_adults~h |
          2  |   .8264894   .3260248    -0.48   0.629     .3814734    1.790648
          3  |   1.138956   .3487309     0.42   0.671     .6250033    2.075544
             |
    1.shield |   1.478571   .5613621     1.03   0.303     .7025387    3.111816
1.htdiag_o~p |   .9950825   .0159936    -0.31   0.759     .9642242    1.026928
1.~y_disease |   1.041787    .019672     2.17   0.030     1.003935    1.081066
    1.asthma |   .9970964    .028169    -0.10   0.918     .9433869    1.053864
1.~c_disease |   .9878084   .0184766    -0.66   0.512     .9522508    1.024694
             |
     diabcat |
T1DM, con..  |   1.008417   .0467618     0.18   0.857     .9208068    1.104362
T1DM, unc..  |   1.112747   .1100509     1.08   0.280     .9166691    1.350767
T2DM, con..  |   1.002568   .0204692     0.13   0.900      .963241      1.0435
T2DM, unc..  |   1.031298    .040618     0.78   0.434     .9546828    1.114061
Diabetes,..  |   1.118738   .2718501     0.46   0.644     .6948463    1.801225
             |
cancer_exh~t |
  Last year  |   1.020746   .1225019     0.17   0.864     .8067947    1.291434
2-5 years..  |   1.070939   .0680171     1.08   0.281      .945591    1.212902
   5+ years  |   1.052641   .0215297     2.51   0.012     1.011278    1.095695
             |
cancer_hae~t |
  Last year  |    1.02379   .1202699     0.20   0.841     .8132346     1.28886
2-5 years..  |   .9791365   .0627409    -0.33   0.742     .8635751    1.110162
   5+ years  |   1.016818    .020645     0.82   0.411     .9771494    1.058098
             |
1.~r_disease |   .9967358   .0190306    -0.17   0.864     .9601257    1.034742
1.stroke_d~a |   1.024673   .0192379     1.30   0.194     .9876525    1.063081
1.other_ne~o |   .9866028   .0186513    -0.71   0.476     .9507159    1.023844
             |
reduced_ki~t |
Stage 3a/..  |   .8978363   .1226293    -0.79   0.430     .6869694    1.173429
      1.esrd |   .9882188   .0170838    -0.69   0.493     .9552961    1.022276
1.other_tr~t |   1.016847   .0194815     0.87   0.383     .9793719    1.055756
  1.asplenia |   1.001918   .0192569     0.10   0.921     .9648772    1.040381
1.ra_sle_p~s |   .9809892   .0180127    -1.05   0.296     .9463128    1.016936
1.other_im~o |   .9915139   .0192326    -0.44   0.660     .9545262    1.029935
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .5165038   .2206674    -1.55   0.122     .2235694    1.193259
          1 #|
 only 12-18  |   .8995211   .6290264    -0.15   0.880     .2284412    3.541998
    1#mixed  |   .6474019   .2459156    -1.14   0.252        .3075    1.363022
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7881118   .1322812    -1.42   0.156     .5671753    1.095112
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8321424   .1782395    -0.86   0.391     .5468596     1.26625
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7923908   .1153843    -1.60   0.110     .5956503    1.054114
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 0_timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_0_timep
> eriod1.ster saved
(no new episodes generated)
(cat_time: 210664 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       32.70       32.70
          1 |     78,089       23.82       56.52
          2 |     58,050       17.71       74.23
          3 |     42,487       12.96       87.18
          4 |     32,038        9.77       96.96
        400 |      9,980        3.04      100.00
------------+-----------------------------------
      Total |    327,870      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    44,601     13,449 |    58,050 
         3 |    33,640      8,847 |    42,487 
         4 |    14,574     17,464 |    32,038 
       400 |     7,924      2,056 |     9,980 
-----------+----------------------+----------
     Total |   242,020     85,850 |   327,870 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    36,790     13,184 |    49,974 
         1 |   205,231     72,677 |   277,908 
-----------+----------------------+----------
     Total |   242,021     85,861 |   327,882 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -114614.14
Iteration 1:   log pseudolikelihood = -114596.76
Iteration 2:   log pseudolikelihood =  -114593.9
Iteration 3:   log pseudolikelihood = -114593.78
Iteration 4:   log pseudolikelihood = -114593.78
Refining estimates:
Iteration 0:   log pseudolikelihood = -114593.78

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       58,050             Number of obs    =      58,050
No. of failures      =       13,449
Time at risk         =      3112250
                                                Wald chi2(46)    =       50.80
Log pseudolikelihood =   -114593.78             Prob > chi2      =      0.2902

                       (Std. Err. adjusted for 1,304 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5581774   .1727366    -1.88   0.060      .304337     1.02374
 only 12-18  |   .4104651   .2405644    -1.52   0.129     .1301386    1.294632
      mixed  |   .4380724   .1024931    -3.53   0.000     .2769462    .6929411
             |
        age1 |   .9997058   .0031112    -0.09   0.925     .9936264    1.005822
        age2 |    .994868   .0098809    -0.52   0.604     .9756891    1.014424
        age3 |   1.021701    .028897     0.76   0.448     .9666056    1.079938
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.024771   .0176144     1.42   0.155      .990822    1.059882
             |
   ethnicity |
Asian or ..  |   .9945017   .0286672    -0.19   0.848     .9398727    1.052306
      Other  |   .9822623   .0287231    -0.61   0.541      .927549    1.040203
             |
   obese4cat |
Obese I ..)  |   .9988811   .0264312    -0.04   0.966     .9483973    1.052052
Obese II..)  |   .9991565   .0308139    -0.03   0.978     .9405514    1.061413
Obese II..)  |    1.00909   .0374983     0.24   0.808     .9382076    1.085328
             |
smoke_nomiss |
     Former  |   1.056388   .0665981     0.87   0.384     .9336008    1.195325
    Current  |   .9869559   .0254164    -0.51   0.610     .9383769     1.03805
             |
         imd |
          4  |   .9792789   .0211838    -0.97   0.333     .9386274    1.021691
5 most de..  |   1.007619   .0305396     0.25   0.802     .9495054    1.069289
             |
tot_adults~h |
          2  |   1.429649   .5920454     0.86   0.388     .6349362    3.219055
          3  |   1.092407   .3859418     0.25   0.802     .5465874    2.183281
             |
    1.shield |   .3795698   .1027309    -3.58   0.000     .2233126    .6451638
1.htdiag_o~p |   .9820105   .0184646    -0.97   0.334     .9464793    1.018876
1.~y_disease |    1.00115   .0220822     0.05   0.958     .9587918     1.04538
    1.asthma |   1.019509   .0330455     0.60   0.551     .9567558    1.086379
1.~c_disease |     .98367   .0206145    -0.79   0.432     .9440848    1.024915
             |
     diabcat |
T1DM, con..  |   1.003448   .0571572     0.06   0.952     .8974485    1.121966
T1DM, unc..  |   1.122846   .1382048     0.94   0.347     .8821664    1.429189
T2DM, con..  |   .9613608   .0227213    -1.67   0.095     .9178436    1.006941
T2DM, unc..  |   .9890011   .0462652    -0.24   0.813     .9023559    1.083966
Diabetes,..  |   .8944464   .2921001    -0.34   0.733     .4716032    1.696414
             |
cancer_exh~t |
  Last year  |     .97852   .1403683    -0.15   0.880      .738695    1.296207
2-5 years..  |    .931145    .067264    -0.99   0.323     .8082176    1.072769
   5+ years  |   .9813847   .0228379    -0.81   0.419     .9376288    1.027183
             |
cancer_hae~t |
  Last year  |   1.194228   .1432762     1.48   0.139     .9439857    1.510808
2-5 years..  |   .9729253   .0731836    -0.36   0.715     .8395604    1.127475
   5+ years  |   1.028563   .0231924     1.25   0.212     .9840964    1.075039
             |
1.~r_disease |   1.002451   .0218752     0.11   0.911     .9604807    1.046256
1.stroke_d~a |   1.003765   .0206707     0.18   0.855      .964058    1.045108
1.other_ne~o |   .9588803   .0212118    -1.90   0.058     .9181944    1.001369
             |
reduced_ki~t |
Stage 3a/..  |   .9969678   .1408445    -0.02   0.983     .7558392    1.315021
      1.esrd |   .9759839   .0182657    -1.30   0.194     .9408324    1.012449
1.other_tr~t |   1.007517   .0223182     0.34   0.735     .9647097    1.052223
  1.asplenia |   1.007673   .0219412     0.35   0.726     .9655738    1.051608
1.ra_sle_p~s |   1.002906   .0218764     0.13   0.894     .9609331    1.046713
1.other_im~o |   .9856868   .0225861    -0.63   0.529     .9423982    1.030964
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   2.446881   .8399792     2.61   0.009     1.248555    4.795326
          1 #|
 only 12-18  |    3.24108   2.111952     1.80   0.071     .9037114    11.62384
    1#mixed  |    2.66098   .7218431     3.61   0.000     1.563639     4.52842
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.365794   .2833684     1.50   0.133     .9094565    2.051107
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.33035   .3932747     0.97   0.334     .7453082     2.37463
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.165702   .2259882     0.79   0.429     .7972044    1.704532
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 0_timeperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_0_timep
> eriod2.ster saved
(no new episodes generated)
(cat_time: 210664 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       32.70       32.70
          1 |     78,089       23.82       56.52
          2 |     58,050       17.71       74.23
          3 |     42,487       12.96       87.18
          4 |     32,038        9.77       96.96
        400 |      9,980        3.04      100.00
------------+-----------------------------------
      Total |    327,870      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    44,601     13,449 |    58,050 
         3 |    33,640      8,847 |    42,487 
         4 |    14,574     17,464 |    32,038 
       400 |     7,924      2,056 |     9,980 
-----------+----------------------+----------
     Total |   242,020     85,850 |   327,870 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    36,790     13,184 |    49,974 
         1 |   205,231     72,677 |   277,908 
-----------+----------------------+----------
     Total |   242,021     85,861 |   327,882 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -72752.172
Iteration 1:   log pseudolikelihood = -72736.957
Iteration 2:   log pseudolikelihood = -72736.913
Iteration 3:   log pseudolikelihood = -72736.913
Refining estimates:
Iteration 0:   log pseudolikelihood = -72736.913

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       42,487             Number of obs    =      42,487
No. of failures      =        8,847
Time at risk         =      1752809
                                                Wald chi2(46)    =       31.77
Log pseudolikelihood =   -72736.913             Prob > chi2      =      0.9452

                       (Std. Err. adjusted for 1,255 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.32007   .8122882     0.45   0.652     .3952038    4.409333
 only 12-18  |   1.080496   .9850723     0.08   0.932     .1809651    6.451359
      mixed  |   1.084155     .61002     0.14   0.886     .3598714    3.266147
             |
        age1 |   .9979188   .0039093    -0.53   0.595      .990286     1.00561
        age2 |   1.003178   .0124629     0.26   0.798     .9790459    1.027904
        age3 |   .9950406   .0353935    -0.14   0.889     .9280335    1.066886
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9504051    .021233    -2.28   0.023     .9096871    .9929456
             |
   ethnicity |
Asian or ..  |   1.005096   .0359888     0.14   0.887     .9369774    1.078167
      Other  |   .9451251   .0349444    -1.53   0.127     .8790581    1.016158
             |
   obese4cat |
Obese I ..)  |   1.015862   .0328399     0.49   0.626     .9534938     1.08231
Obese II..)  |   1.024419   .0404578     0.61   0.541     .9481147    1.106865
Obese II..)  |   1.048144   .0460191     1.07   0.284     .9617204    1.142335
             |
smoke_nomiss |
     Former  |   .9583128   .0756228    -0.54   0.589     .8209882    1.118607
    Current  |   1.051935   .0328924     1.62   0.105     .9894029    1.118419
             |
         imd |
          4  |   .9991341   .0267549    -0.03   0.974     .9480478    1.052973
5 most de..  |   1.022672   .0374751     0.61   0.541     .9517972    1.098823
             |
tot_adults~h |
          2  |    .937467   .5829366    -0.10   0.917     .2771156    3.171399
          3  |   1.393444   .6659758     0.69   0.488      .546098    3.555565
             |
    1.shield |   1.420361   .8396723     0.59   0.553     .4458571    4.524827
1.htdiag_o~p |   1.005752   .0237698     0.24   0.808     .9602265    1.053436
1.~y_disease |   .9864236   .0266994    -0.51   0.614     .9354575    1.040166
    1.asthma |   1.012102   .0413002     0.29   0.768     .9343078    1.096374
1.~c_disease |    .968615   .0258439    -1.20   0.232     .9192635    1.020616
             |
     diabcat |
T1DM, con..  |   1.100433   .0708623     1.49   0.137     .9699529    1.248466
T1DM, unc..  |    1.06097    .160006     0.39   0.695     .7894646     1.42585
T2DM, con..  |   1.002082      .0288     0.07   0.942     .9471953    1.060149
T2DM, unc..  |   1.099556   .0618826     1.69   0.092     .9847184    1.227786
Diabetes,..  |   1.350834   .4570852     0.89   0.374     .6959506    2.621955
             |
cancer_exh~t |
  Last year  |   1.028137    .176897     0.16   0.872      .733832    1.440473
2-5 years..  |   .9852133   .0861571    -0.17   0.865     .8300276    1.169413
   5+ years  |   .9850374   .0278513    -0.53   0.594     .9319348    1.041166
             |
cancer_hae~t |
  Last year  |   .7938779   .1468564    -1.25   0.212     .5524503    1.140812
2-5 years..  |   .9198068   .0830635    -0.93   0.355     .7705992    1.097905
   5+ years  |   1.022177   .0294441     0.76   0.446     .9660664    1.081547
             |
1.~r_disease |   .9975915   .0260418    -0.09   0.926     .9478343    1.049961
1.stroke_d~a |   .9874189   .0264246    -0.47   0.636     .9369625    1.040592
1.other_ne~o |   1.035545   .0278544     1.30   0.194     .9823651    1.091603
             |
reduced_ki~t |
Stage 3a/..  |   .9563911   .1587448    -0.27   0.788     .6907969      1.3241
      1.esrd |   .9842022   .0232301    -0.67   0.500     .9397091    1.030802
1.other_tr~t |   1.021075   .0269085     0.79   0.429     .9696741      1.0752
  1.asplenia |   .9999966   .0281186    -0.00   1.000     .9463762    1.056655
1.ra_sle_p~s |    .988697    .024859    -0.45   0.651     .9411553     1.03864
1.other_im~o |   .9972285   .0278544    -0.10   0.921     .9441024    1.053344
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .5784811   .3779847    -0.84   0.402     .1607336    2.081957
          1 #|
 only 12-18  |   .6144392   .6316296    -0.47   0.636     .0819338    4.607812
    1#mixed  |   .7114696   .4208884    -0.58   0.565     .2231546    2.268333
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7636357   .1863074    -1.11   0.269     .4733856    1.231849
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6638989    .253599    -1.07   0.284     .3140192    1.403614
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7713435   .1610422    -1.24   0.214     .5123099    1.161349
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 0_timeperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_0_timep
> eriod3.ster saved
(no new episodes generated)
(cat_time: 210664 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       32.70       32.70
          1 |     78,089       23.82       56.52
          2 |     58,050       17.71       74.23
          3 |     42,487       12.96       87.18
          4 |     32,038        9.77       96.96
        400 |      9,980        3.04      100.00
------------+-----------------------------------
      Total |    327,870      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,908     26,318 |   107,226 
         1 |    60,373     17,716 |    78,089 
         2 |    44,601     13,449 |    58,050 
         3 |    33,640      8,847 |    42,487 
         4 |    14,574     17,464 |    32,038 
       400 |     7,924      2,056 |     9,980 
-----------+----------------------+----------
     Total |   242,020     85,850 |   327,870 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    36,790     13,184 |    49,974 
         1 |   205,231     72,677 |   277,908 
-----------+----------------------+----------
     Total |   242,021     85,861 |   327,882 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -133052.82
Iteration 1:   log pseudolikelihood = -133032.51
Iteration 2:   log pseudolikelihood = -133032.35
Iteration 3:   log pseudolikelihood = -133032.35
Iteration 4:   log pseudolikelihood = -133032.35
Refining estimates:
Iteration 0:   log pseudolikelihood = -133032.35

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       32,038             Number of obs    =      32,038
No. of failures      =       17,464
Time at risk         =      2753673
                                                Wald chi2(46)    =       45.32
Log pseudolikelihood =   -133032.35             Prob > chi2      =      0.5008

                       (Std. Err. adjusted for 1,222 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.701876   .8980256     1.01   0.314     .6050289     4.78718
 only 12-18  |   .7266801   .6352078    -0.37   0.715     .1310051    4.030864
      mixed  |   1.609654   .7815091     0.98   0.327     .6215304    4.168718
             |
        age1 |   1.003688   .0027931     1.32   0.186     .9982288    1.009178
        age2 |   .9934658   .0087886    -0.74   0.459      .976389    1.010841
        age3 |   1.010173   .0256947     0.40   0.691     .9610473     1.06181
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    1.02717   .0155119     1.78   0.076      .997213    1.058027
             |
   ethnicity |
Asian or ..  |   1.034456   .0249093     1.41   0.159     .9867684    1.084447
      Other  |   1.017838   .0263281     0.68   0.494     .9675221    1.070771
             |
   obese4cat |
Obese I ..)  |   1.041428   .0234626     1.80   0.072     .9964423    1.088444
Obese II..)  |   1.010952   .0270514     0.41   0.684     .9592983    1.065387
Obese II..)  |   1.007123   .0351562     0.20   0.839     .9405226     1.07844
             |
smoke_nomiss |
     Former  |   .9529668   .0527764    -0.87   0.384     .8549431    1.062229
    Current  |   1.022134   .0237845     0.94   0.347      .976564     1.06983
             |
         imd |
          4  |     1.0298   .0190878     1.58   0.113     .9930597    1.067899
5 most de..  |   .9905152   .0262647    -0.36   0.719     .9403521    1.043354
             |
tot_adults~h |
          2  |   1.501052   .5687719     1.07   0.284     .7142696     3.15449
          3  |   .9738975   .3169075    -0.08   0.935     .5146727    1.842873
             |
    1.shield |    1.65476   .8136823     1.02   0.306     .6312191    4.338002
1.htdiag_o~p |   1.005747   .0167445     0.34   0.731     .9734575    1.039106
1.~y_disease |   .9938793   .0191028    -0.32   0.749      .957135    1.032034
    1.asthma |   .9805936   .0269234    -0.71   0.475     .9292193    1.034808
1.~c_disease |   .9737164   .0189818    -1.37   0.172     .9372146     1.01164
             |
     diabcat |
T1DM, con..  |   1.040907   .0505911     0.82   0.409     .9463269     1.14494
T1DM, unc..  |   .8590157   .1069315    -1.22   0.222     .6730423    1.096377
T2DM, con..  |   .9865663   .0201225    -0.66   0.507     .9479049    1.026805
T2DM, unc..  |   .9910879   .0398549    -0.22   0.824     .9159729    1.072363
Diabetes,..  |   1.184052   .3091938     0.65   0.518     .7097326    1.975362
             |
cancer_exh~t |
  Last year  |   1.037372   .1177686     0.32   0.747     .8304265     1.29589
2-5 years..  |   .9853142   .0615659    -0.24   0.813     .8717434    1.113681
   5+ years  |   .9873983   .0198038    -0.63   0.527     .9493365    1.026986
             |
cancer_hae~t |
  Last year  |   .9177728   .1126677    -0.70   0.485     .7215059    1.167429
2-5 years..  |   .9492041   .0576698    -0.86   0.391     .8426438     1.06924
   5+ years  |   1.036056   .0218918     1.68   0.094     .9940253    1.079864
             |
1.~r_disease |   .9832474   .0186671    -0.89   0.374      .947333    1.020523
1.stroke_d~a |   1.010549   .0180477     0.59   0.557     .9757885    1.046549
1.other_ne~o |   .9910775   .0183283    -0.48   0.628     .9557979    1.027659
             |
reduced_ki~t |
Stage 3a/..  |   1.061244   .1197286     0.53   0.598     .8507134    1.323875
      1.esrd |   1.003588   .0168151     0.21   0.831     .9711664    1.037092
1.other_tr~t |   .9986405    .019858    -0.07   0.945     .9604682     1.03833
  1.asplenia |   .9675956   .0188405    -1.69   0.091     .9313646    1.005236
1.ra_sle_p~s |   1.017764   .0196333     0.91   0.361     .9800016    1.056981
1.other_im~o |   1.006477   .0201678     0.32   0.747     .9677155    1.046792
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .6269863   .3415021    -0.86   0.391     .2155917    1.823409
          1 #|
 only 12-18  |     1.1648   1.048353     0.17   0.865     .1995933    6.797622
    1#mixed  |   .6081523   .2992528    -1.01   0.312     .2318262    1.595373
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.067053   .1689957     0.41   0.682     .7823048    1.455446
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8464372   .1771567    -0.80   0.426     .5616178      1.2757
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9789146   .1359286    -0.15   0.878     .7456757    1.285108
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 0_timeperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_0_timep
> eriod4.ster saved
(61,805 observations (episodes) created)
(cat_time: 59002 changes made)
(covid_tpp_prob: 61805 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       32.84       32.84
          1 |     22,010       23.92       56.75
          2 |     16,278       17.69       74.44
          3 |     11,809       12.83       87.28
          4 |      8,905        9.68       96.95
        400 |      2,803        3.05      100.00
------------+-----------------------------------
      Total |     92,022      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |    12,396      3,882 |    16,278 
         3 |     9,346      2,463 |    11,809 
         4 |     4,071      4,834 |     8,905 
       400 |     2,216        587 |     2,803 
-----------+----------------------+----------
     Total |    67,758     24,264 |    92,022 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,147      3,719 |    13,866 
         1 |    57,611     20,549 |    78,160 
-----------+----------------------+----------
     Total |    67,758     24,268 |    92,026 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -58147.268
Iteration 1:   log pseudolikelihood = -58128.711
Iteration 2:   log pseudolikelihood = -58127.891
Iteration 3:   log pseudolikelihood = -58127.866
Iteration 4:   log pseudolikelihood = -58127.866
Refining estimates:
Iteration 0:   log pseudolikelihood = -58127.866

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       30,217             Number of obs    =      30,217
No. of failures      =        7,393
Time at risk         =      2219911
                                                Wald chi2(46)    =       46.28
Log pseudolikelihood =   -58127.866             Prob > chi2      =      0.4607

                       (Std. Err. adjusted for 1,204 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .6894287   .3988026    -0.64   0.520     .2218752     2.14225
 only 12-18  |     .66531   .5014926    -0.54   0.589     .1518489    2.914987
      mixed  |   .5033405   .2474993    -1.40   0.163      .192006    1.319499
             |
        age1 |   1.001973   .0100146     0.20   0.844     .9825352    1.021794
        age2 |   .9676682    .051952    -0.61   0.540     .8710183    1.075043
        age3 |   1.077249   .1148773     0.70   0.485     .8740666    1.327663
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.060817    .024236     2.58   0.010     1.014364    1.109399
             |
   ethnicity |
Asian or ..  |   1.005114   .0406627     0.13   0.900     .9284939    1.088056
      Other  |   1.000075    .036755     0.00   0.998     .9305697    1.074771
             |
   obese4cat |
Obese I ..)  |   1.000224    .032107     0.01   0.994      .939234    1.065174
Obese II..)  |   1.050444   .0419373     1.23   0.218     .9713816    1.135941
Obese II..)  |   .9992027   .0489617    -0.02   0.987     .9077037    1.099925
             |
smoke_nomiss |
     Former  |   .8385321   .0719937    -2.05   0.040     .7086606    .9922043
    Current  |   1.014238   .0369413     0.39   0.698     .9443585    1.089289
             |
         imd |
          4  |    .981874   .0276775    -0.65   0.516     .9290983    1.037647
5 most de..  |   .9591878   .0385543    -1.04   0.300     .8865226    1.037809
             |
tot_adults~h |
          2  |   1.189254   .7815977     0.26   0.792     .3279822    4.312197
          3  |   .9885448   .4904724    -0.02   0.981     .3738244    2.614117
             |
    1.shield |   .4927611   .2790172    -1.25   0.211     .1624272    1.494907
1.htdiag_o~p |   1.032034   .0249387     1.30   0.192     .9842946    1.082089
1.~y_disease |   .9701512   .0287679    -1.02   0.307     .9153743    1.028206
    1.asthma |    .969235   .0394721    -0.77   0.443     .8948781     1.04977
1.~c_disease |   1.050491   .0296239     1.75   0.081     .9940043    1.110187
             |
     diabcat |
T1DM, con..  |   1.031864   .0749177     0.43   0.666     .8949974    1.189661
T1DM, unc..  |   1.302719   .1706874     2.02   0.044     1.007681    1.684141
T2DM, con..  |   1.009509    .031571     0.30   0.762     .9494896    1.073323
T2DM, unc..  |   .9850089    .059141    -0.25   0.801     .8756551    1.108019
Diabetes,..  |   1.179983   .4365091     0.45   0.655     .5714683     2.43646
             |
cancer_exh~t |
  Last year  |   .7330125   .1574503    -1.45   0.148      .481143    1.116731
2-5 years..  |   1.017469   .0913328     0.19   0.847     .8533225     1.21319
   5+ years  |    .997008   .0322881    -0.09   0.926      .935691    1.062343
             |
cancer_hae~t |
  Last year  |   1.049186   .1855402     0.27   0.786     .7418641    1.483819
2-5 years..  |   .9560403   .0979149    -0.44   0.661     .7821654    1.168568
   5+ years  |   .9987029   .0302737    -0.04   0.966     .9410958    1.059836
             |
1.~r_disease |   .9997892   .0290499    -0.01   0.994     .9444433    1.058378
1.stroke_d~a |   1.007938   .0309506     0.26   0.797     .9490655    1.070463
1.other_ne~o |   .9981337   .0291516    -0.06   0.949     .9426021    1.056937
             |
reduced_ki~t |
Stage 3a/..  |    1.10325   .0690306     1.57   0.116     .9759193    1.247193
      1.esrd |   .9953428   .0263259    -0.18   0.860     .9450596    1.048301
1.other_tr~t |    1.01801   .0304074     0.60   0.550     .9601233    1.079386
  1.asplenia |   1.026084   .0304118     0.87   0.385     .9681762    1.087455
1.ra_sle_p~s |   1.007362   .0284624     0.26   0.795     .9530928     1.06472
1.other_im~o |   1.004163   .0305437     0.14   0.891     .9460478    1.065848
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.602604   1.057032     0.72   0.475     .4399447    5.837872
          1 #|
 only 12-18  |    1.29644   1.181442     0.28   0.776     .2172977    7.734816
    1#mixed  |   1.935466   1.096811     1.17   0.244     .6374076    5.876973
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.104882     .29602     0.37   0.710     .6535243    1.867969
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8625348   .3196294    -0.40   0.690     .4172026    1.783225
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9741982   .2446514    -0.10   0.917     .5955034    1.593714
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 1_timeperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_1_timep
> eriod0.ster saved
(no new episodes generated)
(cat_time: 59002 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       32.84       32.84
          1 |     22,010       23.92       56.75
          2 |     16,278       17.69       74.44
          3 |     11,809       12.83       87.28
          4 |      8,905        9.68       96.95
        400 |      2,803        3.05      100.00
------------+-----------------------------------
      Total |     92,022      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |    12,396      3,882 |    16,278 
         3 |     9,346      2,463 |    11,809 
         4 |     4,071      4,834 |     8,905 
       400 |     2,216        587 |     2,803 
-----------+----------------------+----------
     Total |    67,758     24,264 |    92,022 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,147      3,719 |    13,866 
         1 |    57,611     20,549 |    78,160 
-----------+----------------------+----------
     Total |    67,758     24,268 |    92,026 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -38573.597
Iteration 1:   log pseudolikelihood =  -38547.55
Iteration 2:   log pseudolikelihood = -38545.846
Iteration 3:   log pseudolikelihood = -38545.758
Iteration 4:   log pseudolikelihood = -38545.757
Refining estimates:
Iteration 0:   log pseudolikelihood = -38545.757

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       22,010             Number of obs    =      22,010
No. of failures      =        5,105
Time at risk         =      1318257
                                                Wald chi2(46)    =       63.80
Log pseudolikelihood =   -38545.757             Prob > chi2      =      0.0421

                       (Std. Err. adjusted for 1,160 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.433568    1.71029     0.30   0.763     .1383277    14.85688
 only 12-18  |   1.173704   1.480432     0.13   0.899     .0990626    13.90617
      mixed  |   1.671252   1.720211     0.50   0.618     .2222823    12.56549
             |
        age1 |   1.012561   .0121105     1.04   0.297     .9891014    1.036578
        age2 |   .9049709   .0571203    -1.58   0.114     .7996652    1.024144
        age3 |   1.235638   .1549232     1.69   0.091     .9664258    1.579844
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    .979407   .0275641    -0.74   0.460     .9268453    1.034949
             |
   ethnicity |
Asian or ..  |   1.042576   .0490077     0.89   0.375     .9508144    1.143193
      Other  |   1.010849   .0463868     0.24   0.814     .9239014     1.10598
             |
   obese4cat |
Obese I ..)  |   .9982131   .0419838    -0.04   0.966     .9192266    1.083987
Obese II..)  |   .9988974   .0492532    -0.02   0.982     .9068807    1.100251
Obese II..)  |   1.016146   .0637776     0.26   0.799     .8985271    1.149162
             |
smoke_nomiss |
     Former  |   1.119305    .105005     1.20   0.230     .9313113    1.345247
    Current  |   .9889382   .0436442    -0.25   0.801     .9069924    1.078288
             |
         imd |
          4  |   1.070546   .0365629     2.00   0.046      1.00123    1.144661
5 most de..  |   .9646669   .0465755    -0.75   0.456     .8775667    1.060412
             |
tot_adults~h |
          2  |   .2811574   .1967763    -1.81   0.070     .0713199    1.108378
          3  |   .2963776   .1392221    -2.59   0.010     .1180313    .7442067
             |
    1.shield |   1.173263   1.289505     0.15   0.884     .1361007    10.11418
1.htdiag_o~p |   1.017716   .0291594     0.61   0.540     .9621402    1.076503
1.~y_disease |   1.083246   .0378642     2.29   0.022     1.011518    1.160059
    1.asthma |    1.09623   .0566373     1.78   0.075     .9906585    1.213052
1.~c_disease |   1.059112   .0382962     1.59   0.112     .9866509    1.136895
             |
     diabcat |
T1DM, con..  |   .8056203   .0798949    -2.18   0.029     .6633078    .9784658
T1DM, unc..  |   .8037776   .1585193    -1.11   0.268     .5460894    1.183064
T2DM, con..  |   1.056561   .0390868     1.49   0.137     .9826639    1.136015
T2DM, unc..  |   1.059578   .0762202     0.80   0.421     .9202418     1.22001
Diabetes,..  |   .4620178   .3244111    -1.10   0.271      .116675     1.82953
             |
cancer_exh~t |
  Last year  |   1.107216   .2226472     0.51   0.613     .7465629    1.642095
2-5 years..  |   1.105177   .1176875     0.94   0.348     .8969944    1.361677
   5+ years  |   1.006787   .0400282     0.17   0.865     .9313118    1.088378
             |
cancer_hae~t |
  Last year  |   .9647566   .2261302    -0.15   0.878      .609402    1.527326
2-5 years..  |   1.302314   .1383487     2.49   0.013     1.057523    1.603767
   5+ years  |   1.031307   .0382815     0.83   0.406     .9589406    1.109134
             |
1.~r_disease |   .9482883   .0352358    -1.43   0.153     .8816823    1.019926
1.stroke_d~a |   .9952614   .0334808    -0.14   0.888     .9317567    1.063094
1.other_ne~o |   .9892152   .0328673    -0.33   0.744     .9268491    1.055778
             |
reduced_ki~t |
Stage 3a/..  |   .8915428    .070224    -1.46   0.145     .7640042    1.040372
      1.esrd |   1.002154   .0316142     0.07   0.946      .942068    1.066073
1.other_tr~t |    .950384    .035092    -1.38   0.168     .8840348    1.021713
  1.asplenia |    1.04277   .0369273     1.18   0.237     .9728488    1.117717
1.ra_sle_p~s |    .992018   .0345234    -0.23   0.818     .9266094    1.062044
1.other_im~o |   1.036388   .0380116     0.97   0.330     .9645015    1.113633
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .9008631   1.146241    -0.08   0.935     .0744058    10.90714
          1 #|
 only 12-18  |   1.343772   1.954125     0.20   0.839     .0777142    23.23543
    1#mixed  |   .8036854   .8835056    -0.20   0.842     .0931848    6.931496
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.291449   .5049121     0.65   0.513     .6001871    2.778867
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.57719   .9008715     0.80   0.425     .5148592    4.831476
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.343161   .4706673     0.84   0.400     .6758528    2.669342
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 1_timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_1_timep
> eriod1.ster saved
(no new episodes generated)
(cat_time: 59002 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       32.84       32.84
          1 |     22,010       23.92       56.75
          2 |     16,278       17.69       74.44
          3 |     11,809       12.83       87.28
          4 |      8,905        9.68       96.95
        400 |      2,803        3.05      100.00
------------+-----------------------------------
      Total |     92,022      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |    12,396      3,882 |    16,278 
         3 |     9,346      2,463 |    11,809 
         4 |     4,071      4,834 |     8,905 
       400 |     2,216        587 |     2,803 
-----------+----------------------+----------
     Total |    67,758     24,264 |    92,022 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,147      3,719 |    13,866 
         1 |    57,611     20,549 |    78,160 
-----------+----------------------+----------
     Total |    67,758     24,268 |    92,026 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -28133.287
Iteration 1:   log pseudolikelihood = -28108.249
Iteration 2:   log pseudolikelihood = -28103.567
Iteration 3:   log pseudolikelihood = -28103.118
Iteration 4:   log pseudolikelihood =  -28103.11
Iteration 5:   log pseudolikelihood =  -28103.11
Refining estimates:
Iteration 0:   log pseudolikelihood =  -28103.11

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,278             Number of obs    =      16,278
No. of failures      =        3,882
Time at risk         =       866742
                                                Wald chi2(46)    =       75.24
Log pseudolikelihood =    -28103.11             Prob > chi2      =      0.0042

                       (Std. Err. adjusted for 1,115 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8609082   .5242132    -0.25   0.806     .2610082    2.839616
 only 12-18  |   .3543834    .276006    -1.33   0.183     .0770067    1.630866
      mixed  |   .3025762   .1260519    -2.87   0.004     .1337297    .6846073
             |
        age1 |   .9883178   .0138792    -0.84   0.403      .961486    1.015898
        age2 |   1.087092   .0814574     1.11   0.265      .938609    1.259065
        age3 |   .8345929   .1244305    -1.21   0.225     .6231148    1.117844
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.041786   .0345941     1.23   0.218     .9761425    1.111845
             |
   ethnicity |
Asian or ..  |   1.018752    .053858     0.35   0.725     .9184775    1.129975
      Other  |   1.003733    .052198     0.07   0.943     .9064676    1.111434
             |
   obese4cat |
Obese I ..)  |   .9130572   .0442759    -1.88   0.061     .8302743    1.004094
Obese II..)  |   .9524753   .0582381    -0.80   0.426     .8449051    1.073741
Obese II..)  |   .9698313    .069087    -0.43   0.667     .8434512    1.115148
             |
smoke_nomiss |
     Former  |   .8884051   .1025495    -1.03   0.305     .7085264    1.113951
    Current  |   .9140473   .0471107    -1.74   0.081     .8262226    1.011207
             |
         imd |
          4  |   .9773049   .0407181    -0.55   0.582     .9006704     1.06046
5 most de..  |   1.053937   .0542039     1.02   0.307     .9528784    1.165714
             |
tot_adults~h |
          2  |   1.609902     1.8668     0.41   0.681       .16587    15.62539
          3  |   2.096005   2.345584     0.66   0.508     .2337951    18.79098
             |
    1.shield |   .3608622   .1770107    -2.08   0.038     .1379776    .9437875
1.htdiag_o~p |   1.016243    .033388     0.49   0.624     .9528667    1.083836
1.~y_disease |   1.014795   .0395407     0.38   0.706     .9401821     1.09533
    1.asthma |   .9726714   .0588047    -0.46   0.647     .8639828    1.095033
1.~c_disease |   1.002391    .039387     0.06   0.952     .9280915    1.082638
             |
     diabcat |
T1DM, con..  |   .9406381    .095366    -0.60   0.546     .7711237    1.147417
T1DM, unc..  |   .6770625   .1608332    -1.64   0.101     .4250398    1.078519
T2DM, con..  |   1.046279   .0464155     1.02   0.308     .9591494    1.141324
T2DM, unc..  |   .8626216   .0809406    -1.57   0.115     .7177138    1.036787
Diabetes,..  |   1.148943   .5782169     0.28   0.783     .4284724    3.080875
             |
cancer_exh~t |
  Last year  |   .9462933   .2465312    -0.21   0.832     .5678952    1.576824
2-5 years..  |   .7779813   .1109777    -1.76   0.078     .5882294    1.028944
   5+ years  |   .9314573   .0395689    -1.67   0.095     .8570445    1.012331
             |
cancer_hae~t |
  Last year  |   .8261518   .2281446    -0.69   0.489     .4808368    1.419456
2-5 years..  |   .8694681   .1268007    -0.96   0.338     .6533063    1.157152
   5+ years  |   1.092575   .0463801     2.09   0.037     1.005351    1.187367
             |
1.~r_disease |   1.010368   .0417286     0.25   0.803     .9318038    1.095556
1.stroke_d~a |   .9266285   .0380851    -1.85   0.064     .8549105    1.004363
1.other_ne~o |   1.031049   .0399345     0.79   0.430     .9556755    1.112366
             |
reduced_ki~t |
Stage 3a/..  |   1.020269   .0838769     0.24   0.807     .8684341     1.19865
      1.esrd |      1.028   .0371871     0.76   0.445     .9576388    1.103532
1.other_tr~t |   1.109036   .0453305     2.53   0.011     1.023655    1.201538
  1.asplenia |    .972872   .0403105    -0.66   0.507     .8969879    1.055176
1.ra_sle_p~s |   .9613164   .0407651    -0.93   0.352     .8846484    1.044629
1.other_im~o |   .9445529   .0398849    -1.35   0.177     .8695274    1.026052
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.147941   .7568616     0.21   0.834      .315286    4.179599
          1 #|
 only 12-18  |   2.956141   2.499261     1.28   0.200     .5637405    15.50141
    1#mixed  |   2.711172   1.331949     2.03   0.042     1.035088    7.101284
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .988272   .3499509    -0.03   0.973     .4936995    1.978291
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.047607   .4497339     0.11   0.914     .4516281    2.430055
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8203362   .2626993    -0.62   0.536     .4379338    1.536651
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 1_timeperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_1_timep
> eriod2.ster saved
(no new episodes generated)
(cat_time: 59002 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       32.84       32.84
          1 |     22,010       23.92       56.75
          2 |     16,278       17.69       74.44
          3 |     11,809       12.83       87.28
          4 |      8,905        9.68       96.95
        400 |      2,803        3.05      100.00
------------+-----------------------------------
      Total |     92,022      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |    12,396      3,882 |    16,278 
         3 |     9,346      2,463 |    11,809 
         4 |     4,071      4,834 |     8,905 
       400 |     2,216        587 |     2,803 
-----------+----------------------+----------
     Total |    67,758     24,264 |    92,022 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,147      3,719 |    13,866 
         1 |    57,611     20,549 |    78,160 
-----------+----------------------+----------
     Total |    67,758     24,268 |    92,026 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -17102.388
Iteration 1:   log pseudolikelihood =  -17077.89
Iteration 2:   log pseudolikelihood = -17077.006
Iteration 3:   log pseudolikelihood = -17076.856
Iteration 4:   log pseudolikelihood = -17076.802
Iteration 5:   log pseudolikelihood = -17076.782
Iteration 6:   log pseudolikelihood = -17076.775
Iteration 7:   log pseudolikelihood = -17076.772
Iteration 8:   log pseudolikelihood = -17076.771
Iteration 9:   log pseudolikelihood =  -17076.77
Iteration 10:  log pseudolikelihood =  -17076.77
Iteration 11:  log pseudolikelihood =  -17076.77
Iteration 12:  log pseudolikelihood =  -17076.77
Iteration 13:  log pseudolikelihood =  -17076.77
Iteration 14:  log pseudolikelihood =  -17076.77
Iteration 15:  log pseudolikelihood =  -17076.77
Iteration 16:  log pseudolikelihood =  -17076.77
Iteration 17:  log pseudolikelihood =  -17076.77
Iteration 18:  log pseudolikelihood =  -17076.77
Iteration 19:  log pseudolikelihood =  -17076.77
Iteration 20:  log pseudolikelihood =  -17076.77
Refining estimates:
Iteration 0:   log pseudolikelihood =  -17076.77

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       11,809             Number of obs    =      11,809
No. of failures      =        2,463
Time at risk         =       488045
                                                Wald chi2(44)    =     4899.32
Log pseudolikelihood =    -17076.77             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,067 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.13e+08          .        .       .            .           .
 only 12-18  |   .4159113   .2975707    -1.23   0.220     .1023279    1.690469
      mixed  |   1.90e+08   2.10e+08    17.22   0.000     2.17e+07    1.66e+09
             |
        age1 |   1.016442   .0184199     0.90   0.368     .9809736    1.053194
        age2 |   .9472443    .088765    -0.58   0.563       .78831    1.138222
        age3 |    1.09022   .2015942     0.47   0.640      .758782     1.56643
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.084529   .0433796     2.03   0.042     1.002754    1.172973
             |
   ethnicity |
Asian or ..  |   .9386668   .0662126    -0.90   0.370     .8174638     1.07784
      Other  |   .9903469    .069222    -0.14   0.890     .8635574    1.135752
             |
   obese4cat |
Obese I ..)  |   .9983308   .0587543    -0.03   0.977      .889568    1.120392
Obese II..)  |   .8811906   .0669096    -1.67   0.096     .7593419    1.022592
Obese II..)  |   1.017649   .0859642     0.21   0.836     .8623715    1.200887
             |
smoke_nomiss |
     Former  |   1.196527   .1594335     1.35   0.178     .9215156    1.553612
    Current  |    .980399   .0579925    -0.33   0.738     .8730772    1.100913
             |
         imd |
          4  |   1.018743   .0499454     0.38   0.705     .9254076    1.121491
5 most de..  |   .9675845   .0644014    -0.50   0.621     .8492466    1.102412
             |
tot_adults~h |
          2  |   .7396969   1.027275    -0.22   0.828     .0486322    11.25081
          3  |   1.846638   1.904034     0.59   0.552     .2447507    13.93284
             |
    1.shield |   3.41e+08   3.93e+08    17.04   0.000     3.56e+07    3.27e+09
1.htdiag_o~p |    1.02559   .0422479     0.61   0.540     .9460398    1.111828
1.~y_disease |   .9624485   .0522356    -0.71   0.481     .8653258    1.070472
    1.asthma |   .9485271   .0772488    -0.65   0.516     .8085879    1.112685
1.~c_disease |   .9597073   .0501796    -0.79   0.432     .8662287    1.063274
             |
     diabcat |
T1DM, con..  |   .6615353   .1032938    -2.65   0.008     .4871293    .8983836
T1DM, unc..  |   1.288242   .2879287     1.13   0.257     .8312839     1.99639
T2DM, con..  |   .9162681   .0546411    -1.47   0.143     .8151953    1.029872
T2DM, unc..  |   1.208521   .1185198     1.93   0.053      .997187    1.464642
Diabetes,..  |   .8744259   .6237896    -0.19   0.851     .2160235    3.539525
             |
cancer_exh~t |
  Last year  |   .6460611    .247676    -1.14   0.254     .3047574    1.369597
2-5 years..  |   1.185618   .1638263     1.23   0.218     .9043312    1.554398
   5+ years  |   .9702987   .0505583    -0.58   0.563     .8760983    1.074628
             |
cancer_hae~t |
  Last year  |   1.620131   .3627113     2.16   0.031     1.044684    2.512553
2-5 years..  |   1.017244   .1793264     0.10   0.923     .7200617    1.437079
   5+ years  |   .9392534   .0498038    -1.18   0.237     .8465408     1.04212
             |
1.~r_disease |   .9299727   .0475918    -1.42   0.156       .84122    1.028089
1.stroke_d~a |   1.019797   .0502022     0.40   0.690     .9259998    1.123094
1.other_ne~o |   .9895275    .049895    -0.21   0.835      .896412    1.092315
             |
reduced_ki~t |
Stage 3a/..  |   1.076996   .1176471     0.68   0.497     .8694249    1.334124
      1.esrd |   .9996383   .0467039    -0.01   0.994     .9121665    1.095498
1.other_tr~t |   .9822848   .0520533    -0.34   0.736     .8853816    1.089794
  1.asplenia |   .9789383   .0494834    -0.42   0.674      .886602    1.080891
1.ra_sle_p~s |     1.0463   .0523084     0.91   0.365     .9486401    1.154014
1.other_im~o |   .9115263   .0478951    -1.76   0.078     .8223256    1.010403
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.98e-09   8.59e-10   -46.29   0.000     8.49e-10    4.63e-09
          1 #|
 only 12-18  |   1.800953          .        .       .            .           .
    1#mixed  |   3.15e-09   3.64e-09   -16.96   0.000     3.29e-10    3.03e-08
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4218739   .1826302    -1.99   0.046     .1805907    .9855299
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7490368    .535911    -0.40   0.686     .1842878    3.044456
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5996036   .1962306    -1.56   0.118      .315714    1.138766
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 1_timeperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_1_timep
> eriod3.ster saved
(no new episodes generated)
(cat_time: 59002 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       32.84       32.84
          1 |     22,010       23.92       56.75
          2 |     16,278       17.69       74.44
          3 |     11,809       12.83       87.28
          4 |      8,905        9.68       96.95
        400 |      2,803        3.05      100.00
------------+-----------------------------------
      Total |     92,022      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,824      7,393 |    30,217 
         1 |    16,905      5,105 |    22,010 
         2 |    12,396      3,882 |    16,278 
         3 |     9,346      2,463 |    11,809 
         4 |     4,071      4,834 |     8,905 
       400 |     2,216        587 |     2,803 
-----------+----------------------+----------
     Total |    67,758     24,264 |    92,022 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,147      3,719 |    13,866 
         1 |    57,611     20,549 |    78,160 
-----------+----------------------+----------
     Total |    67,758     24,268 |    92,026 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -30664.143
Iteration 1:   log pseudolikelihood =  -30650.59
Iteration 2:   log pseudolikelihood = -30645.686
Iteration 3:   log pseudolikelihood = -30645.288
Iteration 4:   log pseudolikelihood = -30645.283
Iteration 5:   log pseudolikelihood = -30645.283
Refining estimates:
Iteration 0:   log pseudolikelihood = -30645.283

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        8,905             Number of obs    =       8,905
No. of failures      =        4,834
Time at risk         =       770042
                                                Wald chi2(46)    =       50.43
Log pseudolikelihood =   -30645.283             Prob > chi2      =      0.3028

                       (Std. Err. adjusted for 1,024 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.413918   1.750307     0.28   0.780     .1249427    16.00065
 only 12-18  |   .6994014   .7393331    -0.34   0.735     .0880899    5.552987
      mixed  |   1.483822   1.359768     0.43   0.667     .2462318    8.941683
             |
        age1 |   1.003244   .0126437     0.26   0.797     .9787663    1.028334
        age2 |   1.034143   .0696145     0.50   0.618     .9063185    1.179995
        age3 |    .915422    .122581    -0.66   0.509     .7041089    1.190153
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    1.00246   .0286416     0.09   0.931     .9478661    1.060198
             |
   ethnicity |
Asian or ..  |   1.033144   .0489123     0.69   0.491     .9415905    1.133598
      Other  |    1.04355   .0488237     0.91   0.362     .9521139    1.143767
             |
   obese4cat |
Obese I ..)  |   .9431791   .0402438    -1.37   0.170     .8675108    1.025447
Obese II..)  |   .9377667   .0471244    -1.28   0.201     .8498073     1.03483
Obese II..)  |   .9723263   .0626449    -0.44   0.663     .8569805    1.103197
             |
smoke_nomiss |
     Former  |    .957026    .095912    -0.44   0.661     .7863527    1.164743
    Current  |   .9041771   .0417102    -2.18   0.029     .8260134    .9897373
             |
         imd |
          4  |   1.002827   .0360772     0.08   0.937     .9345518    1.076089
5 most de..  |   1.064373   .0520355     1.28   0.202     .9671193    1.171407
             |
tot_adults~h |
          2  |   1.110562   .5672338     0.21   0.837     .4081132    3.022073
          3  |   .5102182    .211421    -1.62   0.104     .2264855    1.149401
             |
    1.shield |   2.559552   2.585112     0.93   0.352      .353559    18.52959
1.htdiag_o~p |   .9960829   .0312207    -0.13   0.900     .9367331    1.059193
1.~y_disease |   .9994025   .0378676    -0.02   0.987     .9278723    1.076447
    1.asthma |   .9663831   .0546068    -0.61   0.545     .8650695    1.079562
1.~c_disease |   1.020446   .0358433     0.58   0.564     .9525579    1.093172
             |
     diabcat |
T1DM, con..  |    .995791   .0944641    -0.04   0.965     .8268378    1.199268
T1DM, unc..  |    .981594   .1739149    -0.10   0.916     .6936166    1.389135
T2DM, con..  |   .9851686    .038949    -0.38   0.705     .9117127    1.064543
T2DM, unc..  |   .9250286   .0708279    -1.02   0.309     .7961227    1.074806
Diabetes,..  |   .4718319   .2475726    -1.43   0.152     .1687165    1.319524
             |
cancer_exh~t |
  Last year  |   .9496321   .2355113    -0.21   0.835     .5840569     1.54403
2-5 years..  |   .9419585   .1108851    -0.51   0.611     .7478774    1.186406
   5+ years  |   1.009682   .0392699     0.25   0.804     .9355749    1.089659
             |
cancer_hae~t |
  Last year  |   1.027757   .2385849     0.12   0.906     .6520659    1.619905
2-5 years..  |   .9595123     .12593    -0.31   0.753     .7418834    1.240982
   5+ years  |    1.00871   .0411888     0.21   0.832     .9311272    1.092757
             |
1.~r_disease |   .9704857   .0363975    -0.80   0.424     .9017067    1.044511
1.stroke_d~a |   .9721033   .0347587    -0.79   0.429     .9063097    1.042673
1.other_ne~o |    1.01179   .0372314     0.32   0.750     .9413875    1.087459
             |
reduced_ki~t |
Stage 3a/..  |   1.082964   .0813102     1.06   0.288     .9347699    1.254651
      1.esrd |   .9988962   .0307528    -0.04   0.971     .9404044    1.061026
1.other_tr~t |   1.004715   .0374948     0.13   0.900     .9338494    1.080957
  1.asplenia |    .976854   .0372246    -0.61   0.539     .9065532    1.052606
1.ra_sle_p~s |    1.00306   .0356476     0.09   0.931       .93557    1.075419
1.other_im~o |   1.019921     .03658     0.55   0.582     .9506871    1.094196
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .3819465   .4963794    -0.74   0.459     .0299073    4.877842
          1 #|
 only 12-18  |   .9757349   1.155305    -0.02   0.983      .095825     9.93539
    1#mixed  |   .3971156   .4010921    -0.91   0.361     .0548519    2.875027
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .540041   .1650679    -2.02   0.044      .296654    .9831129
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6824303    .270603    -0.96   0.335     .3137131    1.484513
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5892488   .1587548    -1.96   0.050     .3475112    .9991451
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 1_timeperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_1_timep
> eriod4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_shield_covid_tpp_prob
> .log
  log type:  text
 closed on:  15 Mar 2023, 14:21:45
-------------------------------------------------------------------------------
