-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_sex_covid_death.log
  log type:  text
 opened on:  15 Mar 2023, 14:12:36

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 12. stsplit cat_time, at(0,92,161,222,270, 400)
 13. recode cat_time 92=1 161=2 222=3 270=4
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18.  
. foreach int_type in  male  {
 19. 
. tab male `outcome'
 20. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 21. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         1.`int_type'#0.`exposure_type' 1.`int_type'#1.`exposu
> re_type' 1.`int_type'#2.`exposure_type' 1.`int_type'#3.`exposure_type' ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id) 
 22.         if _rc==0{
 23. testparm 1.`int_type'#i.`exposure_type'
 24. di _n "`exposure_type' " _n "****************"
 25. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 26. di "`exposure_type'" _n "****************"
 27. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 28. di "`exposure_type'" _n "****************"
 29. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 30. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_timeperiod`period', replace
 31. }
 32. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 33. }
 34. drop cat_time
 35. }
 36. }
 37. }
(342,392 observations (episodes) created)
(cat_time: 302871 changes made)
(covid_death: 342392 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.85       23.85
          1 |     91,677       20.39       44.24
          2 |     79,998       17.79       62.03
          3 |     69,728       15.51       77.54
          4 |     61,468       13.67       91.21
        400 |     39,521        8.79      100.00
------------+-----------------------------------
      Total |    449,618      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    48,270     13,198 |    61,468 
       400 |    36,753      2,768 |    39,521 
-----------+----------------------+----------
     Total |   406,195     43,423 |   449,618 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |   208,369     22,242 |   230,611 
         1 |   197,832     21,187 |   219,019 
-----------+----------------------+----------
     Total |   406,201     43,429 |   449,630 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -85541.241
Iteration 1:   log pseudolikelihood = -85521.995
Iteration 2:   log pseudolikelihood = -85521.741
Iteration 3:   log pseudolikelihood =  -85521.74
Refining estimates:
Iteration 0:   log pseudolikelihood =  -85521.74

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      107,226             Number of obs    =     107,226
No. of failures      =        9,293
Time at risk         =      9163046
                                                Wald chi2(45)    =       45.34
Log pseudolikelihood =    -85521.74             Prob > chi2      =      0.4576

                       (Std. Err. adjusted for 1,373 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8924435   .2829307    -0.36   0.720     .4794298    1.661256
 only 12-18  |   1.196327   .4905786     0.44   0.662     .5355464    2.672408
      mixed  |   1.114858   .3130622     0.39   0.699      .642976    1.933057
             |
        age1 |   .9989268   .0039238    -0.27   0.785     .9912659    1.006647
        age2 |   .9988594   .0124864    -0.09   0.927     .9746839    1.023635
        age3 |   1.009182   .0361286     0.26   0.798     .9407984    1.082536
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.029419   .3628225     0.08   0.934     .5159205    2.054004
             |
   ethnicity |
Asian or ..  |   .9707603   .0327379    -0.88   0.379     .9086698    1.037093
      Other  |     1.0597    .036441     1.69   0.092     .9906309    1.133585
             |
   obese4cat |
Obese I ..)  |   .9956151   .0300354    -0.15   0.884     .9384534    1.056259
Obese II..)  |   .9858966   .0381309    -0.37   0.713     .9139239    1.063537
Obese II..)  |   1.069656   .0438125     1.64   0.100     .9871416    1.159068
             |
smoke_nomiss |
     Former  |   1.036788   .0743124     0.50   0.614     .9009066    1.193165
    Current  |    .942076   .0298424    -1.88   0.060     .8853646     1.00242
             |
         imd |
          4  |   .9958699   .0259137    -0.16   0.874     .9463534    1.047977
5 most de..  |   .9803787    .033682    -0.58   0.564     .9165368    1.048667
             |
tot_adults~h |
          2  |   .5955763   .2760965    -1.12   0.264     .2400703     1.47753
          3  |   .5926974   .2072815    -1.50   0.135     .2986387    1.176305
             |
1.htdiag_o~p |   1.004305   .0229444     0.19   0.851     .9603265    1.050297
1.~y_disease |    1.03166   .0268932     1.20   0.232     .9802743     1.08574
    1.asthma |    .990349   .0349245    -0.28   0.783     .9242104    1.061221
1.~c_disease |   1.026886   .0258291     1.05   0.292     .9774893    1.078779
             |
     diabcat |
T1DM, con..  |   .9984144   .0677455    -0.02   0.981     .8740861    1.140427
T1DM, unc..  |   .8609732     .13148    -0.98   0.327     .6382663    1.161388
T2DM, con..  |    1.01957    .028549     0.69   0.489     .9651228    1.077089
T2DM, unc..  |    1.12524   .0578706     2.29   0.022     1.017345    1.244578
Diabetes,..  |    1.63554   .4505985     1.79   0.074     .9531279    2.806538
             |
cancer_exh~t |
  Last year  |   1.300031   .2021546     1.69   0.092        .9585    1.763256
2-5 years..  |   1.065319   .0873785     0.77   0.440     .9071171    1.251112
   5+ years  |   1.009116   .0278313     0.33   0.742     .9560158    1.065166
             |
cancer_hae~t |
  Last year  |    1.03769   .1635354     0.23   0.814     .7619422    1.413231
2-5 years..  |   .9782202   .0886599    -0.24   0.808     .8190095    1.168381
   5+ years  |   .9954453   .0275244    -0.17   0.869     .9429341    1.050881
             |
1.~r_disease |   1.039029   .0252202     1.58   0.115     .9907552    1.089654
1.stroke_d~a |   .9971192   .0268389    -0.11   0.915     .9458794    1.051135
1.other_ne~o |    1.03725   .0268499     1.41   0.158     .9859377    1.091233
             |
reduced_ki~t |
Stage 3a/..  |   .8884776   .1602942    -0.66   0.512      .623846    1.265364
      1.esrd |   .9871698   .0208205    -0.61   0.540     .9471943    1.028832
1.other_tr~t |    .973789    .025011    -1.03   0.301     .9259818    1.024065
  1.asplenia |   .9789027   .0255275    -0.82   0.414     .9301268    1.030236
1.ra_sle_p~s |   1.009009    .024513     0.37   0.712     .9620902    1.058216
1.other_im~o |   1.025241   .0266354     0.96   0.337     .9743439    1.078798
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.249381   .5056937     0.55   0.582     .5651533    2.761998
          1 #|
 only 12-18  |    1.02752   .5843641     0.05   0.962     .3370549    3.132419
    1#mixed  |   .9865197   .3483438    -0.04   0.969     .4937912    1.970916
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    1.39
         Prob > chi2 =    0.7077

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.115002   .3263389     0.37   0.710     .6282691    1.978816
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.22925   .4770407     0.53   0.595     .5745269    2.630085
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.09983   .2672044     0.39   0.695     .6831649     1.77062
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_tim
> eperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_timeperiod
> 0.ster saved
(no new episodes generated)
(cat_time: 302871 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.85       23.85
          1 |     91,677       20.39       44.24
          2 |     79,998       17.79       62.03
          3 |     69,728       15.51       77.54
          4 |     61,468       13.67       91.21
        400 |     39,521        8.79      100.00
------------+-----------------------------------
      Total |    449,618      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    48,270     13,198 |    61,468 
       400 |    36,753      2,768 |    39,521 
-----------+----------------------+----------
     Total |   406,195     43,423 |   449,618 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |   208,369     22,242 |   230,611 
         1 |   197,832     21,187 |   219,019 
-----------+----------------------+----------
     Total |   406,201     43,429 |   449,630 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -63724.351
Iteration 1:   log pseudolikelihood = -63705.562
Iteration 2:   log pseudolikelihood = -63704.985
Iteration 3:   log pseudolikelihood = -63704.979
Iteration 4:   log pseudolikelihood = -63704.979
Refining estimates:
Iteration 0:   log pseudolikelihood = -63704.979

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       91,677             Number of obs    =      91,677
No. of failures      =        7,035
Time at risk         =      5926371
                                                Wald chi2(45)    =       43.69
Log pseudolikelihood =   -63704.979             Prob > chi2      =      0.5276

                       (Std. Err. adjusted for 1,354 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.078965   .4115895     0.20   0.842     .5108604    2.278834
 only 12-18  |   2.079951   .9087046     1.68   0.094     .8834331    4.897026
      mixed  |   1.077323   .3723833     0.22   0.829     .5471705    2.121138
             |
        age1 |   1.006606   .0045948     1.44   0.149     .9976404    1.015652
        age2 |   .9787596   .0141626    -1.48   0.138     .9513914    1.006915
        age3 |   1.071583   .0439687     1.68   0.092       .98878     1.16132
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    1.01169   .4679292     0.03   0.980     .4086468    2.504651
             |
   ethnicity |
Asian or ..  |   .9395891   .0394057    -1.49   0.137     .8654445    1.020086
      Other  |   1.004352   .0396025     0.11   0.912     .9296561    1.085049
             |
   obese4cat |
Obese I ..)  |   .9713355   .0353583    -0.80   0.424      .904449    1.043168
Obese II..)  |   1.004493    .043495     0.10   0.918     .9227615    1.093463
Obese II..)  |   1.077308   .0530214     1.51   0.130      .978243    1.186405
             |
smoke_nomiss |
     Former  |   1.113205   .0865443     1.38   0.168     .9558727    1.296434
    Current  |   .9888353   .0351296    -0.32   0.752     .9223249    1.060142
             |
         imd |
          4  |   .9986849   .0294208    -0.04   0.964     .9426544    1.058046
5 most de..  |   .9962515   .0392729    -0.10   0.924     .9221765    1.076277
             |
tot_adults~h |
          2  |   1.153275   .8346413     0.20   0.844     .2791939    4.763865
          3  |   1.618269   .9354563     0.83   0.405     .5212011    5.024538
             |
1.htdiag_o~p |   .9920339   .0248928    -0.32   0.750     .9444252    1.042042
1.~y_disease |   1.023715   .0313484     0.77   0.444     .9640806    1.087038
    1.asthma |   1.033855   .0437661     0.79   0.432     .9515375    1.123294
1.~c_disease |   .9629256   .0288433    -1.26   0.207     .9080212     1.02115
             |
     diabcat |
T1DM, con..  |    1.05941   .0771411     0.79   0.428     .9185093    1.221924
T1DM, unc..  |   1.083035   .1810275     0.48   0.633     .7804873    1.502863
T2DM, con..  |   .9812365   .0325776    -0.57   0.568     .9194187    1.047211
T2DM, unc..  |   .9951603    .062752    -0.08   0.939     .8794653    1.126075
Diabetes,..  |   1.020747   .4188126     0.05   0.960     .4567408    2.281215
             |
cancer_exh~t |
  Last year  |   .9456492   .1822493    -0.29   0.772     .6481613    1.379676
2-5 years..  |   1.075371   .1033231     0.76   0.449     .8907865    1.298204
   5+ years  |   1.024789   .0320563     0.78   0.434     .9638473    1.089584
             |
cancer_hae~t |
  Last year  |   .9011111   .1845165    -0.51   0.611     .6032281    1.346093
2-5 years..  |    .973529   .0923987    -0.28   0.777     .8082773    1.172566
   5+ years  |   1.013944    .031225     0.45   0.653     .9545546    1.077029
             |
1.~r_disease |   1.009091   .0293469     0.31   0.756     .9531807    1.068281
1.stroke_d~a |   1.036431   .0306779     1.21   0.227     .9780147    1.098338
1.other_ne~o |   1.009972   .0296556     0.34   0.735     .9534885      1.0698
             |
reduced_ki~t |
Stage 3a/..  |   1.116397   .2158988     0.57   0.569     .7641975    1.630916
      1.esrd |   1.014309   .0255937     0.56   0.573     .9653663    1.065733
1.other_tr~t |   .9925291   .0313885    -0.24   0.813     .9328766    1.055996
  1.asplenia |   1.026119   .0291317     0.91   0.364      .970582    1.084835
1.ra_sle_p~s |    .947045    .027275    -1.89   0.059     .8950677    1.002041
1.other_im~o |   .9705827   .0290768    -1.00   0.319      .915234    1.029279
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .9787376   .5075888    -0.04   0.967     .3541765    2.704661
          1 #|
 only 12-18  |   .9347437   .6148601    -0.10   0.918     .2575047    3.393125
    1#mixed  |   1.004028   .4649813     0.01   0.993     .4050804    2.488575
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    0.03
         Prob > chi2 =    0.9983

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.056024   .3751527     0.15   0.878     .5263616     2.11867
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.944221   .8643702     1.50   0.135     .8134198    4.647041
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.081663   .3296077     0.26   0.797     .5952659    1.965498
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_tim
> eperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_timeperiod
> 1.ster saved
(no new episodes generated)
(cat_time: 302871 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.85       23.85
          1 |     91,677       20.39       44.24
          2 |     79,998       17.79       62.03
          3 |     69,728       15.51       77.54
          4 |     61,468       13.67       91.21
        400 |     39,521        8.79      100.00
------------+-----------------------------------
      Total |    449,618      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    48,270     13,198 |    61,468 
       400 |    36,753      2,768 |    39,521 
-----------+----------------------+----------
     Total |   406,195     43,423 |   449,618 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |   208,369     22,242 |   230,611 
         1 |   197,832     21,187 |   219,019 
-----------+----------------------+----------
     Total |   406,201     43,429 |   449,630 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -54447.161
Iteration 1:   log pseudolikelihood = -54425.998
Iteration 2:   log pseudolikelihood = -54425.699
Iteration 3:   log pseudolikelihood = -54425.698
Iteration 4:   log pseudolikelihood = -54425.698
Refining estimates:
Iteration 0:   log pseudolikelihood = -54425.698

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       79,998             Number of obs    =      79,998
No. of failures      =        6,103
Time at risk         =      4576325
                                                Wald chi2(45)    =       47.05
Log pseudolikelihood =   -54425.698             Prob > chi2      =      0.3886

                       (Std. Err. adjusted for 1,342 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.872263   .8181519     1.44   0.151     .7950677    4.408894
 only 12-18  |     1.1296   .7117528     0.19   0.847     .3285401    3.883834
      mixed  |   1.384101   .5556237     0.81   0.418     .6301838    3.039961
             |
        age1 |   .9995196   .0048346    -0.10   0.921     .9900888     1.00904
        age2 |   .9937386   .0153459    -0.41   0.684     .9641119    1.024276
        age3 |   1.025253   .0453287     0.56   0.573     .9401508    1.118059
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.606133    .882652     0.86   0.389     .5470193    4.715852
             |
   ethnicity |
Asian or ..  |   1.047113   .0448635     1.07   0.283     .9627728    1.138841
      Other  |   .9887132   .0427596    -0.26   0.793     .9083597    1.076175
             |
   obese4cat |
Obese I ..)  |   1.038444   .0383222     1.02   0.307     .9659858    1.116337
Obese II..)  |    .976273   .0466519    -0.50   0.615     .8889882    1.072128
Obese II..)  |     .93671   .0556026    -1.10   0.271     .8338315    1.052282
             |
smoke_nomiss |
     Former  |   1.211008   .0998409     2.32   0.020     1.030315     1.42339
    Current  |   1.015086   .0398498     0.38   0.703     .9399112    1.096274
             |
         imd |
          4  |   1.025292   .0348707     0.73   0.463      .959175    1.095967
5 most de..  |   1.088944   .0454448     2.04   0.041     1.003419    1.181758
             |
tot_adults~h |
          2  |   .5112055   .3834494    -0.89   0.371      .117522    2.223679
          3  |   1.060929   .5637781     0.11   0.911     .3744186    3.006181
             |
1.htdiag_o~p |   1.018868   .0277239     0.69   0.492     .9659542    1.074681
1.~y_disease |   .9713528   .0312307    -0.90   0.366     .9120305    1.034534
    1.asthma |   1.092468   .0493322     1.96   0.050     .9999343    1.193566
1.~c_disease |   .9757945   .0312959    -0.76   0.445     .9163439    1.039102
             |
     diabcat |
T1DM, con..  |   1.020468    .087002     0.24   0.812     .8634324    1.206063
T1DM, unc..  |   1.081325   .1840838     0.46   0.646     .7745482    1.509608
T2DM, con..  |   .9739437   .0345663    -0.74   0.457     .9084977    1.044104
T2DM, unc..  |   .9626863   .0688739    -0.53   0.595     .8367331    1.107599
Diabetes,..  |   1.253913   .5235447     0.54   0.588     .5531799    2.842291
             |
cancer_exh~t |
  Last year  |   1.281903   .2361675     1.35   0.178     .8933813     1.83939
2-5 years..  |   1.052007   .1045351     0.51   0.610     .8658387    1.278204
   5+ years  |   1.010344   .0335329     0.31   0.757     .9467125    1.078252
             |
cancer_hae~t |
  Last year  |   1.016549   .1985258     0.08   0.933     .6932568    1.490606
2-5 years..  |   .8692357   .0980739    -1.24   0.214     .6967844    1.084368
   5+ years  |   1.020461   .0334871     0.62   0.537     .9568941    1.088251
             |
1.~r_disease |   .9867497   .0335759    -0.39   0.695     .9230885    1.054801
1.stroke_d~a |   1.016602   .0323722     0.52   0.605     .9550933    1.082072
1.other_ne~o |   .9613549   .0329189    -1.15   0.250     .8989524    1.028089
             |
reduced_ki~t |
Stage 3a/..  |   .9803343   .2062073    -0.09   0.925     .6491263    1.480537
      1.esrd |   1.032464   .0277022     1.19   0.234     .9795716    1.088212
1.other_tr~t |    1.02577   .0330242     0.79   0.429     .9630436    1.092582
  1.asplenia |   .9946801   .0318918    -0.17   0.868     .9340968    1.059193
1.ra_sle_p~s |   1.008575   .0322585     0.27   0.790     .9472901    1.073824
1.other_im~o |   1.039409   .0327096     1.23   0.219     .9772369    1.105538
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .6761839   .3946527    -0.67   0.503     .2154089    2.122589
          1 #|
 only 12-18  |   1.070765   .8864353     0.08   0.934     .2113609    5.424547
    1#mixed  |    .623927   .3432984    -0.86   0.391     .2122188    1.834356
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    1.63
         Prob > chi2 =    0.6524

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.265994   .4861922     0.61   0.539     .5963983    2.687367
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.209535   .5890134     0.39   0.696     .4656984    3.141466
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8635776   .3127604    -0.40   0.685     .4246423    1.756222
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_tim
> eperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_timeperiod
> 2.ster saved
(no new episodes generated)
(cat_time: 302871 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.85       23.85
          1 |     91,677       20.39       44.24
          2 |     79,998       17.79       62.03
          3 |     69,728       15.51       77.54
          4 |     61,468       13.67       91.21
        400 |     39,521        8.79      100.00
------------+-----------------------------------
      Total |    449,618      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    48,270     13,198 |    61,468 
       400 |    36,753      2,768 |    39,521 
-----------+----------------------+----------
     Total |   406,195     43,423 |   449,618 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |   208,369     22,242 |   230,611 
         1 |   197,832     21,187 |   219,019 
-----------+----------------------+----------
     Total |   406,201     43,429 |   449,630 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -44177.005
Iteration 1:   log pseudolikelihood = -44145.687
Iteration 2:   log pseudolikelihood = -44145.365
Iteration 3:   log pseudolikelihood = -44145.364
Iteration 4:   log pseudolikelihood = -44145.364
Refining estimates:
Iteration 0:   log pseudolikelihood = -44145.364

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       69,728             Number of obs    =      69,728
No. of failures      =        5,026
Time at risk         =      3153749
                                                Wald chi2(45)    =       68.93
Log pseudolikelihood =   -44145.364             Prob > chi2      =      0.0124

                       (Std. Err. adjusted for 1,319 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.369826    .569121     0.76   0.449     .6067599    3.092529
 only 12-18  |   .7023716   .4686377    -0.53   0.596     .1899445    2.597211
      mixed  |   1.123365   .4342272     0.30   0.763     .5266182    2.396324
             |
        age1 |   .9935319    .005114    -1.26   0.207     .9835591    1.003606
        age2 |   1.020106   .0166665     1.22   0.223     .9879573      1.0533
        age3 |   .9521823    .044927    -1.04   0.299     .8680758    1.044438
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .5217886   .3095392    -1.10   0.273     .1631318    1.668978
             |
   ethnicity |
Asian or ..  |   1.077782   .0494837     1.63   0.103     .9850318    1.179266
      Other  |   .9972658   .0470108    -0.06   0.954     .9092547    1.093796
             |
   obese4cat |
Obese I ..)  |   1.069461   .0437727     1.64   0.101     .9870191    1.158789
Obese II..)  |   .9966543   .0517281    -0.06   0.949     .9002553    1.103376
Obese II..)  |     1.0852   .0649102     1.37   0.172     .9651529    1.220179
             |
smoke_nomiss |
     Former  |   .8606908   .0976023    -1.32   0.186     .6891614    1.074913
    Current  |   1.100964   .0460814     2.30   0.022     1.014252     1.19509
             |
         imd |
          4  |    .981997   .0349533    -0.51   0.610     .9158247    1.052951
5 most de..  |   .9816139   .0493555    -0.37   0.712     .8894926    1.083276
             |
tot_adults~h |
          2  |   .8517054    .565601    -0.24   0.809     .2317517    3.130083
          3  |   .5619418   .3028713    -1.07   0.285     .1953966    1.616091
             |
1.htdiag_o~p |   .9749617   .0292302    -0.85   0.398     .9193223    1.033969
1.~y_disease |   .9652063   .0348478    -0.98   0.327     .8992664    1.035981
    1.asthma |   1.065231   .0553183     1.22   0.224     .9621447    1.179363
1.~c_disease |   .9589045   .0365487    -1.10   0.271     .8898806    1.033282
             |
     diabcat |
T1DM, con..  |   .8417714   .0864704    -1.68   0.094      .688264    1.029516
T1DM, unc..  |   1.106166   .2126136     0.52   0.600     .7589498    1.612233
T2DM, con..  |   1.115758   .0412866     2.96   0.003     1.037702    1.199684
T2DM, unc..  |   1.042283   .0781131     0.55   0.581     .8998978    1.207198
Diabetes,..  |    1.70126   .7003069     1.29   0.197     .7592454    3.812057
             |
cancer_exh~t |
  Last year  |   .8823876   .2120806    -0.52   0.603      .550902    1.413333
2-5 years..  |   1.008272   .1176604     0.07   0.944     .8021338    1.267386
   5+ years  |   1.000097   .0376901     0.00   0.998     .9288881    1.076765
             |
cancer_hae~t |
  Last year  |   .9513323   .2187362    -0.22   0.828     .6062039    1.492952
2-5 years..  |   1.125238   .1248952     1.06   0.288     .9052444    1.398695
   5+ years  |   1.012249   .0366154     0.34   0.736      .942969    1.086619
             |
1.~r_disease |   1.052263   .0366048     1.46   0.143     .9829105     1.12651
1.stroke_d~a |   1.017217   .0357168     0.49   0.627     .9495683    1.089686
1.other_ne~o |   1.035095   .0358837     0.99   0.320     .9671007     1.10787
             |
reduced_ki~t |
Stage 3a/..  |   1.151376   .2389523     0.68   0.497     .7665875    1.729308
      1.esrd |   .9234534   .0273079    -2.69   0.007     .8714523    .9785574
1.other_tr~t |   .9699356     .03504    -0.84   0.398     .9036336    1.041102
  1.asplenia |    1.05678    .035916     1.62   0.104     .9886795    1.129572
1.ra_sle_p~s |   .9569364   .0335069    -1.26   0.209     .8934668    1.024915
1.other_im~o |   1.014313   .0369663     0.39   0.697     .9443872    1.089416
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.868596     1.2016     0.97   0.331     .5298476    6.589919
          1 #|
 only 12-18  |   4.900794   4.762465     1.64   0.102     .7296101    32.91866
    1#mixed  |   1.855932   1.102224     1.04   0.298     .5794816    5.944077
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    2.68
         Prob > chi2 =    0.4439

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.559651   1.315347     1.83   0.067      .934905    7.008001
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.442179   2.199001     1.93   0.053      .984129    12.03968
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.084888   1.017164     1.51   0.132     .8013144    5.424536
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_tim
> eperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_timeperiod
> 3.ster saved
(no new episodes generated)
(cat_time: 302871 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.85       23.85
          1 |     91,677       20.39       44.24
          2 |     79,998       17.79       62.03
          3 |     69,728       15.51       77.54
          4 |     61,468       13.67       91.21
        400 |     39,521        8.79      100.00
------------+-----------------------------------
      Total |    449,618      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    48,270     13,198 |    61,468 
       400 |    36,753      2,768 |    39,521 
-----------+----------------------+----------
     Total |   406,195     43,423 |   449,618 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |   208,369     22,242 |   230,611 
         1 |   197,832     21,187 |   219,019 
-----------+----------------------+----------
     Total |   406,201     43,429 |   449,630 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -112454.53
Iteration 1:   log pseudolikelihood = -112422.57
Iteration 2:   log pseudolikelihood = -112420.71
Iteration 3:   log pseudolikelihood = -112420.36
Iteration 4:   log pseudolikelihood = -112420.33
Iteration 5:   log pseudolikelihood = -112420.33
Iteration 6:   log pseudolikelihood = -112420.33
Refining estimates:
Iteration 0:   log pseudolikelihood = -112420.33

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       61,468             Number of obs    =      61,468
No. of failures      =       13,198
Time at risk         =      6574507
                                                Wald chi2(45)    =       70.30
Log pseudolikelihood =   -112420.33             Prob > chi2      =      0.0093

                       (Std. Err. adjusted for 1,306 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.129713   .2836121     0.49   0.627     .6906784    1.847824
 only 12-18  |   1.060619   .4041352     0.15   0.877     .5025969    2.238199
      mixed  |   1.123195   .2473958     0.53   0.598     .7294052    1.729583
             |
        age1 |    .990432   .0030577    -3.11   0.002     .9844572    .9964431
        age2 |   1.036395   .0103504     3.58   0.000     1.016306    1.056881
        age3 |   .8957998   .0259239    -3.80   0.000      .846404    .9480783
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.235347   .3655576     0.71   0.475     .6916811    2.206339
             |
   ethnicity |
Asian or ..  |   .9576906   .0288112    -1.44   0.151     .9028543    1.015858
      Other  |   .9952522   .0286994    -0.17   0.869     .9405625    1.053122
             |
   obese4cat |
Obese I ..)  |   1.019315   .0253257     0.77   0.441      .970867    1.070181
Obese II..)  |   .9991651   .0319291    -0.03   0.979     .9385047    1.063746
Obese II..)  |   .9535494   .0364297    -1.24   0.213     .8847562    1.027692
             |
smoke_nomiss |
     Former  |   1.067591   .0637214     1.10   0.273     .9497274    1.200081
    Current  |   1.030242   .0276374     1.11   0.267     .9774735     1.08586
             |
         imd |
          4  |   1.004237   .0216714     0.20   0.845     .9626471    1.047623
5 most de..  |   .9778624   .0293666    -0.75   0.456     .9219661    1.037148
             |
tot_adults~h |
          2  |   1.555952   .6423411     1.07   0.284     .6927808    3.494591
          3  |   1.077453   .3783488     0.21   0.832     .5413747    2.144365
             |
1.htdiag_o~p |    1.03125   .0200935     1.58   0.114       .99261    1.071394
1.~y_disease |   1.007815   .0216201     0.36   0.717     .9663185    1.051093
    1.asthma |   .9385584   .0297326    -2.00   0.045     .8820557    .9986804
1.~c_disease |   .9654075    .021412    -1.59   0.112     .9243399      1.0083
             |
     diabcat |
T1DM, con..  |   .9703622   .0537603    -0.54   0.587     .8705131    1.081664
T1DM, unc..  |   1.007483   .1163147     0.06   0.949     .8034629    1.263309
T2DM, con..  |    1.01647   .0245403     0.68   0.499     .9694918    1.065724
T2DM, unc..  |   1.021297   .0492928     0.44   0.662     .9291141    1.122627
Diabetes,..  |   .6990521   .2598134    -0.96   0.335     .3374019    1.448343
             |
cancer_exh~t |
  Last year  |   1.197769   .1520638     1.42   0.155     .9339161    1.536165
2-5 years..  |   1.136504   .0764584     1.90   0.057     .9961076    1.296688
   5+ years  |   .9937858   .0232729    -0.27   0.790     .9492027    1.040463
             |
cancer_hae~t |
  Last year  |   1.060195   .1451666     0.43   0.669     .8106543    1.386552
2-5 years..  |   1.051466   .0717336     0.74   0.462     .9198655    1.201895
   5+ years  |   1.021768   .0220418     1.00   0.318      .979467    1.065895
             |
1.~r_disease |   .9790135    .020958    -0.99   0.322     .9387864    1.020964
1.stroke_d~a |   1.004038   .0208615     0.19   0.846     .9639715     1.04577
1.other_ne~o |   .9944768   .0224253    -0.25   0.806     .9514813    1.039415
             |
reduced_ki~t |
Stage 3a/..  |   .9058532    .138236    -0.65   0.517     .6716791     1.22167
      1.esrd |   1.000094   .0175175     0.01   0.996     .9663428    1.035023
1.other_tr~t |   1.004415   .0239252     0.18   0.853     .9585999    1.052419
  1.asplenia |   .9769334   .0208402    -1.09   0.274     .9369295    1.018645
1.ra_sle_p~s |   .9996599    .020758    -0.02   0.987     .9597917    1.041184
1.other_im~o |    .959669   .0211792    -1.87   0.062     .9190435     1.00209
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |    .826666   .2920278    -0.54   0.590     .4136517    1.652058
          1 #|
 only 12-18  |   .0709271   .0683076    -2.75   0.006     .0107411    .4683569
    1#mixed  |   .8058874   .2389543    -0.73   0.467     .4506962    1.441003
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    7.58
         Prob > chi2 =    0.0555

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9338955   .2242542    -0.28   0.776     .5833124    1.495186
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0752266   .0771628    -2.52   0.012     .0100754    .5616702
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9051686   .1863413    -0.48   0.628     .6046417    1.355067
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_tim
> eperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_timeperiod
> 4.ster saved
(96,311 observations (episodes) created)
(cat_time: 85187 changes made)
(covid_death: 96311 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.88       23.88
          1 |     25,850       20.43       44.31
          2 |     22,519       17.80       62.11
          3 |     19,548       15.45       77.56
          4 |     17,270       13.65       91.21
        400 |     11,124        8.79      100.00
------------+-----------------------------------
      Total |    126,528      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    13,611      3,659 |    17,270 
       400 |    10,313        811 |    11,124 
-----------+----------------------+----------
     Total |   114,212     12,316 |   126,528 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    58,497      6,300 |    64,797 
         1 |    55,719      6,016 |    61,735 
-----------+----------------------+----------
     Total |   114,216     12,316 |   126,532 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -21300.757
Iteration 1:   log pseudolikelihood = -21277.563
Iteration 2:   log pseudolikelihood = -21275.961
Iteration 3:   log pseudolikelihood = -21275.774
Iteration 4:   log pseudolikelihood = -21275.716
Iteration 5:   log pseudolikelihood = -21275.695
Iteration 6:   log pseudolikelihood = -21275.687
Iteration 7:   log pseudolikelihood = -21275.684
Iteration 8:   log pseudolikelihood = -21275.683
Iteration 9:   log pseudolikelihood = -21275.682
Iteration 10:  log pseudolikelihood = -21275.682
Iteration 11:  log pseudolikelihood = -21275.682
Iteration 12:  log pseudolikelihood = -21275.682
Iteration 13:  log pseudolikelihood = -21275.682
Iteration 14:  log pseudolikelihood = -21275.682
Iteration 15:  log pseudolikelihood = -21275.682
Iteration 16:  log pseudolikelihood = -21275.682
Iteration 17:  log pseudolikelihood = -21275.682
Iteration 18:  log pseudolikelihood = -21275.682
Iteration 19:  log pseudolikelihood = -21275.682
Iteration 20:  log pseudolikelihood = -21275.682
Iteration 21:  log pseudolikelihood = -21275.682
Refining estimates:
Iteration 0:   log pseudolikelihood = -21275.682

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       30,217             Number of obs    =      30,217
No. of failures      =        2,683
Time at risk         =      2582909
                                                Wald chi2(44)    =     1609.30
Log pseudolikelihood =   -21275.682             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,204 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .6235142   .3602409    -0.82   0.414     .2009356    1.934798
 only 12-18  |    1.19397   .7600341     0.28   0.781     .3428876    4.157524
      mixed  |   .7416149   .3728828    -0.59   0.552     .2768188    1.986833
             |
        age1 |   1.023269   .0180509     1.30   0.192     .9884945    1.059267
        age2 |   .8579337   .0793725    -1.66   0.098     .7156556    1.028498
        age3 |   1.367424   .2497632     1.71   0.087     .9559367    1.956037
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.022605   .7208888     0.03   0.975     .2568326    4.071602
             |
   ethnicity |
Asian or ..  |   1.014033    .066621     0.21   0.832     .8915156    1.153387
      Other  |   .9953647   .0647378    -0.07   0.943     .8762353     1.13069
             |
   obese4cat |
Obese I ..)  |   1.005377    .053474     0.10   0.920     .9058482    1.115842
Obese II..)  |   1.060797   .0738259     0.85   0.396     .9255354    1.215826
Obese II..)  |   .9525596   .0829037    -0.56   0.577     .8031746    1.129729
             |
smoke_nomiss |
     Former  |   .8413664   .1306066    -1.11   0.266     .6206573    1.140561
    Current  |   .9604366   .0614625    -0.63   0.528     .8472208    1.088782
             |
         imd |
          4  |   .9100174   .0456449    -1.88   0.060     .8248118    1.004025
5 most de..  |   .9939593   .0658934    -0.09   0.927     .8728492    1.131874
             |
tot_adults~h |
          2  |   2.32e+09          .        .       .            .           .
          3  |   1.78e+09   1.14e+09    33.36   0.000     5.09e+08    6.21e+09
             |
1.htdiag_o~p |   .9858002   .0395658    -0.36   0.722     .9112244    1.066479
1.~y_disease |   .9305786   .0433006    -1.55   0.122     .8494658    1.019437
    1.asthma |   .9324871   .0626832    -1.04   0.298     .8173794    1.063805
1.~c_disease |   1.039702   .0486342     0.83   0.405     .9486201     1.13953
             |
     diabcat |
T1DM, con..  |   1.113933   .1359905     0.88   0.377     .8768862    1.415061
T1DM, unc..  |   1.583103   .3184081     2.28   0.022     1.067353    2.348068
T2DM, con..  |   1.026819   .0514565     0.53   0.597     .9307611    1.132791
T2DM, unc..  |    1.06926   .1053996     0.68   0.497     .8814112    1.297145
Diabetes,..  |   .4691221   .4736212    -0.75   0.453     .0648516    3.393524
             |
cancer_exh~t |
  Last year  |   1.229494   .3541499     0.72   0.473     .6991045    2.162275
2-5 years..  |   1.147045   .1560672     1.01   0.313     .8785483    1.497597
   5+ years  |    .873577   .0454433    -2.60   0.009     .7888998    .9673432
             |
cancer_hae~t |
  Last year  |   1.185462   .3511902     0.57   0.566     .6633174    2.118625
2-5 years..  |   .7804554   .1395841    -1.39   0.166     .5496814    1.108116
   5+ years  |   1.056608   .0527285     1.10   0.270     .9581558    1.165177
             |
1.~r_disease |    1.00678   .0502578     0.14   0.892     .9129415    1.110263
1.stroke_d~a |   1.063223   .0507425     1.28   0.199     .9682795    1.167477
1.other_ne~o |   1.005657   .0494667     0.11   0.909     .9132311    1.107437
             |
reduced_ki~t |
Stage 3a/..  |   1.075748    .107986     0.73   0.467     .8836191    1.309653
      1.esrd |   .9932322   .0403959    -0.17   0.867     .9171311    1.075648
1.other_tr~t |   1.029706   .0508393     0.59   0.553     .9347325     1.13433
  1.asplenia |   1.071945   .0494913     1.50   0.132     .9792028     1.17347
1.ra_sle_p~s |   1.030108   .0484192     0.63   0.528     .9394488    1.129517
1.other_im~o |   1.024306   .0483212     0.51   0.611     .9338446     1.12353
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |    1.67312   1.318754     0.65   0.514     .3569517    7.842321
          1 #|
 only 12-18  |   1.439951   1.149036     0.46   0.648     .3013806    6.879869
    1#mixed  |   .9631937   .6797584    -0.05   0.958     .2415416    3.840921
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    3.54
         Prob > chi2 =    0.3163

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.043214   .5300413     0.08   0.934     .3853813    2.823944
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.719258   1.016427     0.92   0.359      .539647    5.477372
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7143188    .334609    -0.72   0.473     .2852088    1.789045
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_tim
> eperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_timeperiod
> 0.ster saved
(no new episodes generated)
(cat_time: 85187 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.88       23.88
          1 |     25,850       20.43       44.31
          2 |     22,519       17.80       62.11
          3 |     19,548       15.45       77.56
          4 |     17,270       13.65       91.21
        400 |     11,124        8.79      100.00
------------+-----------------------------------
      Total |    126,528      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    13,611      3,659 |    17,270 
       400 |    10,313        811 |    11,124 
-----------+----------------------+----------
     Total |   114,212     12,316 |   126,528 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    58,497      6,300 |    64,797 
         1 |    55,719      6,016 |    61,735 
-----------+----------------------+----------
     Total |   114,216     12,316 |   126,532 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -15694.112
Iteration 1:   log pseudolikelihood = -15674.292
Iteration 2:   log pseudolikelihood = -15673.129
Iteration 3:   log pseudolikelihood = -15672.858
Iteration 4:   log pseudolikelihood = -15672.762
Iteration 5:   log pseudolikelihood = -15672.726
Iteration 6:   log pseudolikelihood = -15672.713
Iteration 7:   log pseudolikelihood = -15672.708
Iteration 8:   log pseudolikelihood = -15672.706
Iteration 9:   log pseudolikelihood = -15672.706
Iteration 10:  log pseudolikelihood = -15672.705
Iteration 11:  log pseudolikelihood = -15672.705
Iteration 12:  log pseudolikelihood = -15672.705
Iteration 13:  log pseudolikelihood = -15672.705
Iteration 14:  log pseudolikelihood = -15672.705
Iteration 15:  log pseudolikelihood = -15672.705
Iteration 16:  log pseudolikelihood = -15672.705
Iteration 17:  log pseudolikelihood = -15672.705
Iteration 18:  log pseudolikelihood = -15672.705
Iteration 19:  log pseudolikelihood = -15672.705
Iteration 20:  log pseudolikelihood = -15672.705
Iteration 21:  log pseudolikelihood = -15672.705
Iteration 22:  log pseudolikelihood = -15672.705
Iteration 23:  log pseudolikelihood = -15672.705
Iteration 24:  log pseudolikelihood = -15672.705
Iteration 25:  log pseudolikelihood = -15672.705
Iteration 26:  log pseudolikelihood = -15672.705
Iteration 27:  log pseudolikelihood = -15672.705
Iteration 28:  log pseudolikelihood = -15672.705
Iteration 29:  log pseudolikelihood = -15672.705
Refining estimates:
Iteration 0:   log pseudolikelihood = -15672.705
Iteration 1:   log pseudolikelihood = -15672.705
Iteration 2:   log pseudolikelihood = -15672.705

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       25,850             Number of obs    =      25,850
No. of failures      =        2,014
Time at risk         =      1670587
                                                Wald chi2(45)    =    22680.95
Log pseudolikelihood =   -15672.705             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,185 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.910609   2.033993     0.61   0.543     .2371379    15.39368
 only 12-18  |   1.285479   1.813989     0.18   0.859     .0808913     20.4281
      mixed  |   2.006312   2.025148     0.69   0.490     .2774631    14.50747
             |
        age1 |   1.023893   .0213969     1.13   0.259     .9828031    1.066701
        age2 |   .8876952   .0962145    -1.10   0.272     .7178022    1.097799
        age3 |   1.269139    .270569     1.12   0.264     .8356812    1.927426
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   2.874351   3.354457     0.90   0.366      .291851     28.3086
             |
   ethnicity |
Asian or ..  |   1.112567   .0796409     1.49   0.136     .9669293    1.280141
      Other  |   1.066184   .0739312     0.92   0.355     .9306967    1.221395
             |
   obese4cat |
Obese I ..)  |   .9345881   .0615162    -1.03   0.304     .8214719     1.06328
Obese II..)  |   1.011932    .080313     0.15   0.881     .8661535    1.182246
Obese II..)  |   .9294559   .0921853    -0.74   0.461     .7652528    1.128893
             |
smoke_nomiss |
     Former  |   .9465985   .1549331    -0.34   0.737     .6868259    1.304623
    Current  |   .9332775   .0665592    -0.97   0.333     .8115308    1.073289
             |
         imd |
          4  |   1.015969   .0580714     0.28   0.782     .9082945    1.136407
5 most de..  |   .9492068   .0713184    -0.69   0.488     .8192303    1.099805
             |
tot_adults~h |
          2  |   1.285403   4.012286     0.08   0.936     .0028319    583.4433
          3  |   3.96e+13   1.24e+14     9.99   0.000     8.50e+10    1.84e+16
             |
1.htdiag_o~p |    1.00649   .0487459     0.13   0.894     .9153438    1.106711
1.~y_disease |   1.162142    .063275     2.76   0.006     1.044513    1.293018
    1.asthma |   .9760006   .0799479    -0.30   0.767     .8312372    1.145975
1.~c_disease |   1.097436   .0605766     1.68   0.092      .984905    1.222824
             |
     diabcat |
T1DM, con..  |   .8191714   .1316317    -1.24   0.214     .5978554    1.122415
T1DM, unc..  |   1.138712   .3159377     0.47   0.640     .6610683    1.961468
T2DM, con..  |   1.041076   .0658051     0.64   0.524     .9197694    1.178381
T2DM, unc..  |   .8955415   .1184957    -0.83   0.404     .6909664    1.160685
Diabetes,..  |   1.940602   1.183807     1.09   0.277     .5870647    6.414854
             |
cancer_exh~t |
  Last year  |   1.705442   .4849534     1.88   0.060     .9767704    2.977705
2-5 years..  |   1.118279   .2019948     0.62   0.536     .7848694    1.593319
   5+ years  |   .9747597   .0571598    -0.44   0.663     .8689268    1.093483
             |
cancer_hae~t |
  Last year  |   .7777078   .3214428    -0.61   0.543     .3459371     1.74838
2-5 years..  |    1.00516   .1805369     0.03   0.977     .7068886    1.429288
   5+ years  |   .9702093     .05737    -0.51   0.609     .8640375    1.089427
             |
1.~r_disease |    .950145   .0567722    -0.86   0.392     .8451419    1.068194
1.stroke_d~a |   1.019073   .0522205     0.37   0.712     .9216943    1.126739
1.other_ne~o |   1.079541   .0597824     1.38   0.167     .9685041    1.203307
             |
reduced_ki~t |
Stage 3a/..  |    .866735   .1149583    -1.08   0.281      .668326    1.124047
      1.esrd |   1.047778   .0502102     0.97   0.330     .9538475    1.150957
1.other_tr~t |   .9722949   .0535871    -0.51   0.610       .87274    1.083206
  1.asplenia |   1.014326   .0585353     0.25   0.805     .9058496    1.135793
1.ra_sle_p~s |   .9706582   .0536764    -0.54   0.590     .8709552    1.081775
1.other_im~o |   .9446847    .051832    -1.04   0.300     .8483675    1.051937
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .4596478   .5822417    -0.61   0.539     .0383882    5.503676
          1 #|
 only 12-18  |   .9194307   1.510924    -0.05   0.959     .0367044    23.03138
    1#mixed  |   .3395996    .396496    -0.93   0.355     .0344473    3.347949
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    1.96
         Prob > chi2 =    0.5808

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8782071   .5907923    -0.19   0.847     .2349481     3.28263
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.181909   .9483327     0.21   0.835     .2452461    5.695945
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6813427    .400378    -0.65   0.514     .2153641    2.155549
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_tim
> eperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_timeperiod
> 1.ster saved
(no new episodes generated)
(cat_time: 85187 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.88       23.88
          1 |     25,850       20.43       44.31
          2 |     22,519       17.80       62.11
          3 |     19,548       15.45       77.56
          4 |     17,270       13.65       91.21
        400 |     11,124        8.79      100.00
------------+-----------------------------------
      Total |    126,528      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    13,611      3,659 |    17,270 
       400 |    10,313        811 |    11,124 
-----------+----------------------+----------
     Total |   114,212     12,316 |   126,528 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    58,497      6,300 |    64,797 
         1 |    55,719      6,016 |    61,735 
-----------+----------------------+----------
     Total |   114,216     12,316 |   126,532 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -13581.505
Iteration 1:   log pseudolikelihood = -13558.701
Iteration 2:   log pseudolikelihood = -13555.108
Iteration 3:   log pseudolikelihood = -13554.362
Iteration 4:   log pseudolikelihood = -13554.139
Iteration 5:   log pseudolikelihood = -13554.057
Iteration 6:   log pseudolikelihood = -13554.026
Iteration 7:   log pseudolikelihood = -13554.015
Iteration 8:   log pseudolikelihood = -13554.011
Iteration 9:   log pseudolikelihood = -13554.009
Iteration 10:  log pseudolikelihood = -13554.009
Iteration 11:  log pseudolikelihood = -13554.008
Iteration 12:  log pseudolikelihood = -13554.008
Iteration 13:  log pseudolikelihood = -13554.008
Iteration 14:  log pseudolikelihood = -13554.008
Iteration 15:  log pseudolikelihood = -13554.008
Iteration 16:  log pseudolikelihood = -13554.008
Iteration 17:  log pseudolikelihood = -13554.008
Iteration 18:  log pseudolikelihood = -13554.008
Iteration 19:  log pseudolikelihood = -13554.008
Iteration 20:  log pseudolikelihood = -13554.008
Iteration 21:  log pseudolikelihood = -13554.008
Iteration 22:  log pseudolikelihood = -13554.008
Refining estimates:
Iteration 0:   log pseudolikelihood = -13554.008

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       22,519             Number of obs    =      22,519
No. of failures      =        1,775
Time at risk         =      1283270
                                                Wald chi2(42)    =     2894.60
Log pseudolikelihood =   -13554.008             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,170 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   7.43e+08   4.75e+08    31.96   0.000     2.12e+08    2.60e+09
 only 12-18  |   .7155743   .4803076    -0.50   0.618     .1920045    2.666847
      mixed  |   8.96e+08   6.99e+08    26.42   0.000     1.94e+08    4.14e+09
             |
        age1 |   1.015724   .0210391     0.75   0.451     .9753142    1.057809
        age2 |   .8867087    .099089    -1.08   0.282     .7122949     1.10383
        age3 |   1.279241   .2840308     1.11   0.267      .827865    1.976721
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   2.29e+09   1.44e+09    34.32   0.000     6.69e+08    7.85e+09
             |
   ethnicity |
Asian or ..  |    .890243   .0740916    -1.40   0.162     .7562515    1.047975
      Other  |   .8906371   .0706852    -1.46   0.144     .7623341    1.040534
             |
   obese4cat |
Obese I ..)  |   .9449322   .0648054    -0.83   0.409     .8260826    1.080881
Obese II..)  |   .9512684   .0797873    -0.60   0.551     .8070656    1.121237
Obese II..)  |   .8744634   .0925311    -1.27   0.205     .7106765    1.075998
             |
smoke_nomiss |
     Former  |   .7751231   .1452735    -1.36   0.174     .5368322    1.119187
    Current  |   .9317525   .0706145    -0.93   0.351     .8031391    1.080962
             |
         imd |
          4  |   1.003842   .0629737     0.06   0.951     .8877022    1.135177
5 most de..  |   1.107882   .0843574     1.35   0.178       .95429    1.286194
             |
tot_adults~h |
          2  |   2.12e+09          .        .       .            .           .
          3  |   2.80e+09   3.21e+09    18.94   0.000     2.94e+08    2.66e+10
             |
1.htdiag_o~p |   .9841043   .0480083    -0.33   0.743     .8943682    1.082844
1.~y_disease |   .9149438   .0576416    -1.41   0.158     .8086649     1.03519
    1.asthma |   1.056772   .0880486     0.66   0.507     .8975534    1.244234
1.~c_disease |    1.10785   .0650913     1.74   0.081     .9873452    1.243063
             |
     diabcat |
T1DM, con..  |   1.171504   .1629614     1.14   0.255     .8919443    1.538684
T1DM, unc..  |   .5925388   .2430321    -1.28   0.202      .265212    1.323855
T2DM, con..  |   1.088534   .0691602     1.34   0.182     .9610825    1.232887
T2DM, unc..  |    .800765   .1151268    -1.55   0.122     .6041253     1.06141
Diabetes,..  |   .7577178   .7387882    -0.28   0.776     .1120911    5.122052
             |
cancer_exh~t |
  Last year  |   1.335389   .4442027     0.87   0.385     .6957687    2.563013
2-5 years..  |   1.016437   .1802756     0.09   0.927     .7179781    1.438964
   5+ years  |   .9852899   .0639914    -0.23   0.820     .8675234    1.119043
             |
cancer_hae~t |
  Last year  |   1.111015   .3913731     0.30   0.765     .5570193    2.215999
2-5 years..  |   1.092035   .1981392     0.49   0.628     .7652338      1.5584
   5+ years  |   .9596798   .0594765    -0.66   0.507     .8499097    1.083627
             |
1.~r_disease |   .9569437   .0587159    -0.72   0.473     .8485131     1.07923
1.stroke_d~a |   .9106229   .0554606    -1.54   0.124     .8081593    1.026077
1.other_ne~o |    1.06664   .0620628     1.11   0.268     .9516785    1.195488
             |
reduced_ki~t |
Stage 3a/..  |   .8963843   .1246085    -0.79   0.431     .6826007    1.177123
      1.esrd |   .9862739   .0472602    -0.29   0.773     .8978623    1.083391
1.other_tr~t |    1.02256   .0620893     0.37   0.713     .9078299     1.15179
  1.asplenia |   .9154159    .056979    -1.42   0.156     .8102824     1.03419
1.ra_sle_p~s |   1.068658   .0626923     1.13   0.258     .9525842    1.198875
1.other_im~o |   1.002633   .0600876     0.04   0.965     .8915171    1.127598
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   3.79e-10          .        .       .            .           .
          1 #|
 only 12-18  |   1.559044          .        .       .            .           .
    1#mixed  |   4.31e-10   2.71e-10   -34.27   0.000     1.26e-10    1.48e-09
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  1) = 1174.28
         Prob > chi2 =    0.0000

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2819209   .1801605    -1.98   0.048     .0805694    .9864709
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.115612   .7488209     0.16   0.871     .2993435    4.157732
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3864572   .1888799    -1.95   0.052     .1482787    1.007219
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_tim
> eperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_timeperiod
> 2.ster saved
(no new episodes generated)
(cat_time: 85187 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.88       23.88
          1 |     25,850       20.43       44.31
          2 |     22,519       17.80       62.11
          3 |     19,548       15.45       77.56
          4 |     17,270       13.65       91.21
        400 |     11,124        8.79      100.00
------------+-----------------------------------
      Total |    126,528      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    13,611      3,659 |    17,270 
       400 |    10,313        811 |    11,124 
-----------+----------------------+----------
     Total |   114,212     12,316 |   126,528 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    58,497      6,300 |    64,797 
         1 |    55,719      6,016 |    61,735 
-----------+----------------------+----------
     Total |   114,216     12,316 |   126,532 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -10330.889
Iteration 1:   log pseudolikelihood = -10311.001
Iteration 2:   log pseudolikelihood = -10310.656
Iteration 3:   log pseudolikelihood =  -10310.65
Iteration 4:   log pseudolikelihood =  -10310.65
Iteration 5:   log pseudolikelihood =  -10310.65
Refining estimates:
Iteration 0:   log pseudolikelihood =  -10310.65

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       19,548             Number of obs    =      19,548
No. of failures      =        1,374
Time at risk         =       885122
                                                Wald chi2(45)    =       43.03
Log pseudolikelihood =    -10310.65             Prob > chi2      =      0.5559

                       (Std. Err. adjusted for 1,146 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.553905   1.382311     0.50   0.620     .2717811    8.884438
 only 12-18  |   1.171638   1.406261     0.13   0.895     .1114647    12.31544
      mixed  |   1.838042   1.495229     0.75   0.454      .373174    9.053144
             |
        age1 |   1.000053   .0245598     0.00   0.998     .9530568    1.049367
        age2 |   1.073348    .137236     0.55   0.580     .8354255    1.379029
        age3 |   .8337575   .2099794    -0.72   0.470     .5089406    1.365879
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .5340251   .6851925    -0.49   0.625     .0431926     6.60259
             |
   ethnicity |
Asian or ..  |   .9720374   .0909587    -0.30   0.762     .8091545    1.167709
      Other  |   .8678396   .0828369    -1.49   0.138     .7197649    1.046377
             |
   obese4cat |
Obese I ..)  |   1.006666    .076588     0.09   0.930     .8672117    1.168545
Obese II..)  |   .7924197   .0827356    -2.23   0.026     .6457767    .9723625
Obese II..)  |   .8882051   .1044862    -1.01   0.314       .70531    1.118527
             |
smoke_nomiss |
     Former  |   1.289624   .2291147     1.43   0.152     .9104129    1.826785
    Current  |   1.069839   .0879143     0.82   0.411     .9106903      1.2568
             |
         imd |
          4  |   1.004144   .0665255     0.06   0.950      .881867    1.143376
5 most de..  |   .8879176   .0837555    -1.26   0.208      .738041     1.06823
             |
tot_adults~h |
          2  |    .993817   .8444572    -0.01   0.994     .1879452    5.255108
          3  |   .2997621   .2632969    -1.37   0.170     .0535946     1.67661
             |
1.htdiag_o~p |   .9535727   .0527881    -0.86   0.390     .8555252    1.062857
1.~y_disease |   .9430898   .0665256    -0.83   0.406      .821314    1.082921
    1.asthma |   1.134334   .1070775     1.34   0.182     .9427358    1.364871
1.~c_disease |   .9545266   .0617045    -0.72   0.472     .8409359    1.083461
             |
     diabcat |
T1DM, con..  |   .8530393   .1653848    -0.82   0.412     .5833653    1.247376
T1DM, unc..  |   .8257408   .3156599    -0.50   0.616      .390347    1.746774
T2DM, con..  |   .8853959   .0679348    -1.59   0.113     .7617745    1.029079
T2DM, unc..  |   .9562033   .1451087    -0.30   0.768     .7101924    1.287432
Diabetes,..  |   .7931855   .7960525    -0.23   0.817     .1109421    5.670913
             |
cancer_exh~t |
  Last year  |    .548107   .3177313    -1.04   0.300      .175968     1.70725
2-5 years..  |   .8863018   .1978762    -0.54   0.589     .5721923    1.372844
   5+ years  |   1.024707    .069669     0.36   0.720     .8968649    1.170771
             |
cancer_hae~t |
  Last year  |   1.434636   .5212928     0.99   0.321     .7037965    2.924397
2-5 years..  |   .8106468   .1978071    -0.86   0.390     .5024915     1.30778
   5+ years  |   .9963553   .0676749    -0.05   0.957     .8721647     1.13823
             |
1.~r_disease |   .9210712   .0623896    -1.21   0.225     .8065592    1.051841
1.stroke_d~a |   .9756833   .0652345    -0.37   0.713     .8558493    1.112296
1.other_ne~o |   .9747071   .0665991    -0.37   0.708     .8525382    1.114383
             |
reduced_ki~t |
Stage 3a/..  |   .9795768   .1480324    -0.14   0.891     .7284606    1.317258
      1.esrd |    .998052   .0579431    -0.03   0.973     .8907087    1.118332
1.other_tr~t |   .9737828   .0671876    -0.39   0.700     .8506134    1.114787
  1.asplenia |   .9809381   .0671396    -0.28   0.779     .8577914    1.121764
1.ra_sle_p~s |   1.022908   .0706138     0.33   0.743     .8934619    1.171108
1.other_im~o |   .9647007   .0681087    -0.51   0.611     .8400344    1.107868
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   2.348283   3.300845     0.61   0.544      .149371    36.91772
          1 #|
 only 12-18  |    3.58841   7.182792     0.64   0.523     .0709712    181.4354
    1#mixed  |   2.174441   2.793243     0.60   0.545     .1753522    26.96397
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    0.48
         Prob > chi2 =    0.9226

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.649011   4.723515     1.00   0.317     .2886189    46.13446
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   4.204318    6.95174     0.87   0.385     .1645334    107.4328
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.996713    5.14216     1.08   0.282     .3210327    49.75727
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_tim
> eperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_timeperiod
> 3.ster saved
(no new episodes generated)
(cat_time: 85187 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.88       23.88
          1 |     25,850       20.43       44.31
          2 |     22,519       17.80       62.11
          3 |     19,548       15.45       77.56
          4 |     17,270       13.65       91.21
        400 |     11,124        8.79      100.00
------------+-----------------------------------
      Total |    126,528      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    13,611      3,659 |    17,270 
       400 |    10,313        811 |    11,124 
-----------+----------------------+----------
     Total |   114,212     12,316 |   126,528 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    58,497      6,300 |    64,797 
         1 |    55,719      6,016 |    61,735 
-----------+----------------------+----------
     Total |   114,216     12,316 |   126,532 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -26544.073
Iteration 1:   log pseudolikelihood = -26523.424
Iteration 2:   log pseudolikelihood = -26523.075
Iteration 3:   log pseudolikelihood = -26523.064
Iteration 4:   log pseudolikelihood = -26523.064
Refining estimates:
Iteration 0:   log pseudolikelihood = -26523.064

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       17,270             Number of obs    =      17,270
No. of failures      =        3,659
Time at risk         =      1850905
                                                Wald chi2(45)    =       43.86
Log pseudolikelihood =   -26523.064             Prob > chi2      =      0.5203

                       (Std. Err. adjusted for 1,125 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .6839592   .3376746    -0.77   0.442     .2598885    1.800003
 only 12-18  |   .3544763   .2475612    -1.49   0.138     .0901821    1.393331
      mixed  |   .7100484   .2968442    -0.82   0.413     .3129198    1.611176
             |
        age1 |   .9737161   .0144914    -1.79   0.074     .9457238    1.002537
        age2 |   1.112825   .0865249     1.37   0.169     .9555291    1.296015
        age3 |   .8273825   .1273435    -1.23   0.218     .6119231    1.118706
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.057566   .6898576     0.09   0.932     .2944848    3.797975
             |
   ethnicity |
Asian or ..  |   1.032254   .0582712     0.56   0.574     .9241363    1.153021
      Other  |   .9962923     .05415    -0.07   0.946     .8956177    1.108283
             |
   obese4cat |
Obese I ..)  |      1.002   .0496907     0.04   0.968     .9091916    1.104282
Obese II..)  |   1.039016   .0641717     0.62   0.535     .9205561    1.172719
Obese II..)  |   .9424393   .0698736    -0.80   0.424      .814975    1.089839
             |
smoke_nomiss |
     Former  |    .980085   .1169127    -0.17   0.866     .7757563    1.238232
    Current  |   .8796372   .0437911    -2.58   0.010     .7978626    .9697931
             |
         imd |
          4  |   1.005448   .0407754     0.13   0.893     .9286236    1.088629
5 most de..  |   .9438569   .0536551    -1.02   0.309     .8443417    1.055101
             |
tot_adults~h |
          2  |   2.989894    3.61599     0.91   0.365     .2793889    31.99649
          3  |   4.690706   4.916996     1.47   0.140     .6011361     36.6019
             |
1.htdiag_o~p |   1.003032   .0339116     0.09   0.929     .9387208    1.071749
1.~y_disease |   1.024258   .0413591     0.59   0.553     .9463203    1.108614
    1.asthma |   1.054129   .0634245     0.88   0.381     .9368696    1.186066
1.~c_disease |    1.08661   .0423654     2.13   0.033     1.006669    1.172899
             |
     diabcat |
T1DM, con..  |   1.000922   .1061227     0.01   0.993     .8131139    1.232108
T1DM, unc..  |   .9569915   .2039235    -0.21   0.837     .6302707    1.453078
T2DM, con..  |   1.007928   .0456105     0.17   0.861     .9223828    1.101407
T2DM, unc..  |   .9090799   .0820319    -1.06   0.291     .7617158    1.084954
Diabetes,..  |   1.018071   .5793735     0.03   0.975      .333709    3.105903
             |
cancer_exh~t |
  Last year  |   .8912591   .2544391    -0.40   0.687     .5093316    1.559579
2-5 years..  |   1.182559   .1444566     1.37   0.170     .9307722    1.502457
   5+ years  |   .9751787   .0425293    -0.58   0.564      .895286    1.062201
             |
cancer_hae~t |
  Last year  |   1.233386   .3188976     0.81   0.417      .743048    2.047298
2-5 years..  |   1.091531   .1372946     0.70   0.486     .8530423    1.396695
   5+ years  |   .9565198   .0426095    -1.00   0.318     .8765486    1.043787
             |
1.~r_disease |   1.021159   .0427383     0.50   0.617     .9407366    1.108456
1.stroke_d~a |    .916637   .0388932    -2.05   0.040     .8434914    .9961256
1.other_ne~o |   .9780677    .040123    -0.54   0.589     .9025064    1.059955
             |
reduced_ki~t |
Stage 3a/..  |    1.11524   .0915894     1.33   0.184     .9494305    1.310007
      1.esrd |   .9747443   .0331722    -0.75   0.452     .9118489    1.041978
1.other_tr~t |   1.031554    .042607     0.75   0.452     .9513362    1.118535
  1.asplenia |   1.025479   .0435391     0.59   0.553     .9435979    1.114465
1.ra_sle_p~s |   1.035797   .0414957     0.88   0.380     .9575782    1.120405
1.other_im~o |    .993165   .0416742    -0.16   0.870     .9147536    1.078298
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .7610478   .6036666    -0.34   0.731     .1607811    3.602374
          1 #|
 only 12-18  |   .6993031   .9379058    -0.27   0.790       .05047    9.689413
    1#mixed  |   .9147308   .5973577    -0.14   0.891     .2543448    3.289756
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    0.24
         Prob > chi2 =    0.9703

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5205257   .3525769    -0.96   0.335     .1380012    1.963367
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2478864   .2782353    -1.24   0.214     .0274687    2.237008
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6495031   .3816237    -0.73   0.463     .2053275    2.054543
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_tim
> eperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_timeperiod
> 4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_sex_covid_death.log
  log type:  text
 closed on:  15 Mar 2023, 14:17:08
-------------------------------------------------------------------------------
