-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covidadmissio
> n_stratified.log
  log type:  text
 opened on:  15 Mar 2023, 14:26:54

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. replace covid_vacc_second_dose_date=. if covid_vacc_date>=covid_vacc_second_d
> ose_date
  4. replace covid_vacc_second_dose_date=. if covid_vacc_date==. 
  5. drop if covid_vacc_date<d(20dec2020)
  6. drop if covid_vacc_second_dose_date<d(20dec2020)
  7. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
  8. replace `outcome'=0 if stime_`outcome'<date_`outcome'
  9. *Drop those without any eligible follow-up
. drop if enter_date>=stime_`outcome'
 10. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 11. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 12. format first_vacc_plus_7d second_vacc_plus_7d %td
 13. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 14. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 15. 
. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 16. 
. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 17. recode `outcome' .=0 
 18. stsplit split2, after(second_vacc_plus_7d) at(0)
 19. recode `outcome' .=0 
 20. 
. stset
 21. bysort patient_id (_t): gen vaccine=_n
 22. strate vaccine if kids_cat4==0, per(100000)
 23. strate vaccine if kids_cat4==1, per(100000)
 24. 
. 
. 
. 
. foreach int_type in  vaccine  {
 25. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 26. 
. 
. *Unadjusted  model (interaction)
. stcox   i.`exposure_type'       ///
>                         i.`int_type'##i.`exposure_type' ///
>                         , strata(stp) vce(cluster household_id) 
 27. 
. if _rc==0 {
 28. *testparm 1.`int_type'#i.`exposure_type'
. di _n "kids_cat4=0 " _n "****************"
 29. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 30. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 31. lincom 0.`exposure_type' + 3.`int_type'#0.`exposure_type', eform
 32. 
. di _n "kids_cat4=1 " _n "****************"
 33. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 34. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 35. lincom 1.`exposure_type' + 3.`int_type'#1.`exposure_type', eform
 36. 
. di _n "kids_cat4=2 " _n "****************"
 37. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 38. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 39. lincom 2.`exposure_type' + 3.`int_type'#2.`exposure_type', eform
 40. 
. di _n "kids_cat4=3 " _n "****************"
 41. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 42. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 43. lincom 3.`exposure_type' + 3.`int_type'#3.`exposure_type', eform
 44. }
 45. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"             
>       
 46. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         i.`int_type'##i.`exposure_type' ///
>                         , strata(stp) vce(cluster household_id) 
 47. if _rc==0{
 48. *testparm 1.`int_type'#i.`exposure_type'
. di _n "`exposure_type' " _n "****************"
 49. 
. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 50. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 51. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 52. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 53. 
. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 54. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 55. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 56. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 57. 
. lincom 0.`exposure_type' + 3.`int_type'#0.`exposure_type', eform
 58. lincom 1.`exposure_type' + 3.`int_type'#1.`exposure_type', eform
 59. lincom 2.`exposure_type' + 3.`int_type'#2.`exposure_type', eform
 60. lincom 3.`exposure_type' + 3.`int_type'#3.`exposure_type', eform
 61. 
. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`
> int_type'_`x'_stratified, replace
 62. }
 63. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 64. }
 65. }
 66. }
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(59,374 real changes made)
(14,056 real changes made)
(130 observations deleted)
(5,299 missing values generated)
(16,586 missing values generated)
(31,302 real changes made, 31,302 to missing)
(82,130 real changes made, 82,130 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,603  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,603  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(64,512 observations (episodes) created)
(covidadmission: 64512 changes made)
(2,703 observations (episodes) created)
(covidadmission: 2703 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    168,818  total observations
          0  exclusions
------------------------------------------------------------------------------
    168,818  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(706 records included in the analysis)

  +----------------------------------------------------+
  | vaccine    D        Y      Rate    Lower     Upper |
  |----------------------------------------------------|
  |       1   36   0.2942   122.370   88.269   169.645 |
  |       2   37   0.2971   124.541   90.235   171.890 |
  |       3   24   0.1799   133.430   89.434   199.069 |
  +----------------------------------------------------+


         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(1853 records included in the analysis)

  +-----------------------------------------------------+
  | vaccine    D        Y      Rate     Lower     Upper |
  |-----------------------------------------------------|
  |       1   91   0.8190   111.112    90.476   136.456 |
  |       2   90   0.7248   124.177   100.999   152.675 |
  |       3   71   0.4776   148.672   117.818   187.607 |
  +-----------------------------------------------------+


         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -144271.82
Iteration 1:   log pseudolikelihood = -144265.03
Iteration 2:   log pseudolikelihood = -144264.53
Iteration 3:   log pseudolikelihood = -144264.39
Iteration 4:   log pseudolikelihood = -144264.33
Iteration 5:   log pseudolikelihood = -144264.32
Iteration 6:   log pseudolikelihood = -144264.31
Iteration 7:   log pseudolikelihood = -144264.31
Iteration 8:   log pseudolikelihood = -144264.31
Iteration 9:   log pseudolikelihood =  -144264.3
Iteration 10:  log pseudolikelihood =  -144264.3
Iteration 11:  log pseudolikelihood =  -144264.3
Iteration 12:  log pseudolikelihood =  -144264.3
Iteration 13:  log pseudolikelihood =  -144264.3
Iteration 14:  log pseudolikelihood =  -144264.3
Iteration 15:  log pseudolikelihood =  -144264.3
Iteration 16:  log pseudolikelihood =  -144264.3
Iteration 17:  log pseudolikelihood =  -144264.3
Iteration 18:  log pseudolikelihood =  -144264.3
Iteration 19:  log pseudolikelihood =  -144264.3
Iteration 20:  log pseudolikelihood =  -144264.3
Iteration 21:  log pseudolikelihood =  -144264.3
Iteration 22:  log pseudolikelihood =  -144264.3
Iteration 23:  log pseudolikelihood =  -144264.3
Iteration 24:  log pseudolikelihood =  -144264.3
Iteration 25:  log pseudolikelihood =  -144264.3
Iteration 26:  log pseudolikelihood =  -144264.3
Iteration 27:  log pseudolikelihood =  -144264.3
Iteration 28:  log pseudolikelihood =  -144264.3
Iteration 29:  log pseudolikelihood =  -144264.3
Iteration 30:  log pseudolikelihood =  -144264.3
Iteration 31:  log pseudolikelihood =  -144264.3
Iteration 32:  log pseudolikelihood =  -144264.3
Iteration 33:  log pseudolikelihood =  -144264.3
Iteration 34:  log pseudolikelihood =  -144264.3
Iteration 35:  log pseudolikelihood =  -144264.3
Iteration 36:  log pseudolikelihood =  -144264.3
Iteration 37:  log pseudolikelihood =  -144264.3
Iteration 38:  log pseudolikelihood =  -144264.3
Iteration 39:  log pseudolikelihood =  -144264.3
Iteration 40:  log pseudolikelihood =  -144264.3
Iteration 41:  log pseudolikelihood =  -144264.3
Iteration 42:  log pseudolikelihood =  -144264.3
Iteration 43:  log pseudolikelihood =  -144264.3
Iteration 44:  log pseudolikelihood =  -144264.3
Iteration 45:  log pseudolikelihood =  -144264.3
Refining estimates:
Iteration 0:   log pseudolikelihood =  -144264.3

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      101,603             Number of obs    =     168,818
No. of failures      =       16,239
Time at risk         =     14107619
                                                Wald chi2(10)    =       12.10
Log pseudolikelihood =    -144264.3             Prob > chi2      =      0.2785

                       (Std. Err. adjusted for 1,369 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9079799   .1719839    -0.51   0.610     .6263931     1.31615
 only 12-18  |   .5683944    .183551    -1.75   0.080     .3018368    1.070354
      mixed  |   .9332376   .1496684    -0.43   0.667     .6815228    1.277921
             |
     vaccine |
          2  |   .9016701    .216391    -0.43   0.666     .5633373    1.443201
          3  |   .7780955   .2416435    -0.81   0.419     .4233366    1.430145
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |    1.11078   .3041729     0.38   0.701     .6494372    1.899847
          2 #|
 only 12-18  |   2.505376   1.028767     2.24   0.025     1.120339     5.60269
    2#mixed  |   1.132663   .2722532     0.52   0.604     .7071331    1.814263
          3 #|
only <12 ..  |   1.271923   .4034999     0.76   0.448     .6830133    2.368605
          3 #|
 only 12-18  |   5.52e-20          .        .       .            .           .
    3#mixed  |   .9368649   .2981567    -0.20   0.838     .5020912     1.74812
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4=0 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

kids_cat4=1 
****************

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9079799   .1719839    -0.51   0.610     .6263931     1.31615
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.008566   .1999454     0.04   0.966      .683842    1.487485
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.154881   .3046215     0.55   0.585      .688679    1.936679
------------------------------------------------------------------------------

kids_cat4=2 
****************

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5683944    .183551    -1.75   0.080     .3018368    1.070354
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.424042   .3802088     1.32   0.186      .843836    2.403186
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.14e-20   1.01e-20  -139.07   0.000     1.67e-20    5.91e-20
------------------------------------------------------------------------------

kids_cat4=3 
****************

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9332376   .1496684    -0.43   0.667     .6815228    1.277921
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.057044   .1881228     0.31   0.755     .7457686    1.498242
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8743176   .2488049    -0.47   0.637     .5005443      1.5272
------------------------------------------------------------------------------

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -144271.82
Iteration 1:   log pseudolikelihood = -144245.01
Iteration 2:   log pseudolikelihood = -144244.37
Iteration 3:   log pseudolikelihood = -144244.23
Iteration 4:   log pseudolikelihood = -144244.18
Iteration 5:   log pseudolikelihood = -144244.16
Iteration 6:   log pseudolikelihood = -144244.16
Iteration 7:   log pseudolikelihood = -144244.15
Iteration 8:   log pseudolikelihood = -144244.15
Iteration 9:   log pseudolikelihood = -144244.15
Iteration 10:  log pseudolikelihood = -144244.15
Iteration 11:  log pseudolikelihood = -144244.15
Iteration 12:  log pseudolikelihood = -144244.15
Iteration 13:  log pseudolikelihood = -144244.15
Iteration 14:  log pseudolikelihood = -144244.15
Iteration 15:  log pseudolikelihood = -144244.15
Iteration 16:  log pseudolikelihood = -144244.15
Iteration 17:  log pseudolikelihood = -144244.15
Iteration 18:  log pseudolikelihood = -144244.15
Iteration 19:  log pseudolikelihood = -144244.15
Iteration 20:  log pseudolikelihood = -144244.15
Iteration 21:  log pseudolikelihood = -144244.15
Iteration 22:  log pseudolikelihood = -144244.15
Iteration 23:  log pseudolikelihood = -144244.15
Iteration 24:  log pseudolikelihood = -144244.15
Iteration 25:  log pseudolikelihood = -144244.15
Iteration 26:  log pseudolikelihood = -144244.15
Iteration 27:  log pseudolikelihood = -144244.15
Iteration 28:  log pseudolikelihood = -144244.15
Iteration 29:  log pseudolikelihood = -144244.15
Iteration 30:  log pseudolikelihood = -144244.15
Iteration 31:  log pseudolikelihood = -144244.15
Iteration 32:  log pseudolikelihood = -144244.15
Iteration 33:  log pseudolikelihood = -144244.15
Iteration 34:  log pseudolikelihood = -144244.15
Iteration 35:  log pseudolikelihood = -144244.15
Refining estimates:
Iteration 0:   log pseudolikelihood = -144244.15
Iteration 1:   log pseudolikelihood = -144244.15

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      101,603             Number of obs    =     168,818
No. of failures      =       16,239
Time at risk         =     14107619
                                                Wald chi2(50)    =    19176.76
Log pseudolikelihood =   -144244.15             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,369 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    .913641   .1818202    -0.45   0.650     .6185591    1.349491
 only 12-18  |   .5746633   .1871305    -1.70   0.089     .3035515    1.087914
      mixed  |   .9367991   .1644096    -0.37   0.710     .6641395    1.321398
             |
        age1 |   .9966153   .0029651    -1.14   0.254     .9908207    1.002444
        age2 |   1.009571   .0094884     1.01   0.311     .9911444     1.02834
        age3 |   .9771111   .0261192    -0.87   0.386     .9272364    1.029668
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.015846   .0164836     0.97   0.333     .9840473    1.048673
             |
   ethnicity |
Asian or ..  |   1.018388   .0265197     0.70   0.484     .9677146    1.071715
      Other  |   1.002592   .0266487     0.10   0.922     .9516985    1.056207
             |
   obese4cat |
Obese I ..)  |   .9792245   .0229378    -0.90   0.370     .9352837     1.02523
Obese II..)  |   .9701985    .028415    -1.03   0.302     .9160743     1.02752
Obese II..)  |   1.025027    .034965     0.72   0.469      .958738      1.0959
             |
smoke_nomiss |
     Former  |   .9399631   .0571289    -1.02   0.308     .8344046    1.058876
    Current  |   1.027894   .0237226     1.19   0.233     .9824347    1.075457
             |
         imd |
          4  |    .977483   .0196333    -1.13   0.257     .9397501    1.016731
5 most de..  |   .9869008   .0259997    -0.50   0.617     .9372356    1.039198
             |
tot_adults~h |
          2  |   .8986327   .2566707    -0.37   0.708     .5134036    1.572916
          3  |   .9297272   .2209691    -0.31   0.759     .5835119    1.481363
             |
1.htdiag_o~p |   .9976902   .0170481    -0.14   0.892     .9648298     1.03167
1.~y_disease |    .977732   .0201958    -1.09   0.276     .9389396    1.018127
    1.asthma |   .9955957   .0286031    -0.15   0.878     .9410838    1.053265
1.~c_disease |   1.010377   .0195026     0.53   0.593     .9728662    1.049333
             |
     diabcat |
T1DM, con..  |   1.046219   .0534901     0.88   0.377     .9464617     1.15649
T1DM, unc..  |   .8802829   .1048459    -1.07   0.284     .6970117    1.111743
T2DM, con..  |   .9435208   .0204963    -2.68   0.007     .9041919    .9845603
T2DM, unc..  |   1.063687   .0438394     1.50   0.134     .9811418    1.153176
Diabetes,..  |   1.547262     .34638     1.95   0.051     .9977199    2.399492
             |
cancer_exh~t |
  Last year  |   .9374278   .1192827    -0.51   0.612     .7305114    1.202953
2-5 years..  |   1.035064   .0658606     0.54   0.588     .9137047    1.172543
   5+ years  |   .9679554   .0197767    -1.59   0.111     .9299597    1.007503
             |
cancer_hae~t |
  Last year  |   1.099931   .1322401     0.79   0.428     .8690184      1.3922
2-5 years..  |   1.001347   .0652151     0.02   0.984     .8813491    1.137683
   5+ years  |   1.014753   .0211183     0.70   0.482     .9741942    1.056999
             |
1.~r_disease |   1.009234   .0192911     0.48   0.631     .9721238    1.047761
1.stroke_d~a |   .9996299   .0193409    -0.02   0.985     .9624321    1.038265
1.other_ne~o |   1.032091    .019989     1.63   0.103      .993648    1.072022
             |
reduced_ki~t |
Stage 3a/..  |   .9531738   .1248784    -0.37   0.714     .7373156    1.232227
      1.esrd |   .9863716   .0162987    -0.83   0.406     .9549384     1.01884
1.other_tr~t |   .9928011   .0194966    -0.37   0.713     .9553146    1.031759
  1.asplenia |   .9951994   .0192592    -0.25   0.804     .9581589    1.033672
1.ra_sle_p~s |   1.044036   .0211941     2.12   0.034     1.003312    1.086413
1.other_im~o |   1.009113   .0182239     0.50   0.615     .9740193    1.045471
             |
     vaccine |
          2  |   .9046371   .2182706    -0.42   0.678     .5637631    1.451617
          3  |   .7868506   .2446232    -0.77   0.441     .4278219    1.447176
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |   1.107286   .3044166     0.37   0.711     .6460204      1.8979
          2 #|
 only 12-18  |   2.484996   1.015323     2.23   0.026     1.115682    5.534915
    2#mixed  |   1.128853   .2727928     0.50   0.616     .7029758    1.812735
          3 #|
only <12 ..  |    1.25871   .3998402     0.72   0.469     .6753585    2.345942
          3 #|
 only 12-18  |   4.46e-16   2.21e-16   -71.37   0.000     1.69e-16    1.18e-15
    3#mixed  |   .9231861   .2947997    -0.25   0.802      .493715    1.726244
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .913641   .1818202    -0.45   0.650     .6185591    1.349491
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5746633   .1871305    -1.70   0.089     .3035515    1.087914
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9367991   .1644096    -0.37   0.710     .6641395    1.321398
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.011662   .2055479     0.06   0.954     .6793437    1.506542
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.428036   .3851296     1.32   0.186     .8417381    2.422709
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.057508   .1957312     0.30   0.763      .735762    1.519953
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.150009   .3143806     0.51   0.609     .6729869    1.965152
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.56e-16   9.44e-17   -97.46   0.000     1.24e-16    5.28e-16
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8648399   .2574335    -0.49   0.626     .4825718    1.549921
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_vaccine
> _0_stratified.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_vaccine_0_stra
> tified.ster saved
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(16,942 real changes made)
(4,051 real changes made)
(26 observations deleted)
(1,543 missing values generated)
(4,758 missing values generated)
(8,723 real changes made, 8,723 to missing)
(23,176 real changes made, 23,176 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,715  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,715  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(18,303 observations (episodes) created)
(covidadmission: 18303 changes made)
(732 observations (episodes) created)
(covidadmission: 732 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     47,750  total observations
          0  exclusions
------------------------------------------------------------------------------
     47,750  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(175 records included in the analysis)

  +----------------------------------------------------+
  | vaccine    D        Y      Rate    Lower     Upper |
  |----------------------------------------------------|
  |       1    8   0.0833    96.085   48.052   192.132 |
  |       2   11   0.0690   159.328   88.236   287.699 |
  |       3    7   0.0395   177.395   84.570   372.104 |
  +----------------------------------------------------+


         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(519 records included in the analysis)

  +-----------------------------------------------------+
  | vaccine    D        Y      Rate     Lower     Upper |
  |-----------------------------------------------------|
  |       1   34   0.2294   148.206   105.898   207.418 |
  |       2   26   0.1935   134.346    91.473   197.315 |
  |       3   19   0.1257   151.093    96.375   236.878 |
  +-----------------------------------------------------+


         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -33425.956
Iteration 1:   log pseudolikelihood = -33422.942
Iteration 2:   log pseudolikelihood = -33422.776
Iteration 3:   log pseudolikelihood = -33422.744
Iteration 4:   log pseudolikelihood = -33422.732
Iteration 5:   log pseudolikelihood = -33422.728
Iteration 6:   log pseudolikelihood = -33422.726
Iteration 7:   log pseudolikelihood = -33422.725
Iteration 8:   log pseudolikelihood = -33422.725
Iteration 9:   log pseudolikelihood = -33422.725
Iteration 10:  log pseudolikelihood = -33422.725
Iteration 11:  log pseudolikelihood = -33422.725
Iteration 12:  log pseudolikelihood = -33422.725
Iteration 13:  log pseudolikelihood = -33422.725
Iteration 14:  log pseudolikelihood = -33422.725
Iteration 15:  log pseudolikelihood = -33422.725
Iteration 16:  log pseudolikelihood = -33422.725
Iteration 17:  log pseudolikelihood = -33422.725
Iteration 18:  log pseudolikelihood = -33422.725
Iteration 19:  log pseudolikelihood = -33422.725
Iteration 20:  log pseudolikelihood = -33422.725
Iteration 21:  log pseudolikelihood = -33422.725
Iteration 22:  log pseudolikelihood = -33422.725
Iteration 23:  log pseudolikelihood = -33422.725
Iteration 24:  log pseudolikelihood = -33422.725
Iteration 25:  log pseudolikelihood = -33422.725
Iteration 26:  log pseudolikelihood = -33422.725
Iteration 27:  log pseudolikelihood = -33422.725
Iteration 28:  log pseudolikelihood = -33422.725
Iteration 29:  log pseudolikelihood = -33422.725
Iteration 30:  log pseudolikelihood = -33422.725
Iteration 31:  log pseudolikelihood = -33422.725
Iteration 32:  log pseudolikelihood = -33422.725
Iteration 33:  log pseudolikelihood = -33422.725
Iteration 34:  log pseudolikelihood = -33422.725
Iteration 35:  log pseudolikelihood = -33422.725
Iteration 36:  log pseudolikelihood = -33422.725
Iteration 37:  log pseudolikelihood = -33422.725
Iteration 38:  log pseudolikelihood = -33422.725
Iteration 39:  log pseudolikelihood = -33422.725
Iteration 40:  log pseudolikelihood = -33422.725
Iteration 41:  log pseudolikelihood = -33422.725
Iteration 42:  log pseudolikelihood = -33422.725
Iteration 43:  log pseudolikelihood = -33422.725
Refining estimates:
Iteration 0:   log pseudolikelihood = -33422.725

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       28,715             Number of obs    =      47,750
No. of failures      =        4,385
Time at risk         =      4002621
                                                Wald chi2(10)    =        6.10
Log pseudolikelihood =   -33422.725             Prob > chi2      =      0.8065

                       (Std. Err. adjusted for 1,198 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.66598   .6064696     1.40   0.161     .8162169    3.400433
 only 12-18  |   .9253566   .4378673    -0.16   0.870     .3660422    2.339307
      mixed  |   1.188579   .3829457     0.54   0.592     .6320936    2.234986
             |
     vaccine |
          2  |   1.644998   .7953777     1.03   0.303     .6376738    4.243579
          3  |   1.524249   .8035795     0.80   0.424     .5423814     4.28358
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |   .4788812   .2621394    -1.35   0.179     .1637873    1.400152
          2 #|
 only 12-18  |   1.004652   .8143188     0.01   0.995     .2051521    4.919891
    2#mixed  |   .6114635   .2957508    -1.02   0.309     .2369539    1.577892
          3 #|
only <12 ..  |   .4962883   .2727725    -1.27   0.202     .1690021     1.45739
          3 #|
 only 12-18  |   1.83e-19          .        .       .            .           .
    3#mixed  |   .7990818   .4036181    -0.44   0.657     .2969254    2.150478
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4=0 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

kids_cat4=1 
****************

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.66598   .6064696     1.40   0.161     .8162169    3.400433
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7978066   .3262035    -0.55   0.581     .3579829    1.778005
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8268065   .3350762    -0.47   0.639     .3736296    1.829644
------------------------------------------------------------------------------

kids_cat4=2 
****************

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9253566   .4378673    -0.16   0.870     .3660422    2.339307
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9296614   .6169583    -0.11   0.912     .2531835    3.413612
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.70e-19   8.03e-20   -91.34   0.000     6.71e-20    4.29e-19
------------------------------------------------------------------------------

kids_cat4=3 
****************

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.188579   .3829457     0.54   0.592     .6320936    2.234986
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7267728   .2644954    -0.88   0.381     .3561392    1.483124
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .949772   .3652852    -0.13   0.893     .4469353    2.018339
------------------------------------------------------------------------------

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -33425.956
Iteration 1:   log pseudolikelihood =  -33406.05
Iteration 2:   log pseudolikelihood = -33405.824
Iteration 3:   log pseudolikelihood = -33405.791
Iteration 4:   log pseudolikelihood =  -33405.78
Iteration 5:   log pseudolikelihood = -33405.776
Iteration 6:   log pseudolikelihood = -33405.774
Iteration 7:   log pseudolikelihood = -33405.773
Iteration 8:   log pseudolikelihood = -33405.773
Iteration 9:   log pseudolikelihood = -33405.773
Iteration 10:  log pseudolikelihood = -33405.773
Iteration 11:  log pseudolikelihood = -33405.773
Iteration 12:  log pseudolikelihood = -33405.773
Iteration 13:  log pseudolikelihood = -33405.773
Iteration 14:  log pseudolikelihood = -33405.773
Iteration 15:  log pseudolikelihood = -33405.773
Iteration 16:  log pseudolikelihood = -33405.773
Iteration 17:  log pseudolikelihood = -33405.773
Iteration 18:  log pseudolikelihood = -33405.773
Iteration 19:  log pseudolikelihood = -33405.773
Iteration 20:  log pseudolikelihood = -33405.773
Iteration 21:  log pseudolikelihood = -33405.773
Iteration 22:  log pseudolikelihood = -33405.773
Iteration 23:  log pseudolikelihood = -33405.773
Iteration 24:  log pseudolikelihood = -33405.773
Iteration 25:  log pseudolikelihood = -33405.773
Iteration 26:  log pseudolikelihood = -33405.773
Iteration 27:  log pseudolikelihood = -33405.773
Refining estimates:
Iteration 0:   log pseudolikelihood = -33405.773
Iteration 1:   log pseudolikelihood = -33405.773
Iteration 2:   log pseudolikelihood = -33405.773

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       28,715             Number of obs    =      47,750
No. of failures      =        4,385
Time at risk         =      4002621
                                                Wald chi2(50)    =     2946.93
Log pseudolikelihood =   -33405.773             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,198 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.577454   .6164883     1.17   0.243     .7333256    3.393257
 only 12-18  |   .8798782   .4341589    -0.26   0.795     .3345135    2.314363
      mixed  |   1.119514   .3915654     0.32   0.747     .5640406    2.222025
             |
        age1 |   1.026922   .0137297     1.99   0.047     1.000362    1.054188
        age2 |   .8630435   .0605421    -2.10   0.036     .7521791    .9902483
        age3 |   1.339298   .1854998     2.11   0.035     1.020896    1.757006
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.058379   .0332918     1.80   0.071     .9950989    1.125683
             |
   ethnicity |
Asian or ..  |   1.047095   .0522479     0.92   0.356     .9495396    1.154674
      Other  |   .9463685    .049787    -1.05   0.295       .85365    1.049158
             |
   obese4cat |
Obese I ..)  |   1.045597   .0446087     1.05   0.296     .9617211    1.136788
Obese II..)  |   1.016842   .0551426     0.31   0.758     .9143095    1.130872
Obese II..)  |   1.001314   .0672007     0.02   0.984     .8778978     1.14208
             |
smoke_nomiss |
     Former  |   1.017096   .1126177     0.15   0.878     .8186776    1.263604
    Current  |   .9545943   .0449089    -0.99   0.323     .8705105      1.0468
             |
         imd |
          4  |   .9449737   .0372722    -1.43   0.151     .8746739    1.020924
5 most de..  |   .9750354   .0472181    -0.52   0.602     .8867459    1.072116
             |
tot_adults~h |
          2  |   1.358368    .808279     0.51   0.607     .4231764    4.360273
          3  |    1.24589   .5267363     0.52   0.603     .5440135    2.853317
             |
1.htdiag_o~p |   1.052637   .0328736     1.64   0.100      .990138    1.119081
1.~y_disease |   1.014948   .0374817     0.40   0.688     .9440809    1.091135
    1.asthma |     .93366   .0571314    -1.12   0.262     .8281386    1.052627
1.~c_disease |   .9835733   .0369715    -0.44   0.659     .9137155    1.058772
             |
     diabcat |
T1DM, con..  |   .9998341    .095225    -0.00   0.999      .829581    1.205028
T1DM, unc..  |   .9762543   .1937092    -0.12   0.904     .6617086     1.44032
T2DM, con..  |   .9914305    .040847    -0.21   0.835     .9145189     1.07481
T2DM, unc..  |   1.018987   .0832416     0.23   0.818      .868228    1.195925
Diabetes,..  |   .4962755   .3642662    -0.95   0.340     .1177445    2.091726
             |
cancer_exh~t |
  Last year  |   .9115437   .2293562    -0.37   0.713     .5566781    1.492625
2-5 years..  |    .875843   .1116935    -1.04   0.299     .6821427    1.124546
   5+ years  |   .9644028    .038129    -0.92   0.359     .8924934    1.042106
             |
cancer_hae~t |
  Last year  |   .7061818   .2033916    -1.21   0.227     .4015659     1.24187
2-5 years..  |    1.15251   .1419149     1.15   0.249     .9053812    1.467093
   5+ years  |   1.053843    .039963     1.38   0.167     .9783566    1.135153
             |
1.~r_disease |   1.080096   .0425311     1.96   0.050     .9998725    1.166757
1.stroke_d~a |   1.011413   .0382119     0.30   0.764     .9392244    1.089149
1.other_ne~o |   .9586857   .0356648    -1.13   0.257     .8912717    1.031199
             |
reduced_ki~t |
Stage 3a/..  |   .9570203   .0788443    -0.53   0.594     .8143194    1.124728
      1.esrd |    .979343   .0312192    -0.65   0.513     .9200267    1.042484
1.other_tr~t |     .97787   .0385758    -0.57   0.571     .9051118    1.056477
  1.asplenia |   .9900861   .0366959    -0.27   0.788     .9207137    1.064686
1.ra_sle_p~s |    1.00961     .03717     0.26   0.795     .9393243    1.085154
1.other_im~o |   1.001393   .0383968     0.04   0.971     .9288954     1.07955
             |
     vaccine |
          2  |   1.635582   .7984505     1.01   0.314     .6282566    4.258021
          3  |   1.526036   .8336163     0.77   0.439     .5231009    4.451889
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |   .4825641   .2649835    -1.33   0.185     .1644928    1.415674
          2 #|
 only 12-18  |   .9925633   .8069184    -0.01   0.993      .201726    4.883763
    2#mixed  |   .6153525   .3004969    -0.99   0.320     .2362949    1.602484
          3 #|
only <12 ..  |   .4800802   .2684767    -1.31   0.189     .1604331    1.436593
          3 #|
 only 12-18  |   2.18e-13   1.82e-13   -35.02   0.000     4.27e-14    1.11e-12
    3#mixed  |   .7937182   .4147731    -0.44   0.658     .2850062    2.210439
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.577454   .6164883     1.17   0.243     .7333256    3.393257
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8798782   .4341589    -0.26   0.795     .3345135    2.314363
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.119514   .3915654     0.32   0.747     .5640406    2.222025
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7612228   .3263832    -0.64   0.525     .3285105    1.763902
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8733348   .5909657    -0.20   0.841      .231842      3.2898
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .688896   .2703044    -0.95   0.342      .319275    1.486423
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7573046   .3120154    -0.67   0.500     .3377294    1.698135
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.92e-13   1.44e-13   -39.13   0.000     4.43e-14    8.32e-13
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .888579   .3500499    -0.30   0.764     .4105544    1.923186
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_vaccine
> _1_stratified.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_vaccine_1_stra
> tified.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covidadmissio
> n_stratified.log
  log type:  text
 closed on:  15 Mar 2023, 14:30:43
-------------------------------------------------------------------------------
