-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_shield_covid_death.lo
> g
  log type:  text
 opened on:  15 Mar 2023, 14:17:36

. 
. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 12. stsplit cat_time, at(0,92,161,222,270, 400)
 13. recode cat_time 92=1 161=2 222=3 270=4
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18.  
. foreach int_type in  shield  {
 19. 
. tab shield `outcome'
 20. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 21. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         1.`int_type'#0.`exposure_type' 1.`int_type'#1.`exposu
> re_type' 1.`int_type'#2.`exposure_type' 1.`int_type'#3.`exposure_type' ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id) 
 22. if _rc==0{
 23. *testparm 1.`int_type'#i.`exposure_type'
. di _n "`exposure_type' " _n "****************"
 24. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 25. di "`exposure_type'" _n "****************"
 26. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 27. di "`exposure_type'" _n "****************"
 28. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 29. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_timeperiod`period', replace
 30. }
 31. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 32. }
 33. drop cat_time
 34. }
 35. }
 36. }
(342,392 observations (episodes) created)
(cat_time: 302871 changes made)
(covid_death: 342392 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.85       23.85
          1 |     91,677       20.39       44.24
          2 |     79,998       17.79       62.03
          3 |     69,728       15.51       77.54
          4 |     61,468       13.67       91.21
        400 |     39,521        8.79      100.00
------------+-----------------------------------
      Total |    449,618      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    48,270     13,198 |    61,468 
       400 |    36,753      2,768 |    39,521 
-----------+----------------------+----------
     Total |   406,195     43,423 |   449,618 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,094      6,666 |    68,760 
         1 |   344,107     36,763 |   380,870 
-----------+----------------------+----------
     Total |   406,201     43,429 |   449,630 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -85541.241
Iteration 1:   log pseudolikelihood = -85519.618
Iteration 2:   log pseudolikelihood = -85519.221
Iteration 3:   log pseudolikelihood = -85519.219
Iteration 4:   log pseudolikelihood = -85519.219
Refining estimates:
Iteration 0:   log pseudolikelihood = -85519.219

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =      107,226             Number of obs    =     107,226
No. of failures      =        9,293
Time at risk         =      9163046
                                                Wald chi2(46)    =       50.59
Log pseudolikelihood =   -85519.219             Prob > chi2      =      0.2973

                       (Std. Err. adjusted for 1,373 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .6202561   .2942394    -1.01   0.314     .2447794    1.571691
 only 12-18  |   1.403217   .7872705     0.60   0.546     .4672627    4.213944
      mixed  |   .8164413   .3031006    -0.55   0.585     .3943844    1.690169
             |
        age1 |   .9989321   .0039237    -0.27   0.786     .9912713    1.006652
        age2 |    .998835   .0124862    -0.09   0.926     .9746598     1.02361
        age3 |   1.009244   .0361343     0.26   0.797     .9408495     1.08261
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.017713   .0219031     0.82   0.415     .9756763     1.06156
             |
   ethnicity |
Asian or ..  |   .9702384   .0327366    -0.90   0.371     .9081515     1.03657
      Other  |   1.059789   .0364312     1.69   0.091     .9907373    1.133653
             |
   obese4cat |
Obese I ..)  |    .995368   .0300435    -0.15   0.878     .9381917    1.056029
Obese II..)  |   .9855347    .038119    -0.38   0.706     .9135844    1.063151
Obese II..)  |   1.069735   .0438174     1.65   0.100     .9872109    1.159157
             |
smoke_nomiss |
     Former  |    1.03692   .0743178     0.51   0.613     .9010282    1.193308
    Current  |   .9422363    .029852    -1.88   0.060      .885507      1.0026
             |
         imd |
          4  |   .9957884   .0259129    -0.16   0.871     .9462736    1.047894
5 most de..  |    .980892   .0337014    -0.56   0.574     .9170134     1.04922
             |
tot_adults~h |
          2  |    .578793   .2698955    -1.17   0.241     .2320607    1.443594
          3  |   .5850725   .2050943    -1.53   0.126     .2943236    1.163039
             |
    1.shield |   .6339063   .2636102    -1.10   0.273     .2805773     1.43218
1.htdiag_o~p |   1.003908   .0229398     0.17   0.864      .959939    1.049891
1.~y_disease |   1.046711     .02833     1.69   0.092     .9926323    1.103736
    1.asthma |   1.002712   .0351625     0.08   0.938     .9361096    1.074052
1.~c_disease |   1.027251   .0258351     1.07   0.285     .9778427    1.079156
             |
     diabcat |
T1DM, con..  |   .9981999   .0677172    -0.03   0.979     .8739218    1.140151
T1DM, unc..  |   .8594747   .1312166    -0.99   0.321     .6372055    1.159275
T2DM, con..  |   1.019581   .0285559     0.69   0.489     .9651208    1.077114
T2DM, unc..  |   1.124182   .0578395     2.28   0.023     1.016347    1.243458
Diabetes,..  |   1.635818   .4501029     1.79   0.074     .9539445    2.805092
             |
cancer_exh~t |
  Last year  |   1.319793   .2052916     1.78   0.074     .9729778     1.79023
2-5 years..  |   1.080677   .0894343     0.94   0.348     .9188668    1.270982
   5+ years  |   1.023701   .0297327     0.81   0.420      .967054    1.083667
             |
cancer_hae~t |
  Last year  |    1.05248   .1655958     0.33   0.745     .7731915    1.432652
2-5 years..  |    .992207   .0904069    -0.09   0.932     .8299336    1.186209
   5+ years  |   1.009697   .0289074     0.34   0.736     .9546002    1.067974
             |
1.~r_disease |   1.039081   .0252243     1.58   0.114     .9907999    1.089715
1.stroke_d~a |   .9969918    .026829    -0.11   0.911     .9457705    1.050987
1.other_ne~o |   1.037293   .0268512     1.41   0.157     .9859785    1.091279
             |
reduced_ki~t |
Stage 3a/..  |   .8884392   .1602625    -0.66   0.512     .6238532    1.265241
      1.esrd |   1.005217   .0230103     0.23   0.820     .9611139    1.051343
1.other_tr~t |   .9878787   .0265471    -0.45   0.650     .9371939    1.041305
  1.asplenia |   .9933225   .0267876    -0.25   0.804     .9421831    1.047238
1.ra_sle_p~s |   1.009121   .0245269     0.37   0.709     .9621759    1.058356
1.other_im~o |    1.04045   .0280737     1.47   0.142     .9868564    1.096955
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.793265   .9524556     1.10   0.271     .6332082    5.078583
          1 #|
 only 12-18  |   .8544003   .5412486    -0.25   0.804     .2468534     2.95722
    1#mixed  |   1.465823   .6099127     0.92   0.358     .6484941    3.313272
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.112284   .2830864     0.42   0.676     .6754247    1.831699
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.198909   .3800476     0.57   0.567     .6441102     2.23158
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.196759   .2586184     0.83   0.406     .7835427    1.827891
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_t
> imeperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_timeperi
> od0.ster saved
(no new episodes generated)
(cat_time: 302871 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.85       23.85
          1 |     91,677       20.39       44.24
          2 |     79,998       17.79       62.03
          3 |     69,728       15.51       77.54
          4 |     61,468       13.67       91.21
        400 |     39,521        8.79      100.00
------------+-----------------------------------
      Total |    449,618      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    48,270     13,198 |    61,468 
       400 |    36,753      2,768 |    39,521 
-----------+----------------------+----------
     Total |   406,195     43,423 |   449,618 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,094      6,666 |    68,760 
         1 |   344,107     36,763 |   380,870 
-----------+----------------------+----------
     Total |   406,201     43,429 |   449,630 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -63724.351
Iteration 1:   log pseudolikelihood = -63704.929
Iteration 2:   log pseudolikelihood = -63704.001
Iteration 3:   log pseudolikelihood = -63703.987
Iteration 4:   log pseudolikelihood = -63703.987
Refining estimates:
Iteration 0:   log pseudolikelihood = -63703.987

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       91,677             Number of obs    =      91,677
No. of failures      =        7,035
Time at risk         =      5926371
                                                Wald chi2(46)    =       45.81
Log pseudolikelihood =   -63703.987             Prob > chi2      =      0.4800

                       (Std. Err. adjusted for 1,354 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.329656   .8833661     0.43   0.668     .3616075    4.889235
 only 12-18  |   .8281763    .954309    -0.16   0.870     .0865529    7.924353
      mixed  |   1.102203   .6522527     0.16   0.869     .3455766    3.515432
             |
        age1 |   1.006608   .0045961     1.44   0.149     .9976404    1.015657
        age2 |   .9787673   .0141668    -1.48   0.138     .9513911    1.006931
        age3 |   1.071555   .0439792     1.68   0.092     .9887331    1.161314
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.015355   .0241633     0.64   0.522     .9690838    1.063837
             |
   ethnicity |
Asian or ..  |   .9397115   .0394259    -1.48   0.138     .8655299    1.020251
      Other  |   1.004449   .0396064     0.11   0.910     .9297461    1.085155
             |
   obese4cat |
Obese I ..)  |   .9714132   .0353566    -0.80   0.426     .9045296    1.043242
Obese II..)  |   1.005051   .0435239     0.12   0.907     .9232656    1.094081
Obese II..)  |   1.077239    .053015     1.51   0.131     .9781855    1.186323
             |
smoke_nomiss |
     Former  |   1.113099   .0865348     1.38   0.168     .9557829    1.296307
    Current  |   .9888448   .0351223    -0.32   0.752     .9223478    1.060136
             |
         imd |
          4  |   .9987347   .0294165    -0.04   0.966      .942712    1.058087
5 most de..  |   .9957447   .0392606    -0.11   0.914     .9216935    1.075745
             |
tot_adults~h |
          2  |   1.153228   .8292764     0.20   0.843     .2817236    4.720706
          3  |   1.613598   .9326449     0.83   0.408      .519767    5.009358
             |
    1.shield |   1.048552   .6563058     0.08   0.940     .3074747    3.575781
1.htdiag_o~p |   .9922705   .0248981    -0.31   0.757     .9446517     1.04229
1.~y_disease |   1.019204   .0316369     0.61   0.540     .9590455    1.083136
    1.asthma |   1.030022   .0443038     0.69   0.492     .9467473    1.120621
1.~c_disease |    .962782   .0288354    -1.27   0.205     .9078924     1.02099
             |
     diabcat |
T1DM, con..  |   1.059458    .077157     0.79   0.428     .9185303    1.222008
T1DM, unc..  |   1.084062   .1811812     0.48   0.629     .7812523    1.504239
T2DM, con..  |   .9813363   .0325749    -0.57   0.570     .9195232    1.047305
T2DM, unc..  |   .9950099    .062756    -0.08   0.937      .879309    1.125935
Diabetes,..  |   1.020316   .4186693     0.05   0.961     .4565185    2.280398
             |
cancer_exh~t |
  Last year  |   .9409803   .1813086    -0.32   0.752     .6450161    1.372747
2-5 years..  |   1.070543    .103435     0.71   0.480     .8858533    1.293739
   5+ years  |   1.020396    .033179     0.62   0.535      .957395    1.087542
             |
cancer_hae~t |
  Last year  |   .8978506   .1841284    -0.53   0.599     .6006788    1.342041
2-5 years..  |   .9696502   .0926957    -0.32   0.747     .8039754    1.169466
   5+ years  |    1.00971   .0322823     0.30   0.762     .9483798    1.075007
             |
1.~r_disease |   1.008846   .0293381     0.30   0.762      .952952    1.068018
1.stroke_d~a |   1.036244   .0306794     1.20   0.229     .9778251    1.098154
1.other_ne~o |   1.009921   .0296503     0.34   0.737     .9534476    1.069739
             |
reduced_ki~t |
Stage 3a/..  |   1.116055   .2158366     0.57   0.570     .7639581    1.630428
      1.esrd |   1.008763   .0279954     0.31   0.753     .9553588    1.065153
1.other_tr~t |   .9882567    .032172    -0.36   0.717     .9271703    1.053368
  1.asplenia |   1.021672   .0304399     0.72   0.472     .9637193    1.083109
1.ra_sle_p~s |   .9469506   .0272657    -1.89   0.058     .8949907    1.001927
1.other_im~o |   .9664376   .0301578    -1.09   0.274     .9091006    1.027391
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .7698408   .5491376    -0.37   0.714     .1902075    3.115833
          1 #|
 only 12-18  |   2.599183   3.115973     0.80   0.426     .2479663    27.24464
    1#mixed  |   .9763938   .6113443    -0.04   0.970     .2861981    3.331067
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.023623   .2864247     0.08   0.933     .5915093    1.771408
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.152582    .662483     2.49   0.013     1.177585    3.934841
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.076184   .2590198     0.31   0.760     .6714541    1.724872
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_t
> imeperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_timeperi
> od1.ster saved
(no new episodes generated)
(cat_time: 302871 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.85       23.85
          1 |     91,677       20.39       44.24
          2 |     79,998       17.79       62.03
          3 |     69,728       15.51       77.54
          4 |     61,468       13.67       91.21
        400 |     39,521        8.79      100.00
------------+-----------------------------------
      Total |    449,618      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    48,270     13,198 |    61,468 
       400 |    36,753      2,768 |    39,521 
-----------+----------------------+----------
     Total |   406,195     43,423 |   449,618 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,094      6,666 |    68,760 
         1 |   344,107     36,763 |   380,870 
-----------+----------------------+----------
     Total |   406,201     43,429 |   449,630 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -54447.161
Iteration 1:   log pseudolikelihood = -54423.032
Iteration 2:   log pseudolikelihood = -54422.156
Iteration 3:   log pseudolikelihood = -54422.037
Iteration 4:   log pseudolikelihood = -54421.995
Iteration 5:   log pseudolikelihood =  -54421.98
Iteration 6:   log pseudolikelihood = -54421.974
Iteration 7:   log pseudolikelihood = -54421.972
Iteration 8:   log pseudolikelihood = -54421.971
Iteration 9:   log pseudolikelihood = -54421.971
Iteration 10:  log pseudolikelihood = -54421.971
Iteration 11:  log pseudolikelihood = -54421.971
Iteration 12:  log pseudolikelihood = -54421.971
Iteration 13:  log pseudolikelihood = -54421.971
Iteration 14:  log pseudolikelihood = -54421.971
Iteration 15:  log pseudolikelihood = -54421.971
Iteration 16:  log pseudolikelihood = -54421.971
Iteration 17:  log pseudolikelihood = -54421.971
Iteration 18:  log pseudolikelihood = -54421.971
Iteration 19:  log pseudolikelihood = -54421.971
Refining estimates:
Iteration 0:   log pseudolikelihood = -54421.971

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       79,998             Number of obs    =      79,998
No. of failures      =        6,103
Time at risk         =      4576325
                                                Wald chi2(45)    =     6915.13
Log pseudolikelihood =   -54421.971             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,342 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5252658   .3416575    -0.99   0.322     .1467972    1.879492
 only 12-18  |   2.80e-09   1.13e-09   -48.83   0.000     1.27e-09    6.18e-09
      mixed  |   .4634195   .2570673    -1.39   0.166     .1562418    1.374521
             |
        age1 |   .9995448   .0048349    -0.09   0.925     .9901134    1.009066
        age2 |   .9936949    .015343    -0.41   0.682     .9640737    1.024226
        age3 |   1.025324    .045322     0.57   0.572     .9402336    1.118115
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.005534   .0272551     0.20   0.839      .953509    1.060397
             |
   ethnicity |
Asian or ..  |   1.046912    .044882     1.07   0.285      .962539     1.13868
      Other  |   .9892292   .0427854    -0.25   0.802     .9088274    1.076744
             |
   obese4cat |
Obese I ..)  |   1.038372   .0383326     1.02   0.308     .9658948    1.116287
Obese II..)  |   .9769657   .0466729    -0.49   0.626     .8896406    1.072862
Obese II..)  |   .9364447   .0555841    -1.11   0.269     .8336001    1.051978
             |
smoke_nomiss |
     Former  |   1.209913   .0997744     2.31   0.021     1.029344    1.422158
    Current  |   1.014575   .0398005     0.37   0.712     .9394911     1.09566
             |
         imd |
          4  |   1.024609   .0348444     0.71   0.475     .9585412     1.09523
5 most de..  |   1.089393   .0454674     2.05   0.040     1.003826    1.182254
             |
tot_adults~h |
          2  |   .4742899   .3514947    -1.01   0.314      .110974     2.02706
          3  |   1.061564   .5660928     0.11   0.911     .3732773    3.018981
             |
    1.shield |   .3213055   .2028004    -1.80   0.072     .0932524    1.107074
1.htdiag_o~p |   1.018193   .0277269     0.66   0.508     .9652738    1.074013
1.~y_disease |   .9828693   .0328431    -0.52   0.605     .9205607    1.049395
    1.asthma |   1.103692   .0508921     2.14   0.032      1.00832    1.208085
1.~c_disease |    .975787   .0312893    -0.76   0.445     .9163484    1.039081
             |
     diabcat |
T1DM, con..  |   1.020988   .0870609     0.24   0.808     .8638484    1.206712
T1DM, unc..  |   1.076354   .1833275     0.43   0.666     .7708608    1.502913
T2DM, con..  |   .9739443   .0345782    -0.74   0.457     .9084765     1.04413
T2DM, unc..  |   .9616286   .0687797    -0.55   0.584     .8358452    1.106341
Diabetes,..  |   1.256281   .5245681     0.55   0.585     .5541944    2.847813
             |
cancer_exh~t |
  Last year  |   1.298043   .2388297     1.42   0.156     .9050545    1.861673
2-5 years..  |   1.064136   .1063293     0.62   0.534     .8748714    1.294344
   5+ years  |   1.022226   .0348759     0.64   0.519     .9561059    1.092919
             |
cancer_hae~t |
  Last year  |   1.027201   .2013475     0.14   0.891     .6995305    1.508358
2-5 years..  |    .878952   .0993579    -1.14   0.254     .7042781    1.096948
   5+ years  |   1.032372   .0351512     0.94   0.349     .9657256    1.103618
             |
1.~r_disease |    .985932   .0335723    -0.42   0.677     .9222791    1.053978
1.stroke_d~a |   1.016443   .0323609     0.51   0.608     .9549554     1.08189
1.other_ne~o |   .9615911   .0329049    -1.14   0.252     .8992138    1.028295
             |
reduced_ki~t |
Stage 3a/..  |   .9802763   .2061571    -0.09   0.925     .6491372    1.480337
      1.esrd |   1.047787   .0305494     1.60   0.109     .9895902    1.109407
1.other_tr~t |   1.038002    .034524     1.12   0.262     .9724944    1.107922
  1.asplenia |   1.006729    .032691     0.21   0.836     .9446523    1.072885
1.ra_sle_p~s |    1.00858   .0322516     0.27   0.789     .9473085    1.073815
1.other_im~o |   1.051815   .0334362     1.59   0.112      .988281    1.119433
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   3.758422   2.693489     1.85   0.065     .9225465    15.31168
          1 #|
 only 12-18  |   6.17e+08          .        .       .            .           .
    1#mixed  |   2.922728   1.846387     1.70   0.090     .8473354    10.08141
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.97417   .6619433     2.03   0.043     1.023234    3.808853
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.728316   .6970783     1.36   0.175     .7839887    3.810102
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.354449   .4263867     0.96   0.335     .7308032    2.510295
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_t
> imeperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_timeperi
> od2.ster saved
(no new episodes generated)
(cat_time: 302871 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.85       23.85
          1 |     91,677       20.39       44.24
          2 |     79,998       17.79       62.03
          3 |     69,728       15.51       77.54
          4 |     61,468       13.67       91.21
        400 |     39,521        8.79      100.00
------------+-----------------------------------
      Total |    449,618      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    48,270     13,198 |    61,468 
       400 |    36,753      2,768 |    39,521 
-----------+----------------------+----------
     Total |   406,195     43,423 |   449,618 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,094      6,666 |    68,760 
         1 |   344,107     36,763 |   380,870 
-----------+----------------------+----------
     Total |   406,201     43,429 |   449,630 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -44177.005
Iteration 1:   log pseudolikelihood = -44144.591
Iteration 2:   log pseudolikelihood =   -44144.2
Iteration 3:   log pseudolikelihood = -44144.196
Iteration 4:   log pseudolikelihood = -44144.196
Refining estimates:
Iteration 0:   log pseudolikelihood = -44144.196

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       69,728             Number of obs    =      69,728
No. of failures      =        5,026
Time at risk         =      3153749
                                                Wald chi2(46)    =       74.00
Log pseudolikelihood =   -44144.196             Prob > chi2      =      0.0055

                       (Std. Err. adjusted for 1,319 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   5.576029   5.675327     1.69   0.091     .7585171    40.99065
 only 12-18  |    2.67967   3.758191     0.70   0.482     .1715086    41.86747
      mixed  |   3.243628   3.168462     1.20   0.228     .4781397    22.00428
             |
        age1 |    .993566   .0051126    -1.25   0.210     .9835959    1.003637
        age2 |   1.019956   .0166629     1.21   0.226     .9878143    1.053143
        age3 |   .9526754   .0449497    -1.03   0.304     .8685265    1.044977
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9685397   .0278274    -1.11   0.266     .9155061    1.024645
             |
   ethnicity |
Asian or ..  |   1.079279   .0495582     1.66   0.097     .9863896    1.180916
      Other  |    .997451   .0470066    -0.05   0.957     .9094467    1.093971
             |
   obese4cat |
Obese I ..)  |    1.06925   .0437576     1.64   0.102     .9868361    1.158547
Obese II..)  |   .9962149   .0517116    -0.07   0.942     .8998473    1.102903
Obese II..)  |   1.084305   .0648138     1.35   0.176     .9644314    1.219078
             |
smoke_nomiss |
     Former  |   .8611832   .0976825    -1.32   0.188     .6895174    1.075588
    Current  |   1.101268    .046073     2.31   0.021     1.014569    1.195375
             |
         imd |
          4  |   .9816344   .0349267    -0.52   0.602     .9155116    1.052533
5 most de..  |    .981219   .0493529    -0.38   0.706     .8891041    1.082877
             |
tot_adults~h |
          2  |   .8752174   .5922493    -0.20   0.844     .2323367    3.296963
          3  |   .5862758   .3083331    -1.02   0.310     .2091412     1.64348
             |
    1.shield |   2.685068   2.760027     0.96   0.337      .358089    20.13352
1.htdiag_o~p |   .9755057   .0292501    -0.83   0.408     .9198287    1.034553
1.~y_disease |    .948749   .0351156    -1.42   0.155     .8823609    1.020132
    1.asthma |   1.048631   .0546646     0.91   0.362      .946782    1.161436
1.~c_disease |   .9591734   .0365677    -1.09   0.274     .8901142     1.03359
             |
     diabcat |
T1DM, con..  |   .8424982   .0865445    -1.67   0.095     .6888591    1.030404
T1DM, unc..  |   1.112343   .2137782     0.55   0.580     .7632177    1.621171
T2DM, con..  |   1.116258   .0413037     2.97   0.003      1.03817    1.200219
T2DM, unc..  |   1.042516    .078101     0.56   0.578     .9001485      1.2074
Diabetes,..  |   1.697096     .69894     1.28   0.199      .757083    3.804252
             |
cancer_exh~t |
  Last year  |   .8630865   .2079422    -0.61   0.541     .5382395     1.38399
2-5 years..  |   .9903187   .1159611    -0.08   0.934     .7872338    1.245794
   5+ years  |   .9823338   .0385207    -0.45   0.649      .909663     1.06081
             |
cancer_hae~t |
  Last year  |   .9361272   .2150654    -0.29   0.774     .5967332    1.468553
2-5 years..  |   1.105942   .1232093     0.90   0.366     .8890018     1.37582
   5+ years  |   .9941782   .0376706    -0.15   0.878     .9230201    1.070822
             |
1.~r_disease |   1.052397   .0365971     1.47   0.142     .9830582    1.126627
1.stroke_d~a |   1.017215   .0357342     0.49   0.627     .9495342     1.08972
1.other_ne~o |   1.034778   .0358737     0.99   0.324     .9668022    1.107533
             |
reduced_ki~t |
Stage 3a/..  |   1.148553   .2380526     0.67   0.504     .7651176    1.724144
      1.esrd |    .903661   .0294826    -3.10   0.002      .847685    .9633333
1.other_tr~t |    .953069   .0352933    -1.30   0.194      .886346    1.024815
  1.asplenia |   1.037354   .0376196     1.01   0.312     .9661808    1.113771
1.ra_sle_p~s |    .956363   .0334707    -1.27   0.202     .8929609    1.024267
1.other_im~o |   .9959337    .037535    -0.11   0.914     .9250179    1.072286
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .2708321   .2922648    -1.21   0.226     .0326691    2.245241
          1 #|
 only 12-18  |    .570404   .7833738    -0.41   0.683     .0386519    8.417717
    1#mixed  |   .4089852   .4204738    -0.87   0.384      .054525    3.067748
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.510168   .5259209     1.18   0.237     .7631174    2.988539
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.528495   .6362287     1.02   0.308     .6760133    3.455991
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.326596    .431795     0.87   0.385      .700939    2.510713
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_t
> imeperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_timeperi
> od3.ster saved
(no new episodes generated)
(cat_time: 302871 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    107,226       23.85       23.85
          1 |     91,677       20.39       44.24
          2 |     79,998       17.79       62.03
          3 |     69,728       15.51       77.54
          4 |     61,468       13.67       91.21
        400 |     39,521        8.79      100.00
------------+-----------------------------------
      Total |    449,618      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    97,933      9,293 |   107,226 
         1 |    84,642      7,035 |    91,677 
         2 |    73,895      6,103 |    79,998 
         3 |    64,702      5,026 |    69,728 
         4 |    48,270     13,198 |    61,468 
       400 |    36,753      2,768 |    39,521 
-----------+----------------------+----------
     Total |   406,195     43,423 |   449,618 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,094      6,666 |    68,760 
         1 |   344,107     36,763 |   380,870 
-----------+----------------------+----------
     Total |   406,201     43,429 |   449,630 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -112454.53
Iteration 1:   log pseudolikelihood = -112424.87
Iteration 2:   log pseudolikelihood = -112424.01
Iteration 3:   log pseudolikelihood = -112423.74
Iteration 4:   log pseudolikelihood = -112423.64
Iteration 5:   log pseudolikelihood =  -112423.6
Iteration 6:   log pseudolikelihood = -112423.59
Iteration 7:   log pseudolikelihood = -112423.58
Iteration 8:   log pseudolikelihood = -112423.58
Iteration 9:   log pseudolikelihood = -112423.58
Iteration 10:  log pseudolikelihood = -112423.58
Iteration 11:  log pseudolikelihood = -112423.58
Iteration 12:  log pseudolikelihood = -112423.58
Iteration 13:  log pseudolikelihood = -112423.58
Iteration 14:  log pseudolikelihood = -112423.58
Iteration 15:  log pseudolikelihood = -112423.58
Iteration 16:  log pseudolikelihood = -112423.58
Iteration 17:  log pseudolikelihood = -112423.58
Iteration 18:  log pseudolikelihood = -112423.58
Iteration 19:  log pseudolikelihood = -112423.58
Iteration 20:  log pseudolikelihood = -112423.58
Refining estimates:
Iteration 0:   log pseudolikelihood = -112423.58

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       61,468             Number of obs    =      61,468
No. of failures      =       13,198
Time at risk         =      6574507
                                                Wald chi2(45)    =     3228.11
Log pseudolikelihood =   -112423.58             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,306 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9869259   .4562821    -0.03   0.977     .3987966    2.442405
 only 12-18  |   2.37e-09   9.29e-10   -50.71   0.000     1.10e-09    5.11e-09
      mixed  |   1.163247   .4260678     0.41   0.680      .567412    2.384764
             |
        age1 |   .9904325   .0030572    -3.11   0.002     .9844586    .9964426
        age2 |   1.036416   .0103483     3.58   0.000     1.016331    1.056898
        age3 |    .895711   .0259151    -3.81   0.000     .8463316    .9479714
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9950645   .0183896    -0.27   0.789     .9596665    1.031768
             |
   ethnicity |
Asian or ..  |   .9575445   .0288209    -1.44   0.149     .9026905    1.015732
      Other  |   .9950742   .0286996    -0.17   0.864     .9403843    1.052945
             |
   obese4cat |
Obese I ..)  |   1.019711   .0253367     0.79   0.432     .9712413    1.070599
Obese II..)  |   .9998037   .0319469    -0.01   0.995     .9391092    1.064421
Obese II..)  |    .954069    .036449    -1.23   0.218     .8852392     1.02825
             |
smoke_nomiss |
     Former  |   1.067627   .0637179     1.10   0.273     .9497696    1.200109
    Current  |   1.030136   .0276342     1.11   0.268     .9773729    1.085747
             |
         imd |
          4  |   1.004487   .0216799     0.21   0.836     .9628818    1.047891
5 most de..  |    .977056   .0293436    -0.77   0.440     .9212036    1.036295
             |
tot_adults~h |
          2  |    1.47884   .6210283     0.93   0.351     .6493296     3.36804
          3  |   1.011305   .3622939     0.03   0.975     .5011232    2.040892
             |
    1.shield |   1.190865   .4850645     0.43   0.668     .5359816    2.645909
1.htdiag_o~p |   1.031188   .0200916     1.58   0.115     .9925516    1.071328
1.~y_disease |   1.005547   .0221615     0.25   0.802      .963036    1.049934
    1.asthma |   .9372285   .0303383    -2.00   0.045     .8796135    .9986174
1.~c_disease |   .9652906   .0214076    -1.59   0.111     .9242314    1.008174
             |
     diabcat |
T1DM, con..  |    .969306   .0537061    -0.56   0.574      .869558    1.080496
T1DM, unc..  |   1.007036   .1162346     0.06   0.952     .8031514    1.262679
T2DM, con..  |   1.016568   .0245456     0.68   0.496     .9695802    1.065833
T2DM, unc..  |   1.021247    .049289     0.44   0.663     .9290705    1.122568
Diabetes,..  |   .6987585   .2597039    -0.96   0.335     .3372605    1.447734
             |
cancer_exh~t |
  Last year  |   1.198957   .1521703     1.43   0.153     .9349107    1.537578
2-5 years..  |   1.134426   .0765904     1.87   0.062     .9938196    1.294926
   5+ years  |   .9920126   .0241309    -0.33   0.742     .9458266    1.040454
             |
cancer_hae~t |
  Last year  |   1.059303    .145306     0.42   0.674     .8095804    1.386056
2-5 years..  |   1.049858   .0719664     0.71   0.478     .9178717    1.200824
   5+ years  |   1.020127   .0230103     0.88   0.377     .9760099    1.066238
             |
1.~r_disease |   .9790248   .0209627    -0.99   0.322     .9387888    1.020985
1.stroke_d~a |   1.003948   .0208606     0.19   0.850     .9638838    1.045679
1.other_ne~o |    .994387   .0224264    -0.25   0.803     .9513893    1.039328
             |
reduced_ki~t |
Stage 3a/..  |   .9058335    .138234    -0.65   0.517      .671663    1.221646
      1.esrd |   .9977268   .0185757    -0.12   0.903     .9619753    1.034807
1.other_tr~t |   1.002346   .0248955     0.09   0.925     .9547203    1.052348
  1.asplenia |   .9754006   .0217502    -1.12   0.264     .9336892    1.018975
1.ra_sle_p~s |   1.000006   .0207631     0.00   1.000     .9601284    1.041541
1.other_im~o |   .9583792   .0221071    -1.84   0.065     .9160151    1.002703
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.041976   .5346703     0.08   0.936     .3811358    2.848628
          1 #|
 only 12-18  |   2.49e+08          .        .       .            .           .
    1#mixed  |   .8450579   .3443946    -0.41   0.680     .3801789    1.878386
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.028353   .1962542     0.15   0.884     .7074508    1.494818
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5912385   .2315197    -1.34   0.180     .2744388    1.273737
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .983011   .1684852    -0.10   0.920     .7025301    1.375472
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_t
> imeperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_timeperi
> od4.ster saved
(96,311 observations (episodes) created)
(cat_time: 85187 changes made)
(covid_death: 96311 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.88       23.88
          1 |     25,850       20.43       44.31
          2 |     22,519       17.80       62.11
          3 |     19,548       15.45       77.56
          4 |     17,270       13.65       91.21
        400 |     11,124        8.79      100.00
------------+-----------------------------------
      Total |    126,528      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    13,611      3,659 |    17,270 
       400 |    10,313        811 |    11,124 
-----------+----------------------+----------
     Total |   114,212     12,316 |   126,528 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,199      1,916 |    19,115 
         1 |    97,017     10,400 |   107,417 
-----------+----------------------+----------
     Total |   114,216     12,316 |   126,532 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -21300.757
Iteration 1:   log pseudolikelihood = -21277.729
Iteration 2:   log pseudolikelihood = -21275.752
Iteration 3:   log pseudolikelihood = -21275.486
Iteration 4:   log pseudolikelihood = -21275.421
Iteration 5:   log pseudolikelihood = -21275.398
Iteration 6:   log pseudolikelihood = -21275.389
Iteration 7:   log pseudolikelihood = -21275.386
Iteration 8:   log pseudolikelihood = -21275.385
Iteration 9:   log pseudolikelihood = -21275.384
Iteration 10:  log pseudolikelihood = -21275.384
Iteration 11:  log pseudolikelihood = -21275.384
Iteration 12:  log pseudolikelihood = -21275.384
Iteration 13:  log pseudolikelihood = -21275.384
Iteration 14:  log pseudolikelihood = -21275.384
Iteration 15:  log pseudolikelihood = -21275.384
Iteration 16:  log pseudolikelihood = -21275.384
Iteration 17:  log pseudolikelihood = -21275.384
Iteration 18:  log pseudolikelihood = -21275.384
Iteration 19:  log pseudolikelihood = -21275.384
Iteration 20:  log pseudolikelihood = -21275.384
Iteration 21:  log pseudolikelihood = -21275.384
Refining estimates:
Iteration 0:   log pseudolikelihood = -21275.384

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       30,217             Number of obs    =      30,217
No. of failures      =        2,683
Time at risk         =      2582909
                                                Wald chi2(45)    =     1689.44
Log pseudolikelihood =   -21275.384             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,204 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.464286   1.744654     0.32   0.749     .1417242    15.12892
 only 12-18  |   3.751994   4.574367     1.08   0.278     .3439472    40.92913
      mixed  |   1.298613   1.375848     0.25   0.805     .1627995    10.35873
             |
        age1 |   1.023331   .0180389     1.31   0.191     .9885789    1.059304
        age2 |   .8575947   .0792917    -1.66   0.097     .7154536    1.027975
        age3 |   1.368313   .2497735     1.72   0.086     .9567671    1.956883
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9910662   .0390299    -0.23   0.820     .9174467    1.070593
             |
   ethnicity |
Asian or ..  |    1.01579   .0667889     0.24   0.812     .8929702    1.155503
      Other  |   .9956186   .0647485    -0.07   0.946     .8764688    1.130966
             |
   obese4cat |
Obese I ..)  |   1.005457   .0534707     0.10   0.918     .9059337    1.115915
Obese II..)  |   1.060462   .0738358     0.84   0.399     .9251869    1.215517
Obese II..)  |   .9532205   .0829335    -0.55   0.582     .8037776    1.130449
             |
smoke_nomiss |
     Former  |   .8422882   .1306309    -1.11   0.268     .6215091    1.141495
    Current  |   .9593471   .0613781    -0.65   0.517     .8462852    1.087514
             |
         imd |
          4  |   .9099163   .0456264    -1.88   0.060     .8247441    1.003884
5 most de..  |   .9940628   .0659093    -0.09   0.928     .8729245    1.132012
             |
tot_adults~h |
          2  |   2.29e+09          .        .       .            .           .
          3  |   1.71e+09   1.09e+09    33.23   0.000     4.87e+08    5.97e+09
             |
    1.shield |   1.775199   1.944615     0.52   0.600     .2074011    15.19438
1.htdiag_o~p |   .9862964   .0395978    -0.34   0.731     .9116612    1.067042
1.~y_disease |   .9475512   .0461995    -1.10   0.269     .8611938    1.042568
    1.asthma |    .948073   .0645266    -0.78   0.433     .8296756    1.083366
1.~c_disease |   1.039695   .0486688     0.83   0.406     .9485507    1.139597
             |
     diabcat |
T1DM, con..  |   1.116417    .136318     0.90   0.367     .8788041    1.418276
T1DM, unc..  |   1.582007   .3181981     2.28   0.023     1.066599    2.346472
T2DM, con..  |   1.029114   .0515859     0.57   0.567      .932815    1.135354
T2DM, unc..  |   1.070844   .1054795     0.69   0.487     .8828399    1.298885
Diabetes,..  |   .4761255   .4806013    -0.74   0.462     .0658443    3.442903
             |
cancer_exh~t |
  Last year  |   1.255408   .3623117     0.79   0.431     .7130623    2.210255
2-5 years..  |   1.165517   .1593405     1.12   0.263     .8915569    1.523661
   5+ years  |   .8898901   .0477723    -2.17   0.030     .8010156    .9886254
             |
cancer_hae~t |
  Last year  |   1.206134   .3572154     0.63   0.527     .6749926    2.155223
2-5 years..  |   .7950557   .1426279    -1.28   0.201     .5593678     1.13005
   5+ years  |   1.076705   .0551766     1.44   0.149      .973815    1.190467
             |
1.~r_disease |   1.007056   .0502892     0.14   0.888     .9131606    1.110605
1.stroke_d~a |   1.066071    .050871     1.34   0.180     .9708857    1.170587
1.other_ne~o |   1.006343    .049491     0.13   0.898     .9138704    1.108172
             |
reduced_ki~t |
Stage 3a/..  |   1.072104   .1077296     0.69   0.488     .8804499    1.305477
      1.esrd |    1.01658   .0449838     0.37   0.710     .9321289    1.108683
1.other_tr~t |   1.049428   .0529895     0.96   0.339     .9505447    1.158599
  1.asplenia |   1.091604   .0521858     1.83   0.067     .9939676    1.198832
1.ra_sle_p~s |   1.031925    .048497     0.67   0.504     .9411192    1.131493
1.other_im~o |   1.043963   .0501889     0.89   0.371     .9500863    1.147115
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .5225613   .6579888    -0.52   0.606     .0442932    6.165056
          1 #|
 only 12-18  |   .3123564   .4063328    -0.89   0.371      .024398    3.998958
    1#mixed  |   .5115621   .5605961    -0.61   0.541     .0597184    4.382167
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7651792   .3002442    -0.68   0.495     .3546216    1.651053
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.171959    .605754     0.31   0.759     .4255488    3.227569
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6643214   .2284282    -1.19   0.234     .3386031    1.303364
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_t
> imeperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_timeperi
> od0.ster saved
(no new episodes generated)
(cat_time: 85187 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.88       23.88
          1 |     25,850       20.43       44.31
          2 |     22,519       17.80       62.11
          3 |     19,548       15.45       77.56
          4 |     17,270       13.65       91.21
        400 |     11,124        8.79      100.00
------------+-----------------------------------
      Total |    126,528      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    13,611      3,659 |    17,270 
       400 |    10,313        811 |    11,124 
-----------+----------------------+----------
     Total |   114,212     12,316 |   126,528 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,199      1,916 |    19,115 
         1 |    97,017     10,400 |   107,417 
-----------+----------------------+----------
     Total |   114,216     12,316 |   126,532 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -15694.112
Iteration 1:   log pseudolikelihood = -15673.361
Iteration 2:   log pseudolikelihood = -15671.647
Iteration 3:   log pseudolikelihood = -15671.283
Iteration 4:   log pseudolikelihood =  -15671.16
Iteration 5:   log pseudolikelihood = -15671.114
Iteration 6:   log pseudolikelihood = -15671.098
Iteration 7:   log pseudolikelihood = -15671.092
Iteration 8:   log pseudolikelihood =  -15671.09
Iteration 9:   log pseudolikelihood = -15671.089
Iteration 10:  log pseudolikelihood = -15671.088
Iteration 11:  log pseudolikelihood = -15671.088
Iteration 12:  log pseudolikelihood = -15671.088
Iteration 13:  log pseudolikelihood = -15671.088
Iteration 14:  log pseudolikelihood = -15671.088
Iteration 15:  log pseudolikelihood = -15671.088
Iteration 16:  log pseudolikelihood = -15671.088
Iteration 17:  log pseudolikelihood = -15671.088
Iteration 18:  log pseudolikelihood = -15671.088
Iteration 19:  log pseudolikelihood = -15671.088
Iteration 20:  log pseudolikelihood = -15671.088
Iteration 21:  log pseudolikelihood = -15671.088
Iteration 22:  log pseudolikelihood = -15671.088
Iteration 23:  log pseudolikelihood = -15671.088
Iteration 24:  log pseudolikelihood = -15671.088
Iteration 25:  log pseudolikelihood = -15671.088
Iteration 26:  log pseudolikelihood = -15671.088
Iteration 27:  log pseudolikelihood = -15671.088
Iteration 28:  log pseudolikelihood = -15671.088
Iteration 29:  log pseudolikelihood = -15671.088
Refining estimates:
Iteration 0:   log pseudolikelihood = -15671.088
Iteration 1:   log pseudolikelihood = -15671.088
Iteration 2:   log pseudolikelihood = -15671.088

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       25,850             Number of obs    =      25,850
No. of failures      =        2,014
Time at risk         =      1670587
                                                Wald chi2(46)    =    16091.78
Log pseudolikelihood =   -15671.088             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,185 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .4657384   .4505033    -0.79   0.430     .0699495    3.100983
 only 12-18  |   .3710436   .4332581    -0.85   0.396     .0376269    3.658907
      mixed  |   .2602482   .2019566    -1.73   0.083     .0568647    1.191058
             |
        age1 |   1.024062   .0214148     1.14   0.256     .9829382    1.066906
        age2 |   .8863629   .0961389    -1.11   0.266     .7166158    1.096318
        age3 |   1.273206   .2716196     1.13   0.258     .8381226    1.934149
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9812277   .0431806    -0.43   0.667     .9001424    1.069617
             |
   ethnicity |
Asian or ..  |   1.115592   .0798516     1.53   0.126     .9695685    1.283609
      Other  |   1.064275   .0737823     0.90   0.369     .9290584    1.219171
             |
   obese4cat |
Obese I ..)  |   .9343362   .0615591    -1.03   0.303      .821148    1.063126
Obese II..)  |   1.012548   .0803137     0.16   0.875     .8667613    1.182855
Obese II..)  |   .9300738   .0922659    -0.73   0.465     .7657304    1.129689
             |
smoke_nomiss |
     Former  |    .948654   .1552932    -0.32   0.747     .6882836     1.30752
    Current  |   .9345798   .0666186    -0.95   0.343     .8127204    1.074711
             |
         imd |
          4  |   1.015302    .058056     0.27   0.791     .9076592    1.135711
5 most de..  |   .9496952   .0713393    -0.69   0.492     .8196786    1.100335
             |
tot_adults~h |
          2  |   .8205578   .5490329    -0.30   0.768     .2210918     3.04541
          3  |   2.25e+13   1.43e+13    48.48   0.000     6.49e+12    7.80e+13
             |
    1.shield |   .1339833   .1404794    -1.92   0.055     .0171624    1.045977
1.htdiag_o~p |   1.007204   .0487649     0.15   0.882     .9160218    1.107464
1.~y_disease |   1.183952   .0657699     3.04   0.002     1.061816    1.320138
    1.asthma |   .9928678   .0819965    -0.09   0.931       .84449    1.167316
1.~c_disease |   1.096278   .0605986     1.66   0.096     .9837144    1.221721
             |
     diabcat |
T1DM, con..  |   .8178689   .1314862    -1.25   0.211     .5968136    1.120801
T1DM, unc..  |   1.140438   .3167235     0.47   0.636     .6617216    1.965478
T2DM, con..  |   1.043604   .0659823     0.68   0.500     .9219734    1.181282
T2DM, unc..  |   .8929947   .1182244    -0.85   0.393      .688902    1.157551
Diabetes,..  |   1.969325   1.200288     1.11   0.266     .5963709    6.503067
             |
cancer_exh~t |
  Last year  |   1.735604    .493559     1.94   0.053     .9940123    3.030466
2-5 years..  |   1.135865   .2066598     0.70   0.484     .7951679    1.622538
   5+ years  |   .9939099   .0600091    -0.10   0.919     .8829868    1.118768
             |
cancer_hae~t |
  Last year  |   .7937918   .3285076    -0.56   0.577     .3527282    1.786376
2-5 years..  |   1.023345   .1854385     0.13   0.899     .7174261     1.45971
   5+ years  |   .9892531    .060939    -0.18   0.861     .8767435    1.116201
             |
1.~r_disease |   .9481507   .0566947    -0.89   0.373     .8432953    1.066044
1.stroke_d~a |   1.019973   .0523142     0.39   0.700     .9224243    1.127838
1.other_ne~o |   1.079951   .0598671     1.39   0.165     .9687636      1.2039
             |
reduced_ki~t |
Stage 3a/..  |   .8613609   .1144515    -1.12   0.261     .6638707    1.117601
      1.esrd |   1.073561   .0568318     1.34   0.180     .9677569    1.190933
1.other_tr~t |    .991268      .0559    -0.16   0.876     .8875437    1.107114
  1.asplenia |   1.033668   .0617742     0.55   0.580     .9194152     1.16212
1.ra_sle_p~s |   .9724704   .0538205    -0.50   0.614     .8725039     1.08389
1.other_im~o |   .9624972   .0536533    -0.69   0.493     .8628796    1.073615
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   3.955205   4.886166     1.11   0.266     .3512488    44.53722
          1 #|
 only 12-18  |   5.498909   8.257458     1.14   0.256     .2897788    104.3486
    1#mixed  |    6.81602    7.14984     1.83   0.067     .8722502     53.2624
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.842091   1.384159     0.81   0.416     .4223891    8.033583
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.040335    1.86428     0.78   0.435     .3403671    12.23081
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.773857   1.253305     0.81   0.417     .4441287    7.084814
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_t
> imeperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_timeperi
> od1.ster saved
(no new episodes generated)
(cat_time: 85187 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.88       23.88
          1 |     25,850       20.43       44.31
          2 |     22,519       17.80       62.11
          3 |     19,548       15.45       77.56
          4 |     17,270       13.65       91.21
        400 |     11,124        8.79      100.00
------------+-----------------------------------
      Total |    126,528      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    13,611      3,659 |    17,270 
       400 |    10,313        811 |    11,124 
-----------+----------------------+----------
     Total |   114,212     12,316 |   126,528 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,199      1,916 |    19,115 
         1 |    97,017     10,400 |   107,417 
-----------+----------------------+----------
     Total |   114,216     12,316 |   126,532 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -13581.505
Iteration 1:   log pseudolikelihood = -13561.308
Iteration 2:   log pseudolikelihood = -13560.831
Iteration 3:   log pseudolikelihood = -13560.699
Iteration 4:   log pseudolikelihood = -13560.651
Iteration 5:   log pseudolikelihood = -13560.633
Iteration 6:   log pseudolikelihood = -13560.626
Iteration 7:   log pseudolikelihood = -13560.624
Iteration 8:   log pseudolikelihood = -13560.623
Iteration 9:   log pseudolikelihood = -13560.623
Iteration 10:  log pseudolikelihood = -13560.622
Iteration 11:  log pseudolikelihood = -13560.622
Iteration 12:  log pseudolikelihood = -13560.622
Iteration 13:  log pseudolikelihood = -13560.622
Iteration 14:  log pseudolikelihood = -13560.622
Iteration 15:  log pseudolikelihood = -13560.622
Iteration 16:  log pseudolikelihood = -13560.622
Iteration 17:  log pseudolikelihood = -13560.622
Iteration 18:  log pseudolikelihood = -13560.622
Iteration 19:  log pseudolikelihood = -13560.622
Iteration 20:  log pseudolikelihood = -13560.622
Iteration 21:  log pseudolikelihood = -13560.622
Iteration 22:  log pseudolikelihood = -13560.622
Refining estimates:
Iteration 0:   log pseudolikelihood = -13560.622

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       22,519             Number of obs    =      22,519
No. of failures      =        1,775
Time at risk         =      1283270
                                                Wald chi2(45)    =      577.15
Log pseudolikelihood =   -13560.622             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,170 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .3451279    .492443    -0.75   0.456     .0210596    5.656012
 only 12-18  |   .7992927   1.115095    -0.16   0.872     .0519031    12.30888
      mixed  |   .5012993   .5219073    -0.66   0.507     .0651483    3.857366
             |
        age1 |   1.016051   .0210618     0.77   0.442     .9755983    1.058182
        age2 |   .8853026   .0989956    -1.09   0.276     .7110651    1.102235
        age3 |   1.283524   .2851281     1.12   0.261     .8304507    1.983781
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9971516   .0453137    -0.06   0.950     .9121786     1.09004
             |
   ethnicity |
Asian or ..  |   .8925709   .0742123    -1.37   0.172     .7583507    1.050547
      Other  |   .8930531   .0708975    -1.42   0.154     .7643676    1.043403
             |
   obese4cat |
Obese I ..)  |    .945999   .0648876    -0.81   0.418     .8269998    1.082121
Obese II..)  |    .950652   .0797022    -0.60   0.546     .8065982    1.120433
Obese II..)  |   .8726539   .0924039    -1.29   0.198     .7091036    1.073926
             |
smoke_nomiss |
     Former  |   .7747372   .1450998    -1.36   0.173     .5367027    1.118343
    Current  |   .9335406   .0706815    -0.91   0.364     .8047961     1.08288
             |
         imd |
          4  |   1.003892   .0629348     0.06   0.951     .8878187     1.13514
5 most de..  |   1.107562   .0845038     1.34   0.181     .9537267    1.286212
             |
tot_adults~h |
          2  |   3.18e+09          .        .       .            .           .
          3  |   4.38e+09   4.99e+09    19.50   0.000     4.70e+08    4.08e+10
             |
    1.shield |   .5906632   .6445836    -0.48   0.629     .0695719     5.01471
1.htdiag_o~p |   .9851646     .04802    -0.31   0.759     .8954031    1.083924
1.~y_disease |   .9078911   .0579355    -1.51   0.130     .8011536    1.028849
    1.asthma |   1.050708   .0892945     0.58   0.561     .8894932    1.241142
1.~c_disease |   1.106824     .06513     1.72   0.085     .9862577    1.242129
             |
     diabcat |
T1DM, con..  |   1.168649   .1623787     1.12   0.262     .8900475    1.534457
T1DM, unc..  |   .5922266   .2429077    -1.28   0.202     .2650691    1.323173
T2DM, con..  |   1.089221   .0691943     1.35   0.179      .961706    1.233644
T2DM, unc..  |   .8001142   .1150234    -1.55   0.121     .6036488    1.060522
Diabetes,..  |   .7524381   .7339869    -0.29   0.771     .1112096    5.090955
             |
cancer_exh~t |
  Last year  |   1.328325   .4419889     0.85   0.394     .6919489    2.549966
2-5 years..  |   1.001393   .1787495     0.01   0.994     .7057721    1.420839
   5+ years  |   .9787001   .0662663    -0.32   0.750     .8570695    1.117592
             |
cancer_hae~t |
  Last year  |   1.101623   .3880523     0.27   0.784     .5523229    2.197218
2-5 years..  |   1.091939    .198378     0.48   0.628     .7648151     1.55898
   5+ years  |    .952055    .059914    -0.78   0.435     .8415789    1.077034
             |
1.~r_disease |   .9568536   .0586857    -0.72   0.472     .8484761    1.079074
1.stroke_d~a |   .9097171   .0554095    -1.55   0.120     .8073483    1.025066
1.other_ne~o |   1.067557   .0620865     1.12   0.261      .952549    1.196451
             |
reduced_ki~t |
Stage 3a/..  |   .8876988   .1236581    -0.86   0.392     .6756031    1.166379
      1.esrd |   .9792626   .0509051    -0.40   0.687     .8844048    1.084295
1.other_tr~t |   1.015851   .0621306     0.26   0.797     .9010932    1.145224
  1.asplenia |   .9106789   .0584297    -1.46   0.145     .8030668    1.032711
1.ra_sle_p~s |   1.070699   .0628299     1.16   0.244     .9543725    1.201205
1.other_im~o |   .9943248   .0609029    -0.09   0.926      .881844    1.121153
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   2.010646   3.019937     0.47   0.642     .1058896    38.17842
          1 #|
 only 12-18  |   1.365325   2.064571     0.21   0.837     .0704847    26.44705
    1#mixed  |   1.749716   1.912522     0.51   0.609     .2053828    14.90634
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .69393   .4341281    -0.58   0.559     .2036091    2.365016
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.091295   .7590931     0.13   0.900     .2791612    4.266079
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8771312   .4663494    -0.25   0.805     .3093865    2.486725
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_t
> imeperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_timeperi
> od2.ster saved
(no new episodes generated)
(cat_time: 85187 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.88       23.88
          1 |     25,850       20.43       44.31
          2 |     22,519       17.80       62.11
          3 |     19,548       15.45       77.56
          4 |     17,270       13.65       91.21
        400 |     11,124        8.79      100.00
------------+-----------------------------------
      Total |    126,528      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    13,611      3,659 |    17,270 
       400 |    10,313        811 |    11,124 
-----------+----------------------+----------
     Total |   114,212     12,316 |   126,528 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,199      1,916 |    19,115 
         1 |    97,017     10,400 |   107,417 
-----------+----------------------+----------
     Total |   114,216     12,316 |   126,532 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -10330.889
Iteration 1:   log pseudolikelihood = -10310.222
Iteration 2:   log pseudolikelihood = -10309.586
Iteration 3:   log pseudolikelihood = -10309.477
Iteration 4:   log pseudolikelihood = -10309.438
Iteration 5:   log pseudolikelihood = -10309.424
Iteration 6:   log pseudolikelihood = -10309.418
Iteration 7:   log pseudolikelihood = -10309.416
Iteration 8:   log pseudolikelihood = -10309.416
Iteration 9:   log pseudolikelihood = -10309.415
Iteration 10:  log pseudolikelihood = -10309.415
Iteration 11:  log pseudolikelihood = -10309.415
Iteration 12:  log pseudolikelihood = -10309.415
Iteration 13:  log pseudolikelihood = -10309.415
Iteration 14:  log pseudolikelihood = -10309.415
Iteration 15:  log pseudolikelihood = -10309.415
Iteration 16:  log pseudolikelihood = -10309.415
Iteration 17:  log pseudolikelihood = -10309.415
Iteration 18:  log pseudolikelihood = -10309.415
Iteration 19:  log pseudolikelihood = -10309.415
Iteration 20:  log pseudolikelihood = -10309.415
Refining estimates:
Iteration 0:   log pseudolikelihood = -10309.415

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       19,548             Number of obs    =      19,548
No. of failures      =        1,374
Time at risk         =       885122
                                                Wald chi2(44)    =     5187.66
Log pseudolikelihood =   -10309.415             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,146 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   4.16e+08          .        .       .            .           .
 only 12-18  |   .4717861   .4954806    -0.72   0.474     .0602274    3.695699
      mixed  |   2.67e+08   1.67e+08    31.07   0.000     7.86e+07    9.10e+08
             |
        age1 |   .9999531   .0245329    -0.00   0.998     .9530073    1.049211
        age2 |   1.073434   .1370959     0.55   0.579     .8357228    1.378759
        age3 |   .8338042   .2097744    -0.72   0.470     .5092285     1.36526
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.161006   .0660975     2.62   0.009     1.038423    1.298059
             |
   ethnicity |
Asian or ..  |   .9697029    .090637    -0.33   0.742     .8073798    1.164661
      Other  |   .8673636   .0828162    -1.49   0.136     .7193299    1.045862
             |
   obese4cat |
Obese I ..)  |   1.007683   .0766582     0.10   0.920     .8681001    1.169709
Obese II..)  |   .7916704   .0826928    -2.24   0.025     .6451094    .9715283
Obese II..)  |   .8882698   .1043814    -1.01   0.313     .7055364    1.118331
             |
smoke_nomiss |
     Former  |   1.287969   .2288736     1.42   0.154     .9091713    1.824588
    Current  |   1.069744   .0879437     0.82   0.412     .9105477    1.256774
             |
         imd |
          4  |   1.004006   .0666364     0.06   0.952     .8815387    1.143486
5 most de..  |   .8890479   .0838848    -1.25   0.213     .7389436    1.069643
             |
tot_adults~h |
          2  |   1.061522    .887162     0.07   0.943     .2063202    5.461558
          3  |   .3048008   .2586142    -1.40   0.161     .0577827     1.60781
             |
    1.shield |   1.27e+08   1.30e+08    18.21   0.000     1.70e+07    9.46e+08
1.htdiag_o~p |   .9536652   .0527863    -0.86   0.391     .8556204    1.062945
1.~y_disease |   .9329975   .0680266    -0.95   0.342     .8087565    1.076324
    1.asthma |   1.121874   .1076887     1.20   0.231      .929474    1.354101
1.~c_disease |   .9538341   .0617643    -0.73   0.465     .8401452    1.082907
             |
     diabcat |
T1DM, con..  |   .8523456   .1652685    -0.82   0.410     .5828664    1.246414
T1DM, unc..  |   .8276793    .316453    -0.49   0.621     .3912152     1.75109
T2DM, con..  |   .8847329   .0678361    -1.60   0.110     .7612847    1.028199
T2DM, unc..  |   .9536373   .1447346    -0.31   0.754     .7082644    1.284018
Diabetes,..  |   .7992343   .8012529    -0.22   0.823      .112027    5.701977
             |
cancer_exh~t |
  Last year  |   .5424403   .3144945    -1.06   0.291     .1741184    1.689893
2-5 years..  |    .878021    .195476    -0.58   0.559     .5675444    1.358345
   5+ years  |   1.013743   .0708396     0.20   0.845     .8839885    1.162544
             |
cancer_hae~t |
  Last year  |   1.414131   .5169244     0.95   0.343     .6907801    2.894941
2-5 years..  |   .8024247    .195965    -0.90   0.367     .4971955    1.295035
   5+ years  |   .9849597    .068738    -0.22   0.828     .8590435    1.129332
             |
1.~r_disease |   .9207043    .062383    -1.22   0.223     .8062067    1.051463
1.stroke_d~a |   .9761516   .0653208    -0.36   0.718     .8561655    1.112953
1.other_ne~o |   .9751643   .0666326    -0.37   0.713     .8529342    1.114911
             |
reduced_ki~t |
Stage 3a/..  |   .9851636   .1490311    -0.10   0.921     .7323901    1.325178
      1.esrd |   .9832865   .0612962    -0.27   0.787     .8701974    1.111073
1.other_tr~t |   .9621983   .0685229    -0.54   0.588     .8368475    1.106325
  1.asplenia |   .9691191   .0679827    -0.45   0.655     .8446295    1.111957
1.ra_sle_p~s |   1.021776   .0706193     0.31   0.755     .8923304    1.170001
1.other_im~o |   .9529967   .0690686    -0.66   0.507     .8267999    1.098455
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   4.29e-09   3.48e-09   -23.75   0.000     8.75e-10    2.10e-08
          1 #|
 only 12-18  |    5.08017          .        .       .            .           .
    1#mixed  |   8.36e-09   8.60e-09   -18.09   0.000     1.11e-09    6.28e-08
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.783422   1.446698     0.71   0.476     .3637189    8.744647
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.396754   2.517126     0.83   0.405     .3059652    18.77478
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.236547   1.820122     0.99   0.323     .4537982    11.02284
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_t
> imeperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_timeperi
> od3.ster saved
(no new episodes generated)
(cat_time: 85187 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,217       23.88       23.88
          1 |     25,850       20.43       44.31
          2 |     22,519       17.80       62.11
          3 |     19,548       15.45       77.56
          4 |     17,270       13.65       91.21
        400 |     11,124        8.79      100.00
------------+-----------------------------------
      Total |    126,528      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,534      2,683 |    30,217 
         1 |    23,836      2,014 |    25,850 
         2 |    20,744      1,775 |    22,519 
         3 |    18,174      1,374 |    19,548 
         4 |    13,611      3,659 |    17,270 
       400 |    10,313        811 |    11,124 
-----------+----------------------+----------
     Total |   114,212     12,316 |   126,528 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,199      1,916 |    19,115 
         1 |    97,017     10,400 |   107,417 
-----------+----------------------+----------
     Total |   114,216     12,316 |   126,532 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -26544.073
Iteration 1:   log pseudolikelihood = -26519.867
Iteration 2:   log pseudolikelihood = -26518.462
Iteration 3:   log pseudolikelihood = -26518.029
Iteration 4:   log pseudolikelihood = -26517.873
Iteration 5:   log pseudolikelihood = -26517.816
Iteration 6:   log pseudolikelihood = -26517.795
Iteration 7:   log pseudolikelihood = -26517.787
Iteration 8:   log pseudolikelihood = -26517.785
Iteration 9:   log pseudolikelihood = -26517.784
Iteration 10:  log pseudolikelihood = -26517.783
Iteration 11:  log pseudolikelihood = -26517.783
Iteration 12:  log pseudolikelihood = -26517.783
Iteration 13:  log pseudolikelihood = -26517.783
Iteration 14:  log pseudolikelihood = -26517.783
Iteration 15:  log pseudolikelihood = -26517.783
Iteration 16:  log pseudolikelihood = -26517.783
Iteration 17:  log pseudolikelihood = -26517.783
Iteration 18:  log pseudolikelihood = -26517.783
Iteration 19:  log pseudolikelihood = -26517.783
Iteration 20:  log pseudolikelihood = -26517.783
Refining estimates:
Iteration 0:   log pseudolikelihood = -26517.783

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       17,270             Number of obs    =      17,270
No. of failures      =        3,659
Time at risk         =      1850905
                                                Wald chi2(44)    =    12200.15
Log pseudolikelihood =   -26517.783             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,125 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   6.36e-09          .        .       .            .           .
 only 12-18  |   2.84e-09   1.62e-09   -34.48   0.000     9.27e-10    8.69e-09
      mixed  |   1.211645   1.378181     0.17   0.866     .1303705    11.26086
             |
        age1 |    .973411   .0144963    -1.81   0.070     .9454094    1.002242
        age2 |   1.114718   .0867508     1.40   0.163     .9570222    1.298399
        age3 |    .824483   .1270247    -1.25   0.210     .6095939    1.115123
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9661762   .0335657    -0.99   0.322     .9025785    1.034255
             |
   ethnicity |
Asian or ..  |   1.033648   .0583367     0.59   0.558     .9254068    1.154549
      Other  |   .9965251   .0541493    -0.06   0.949     .8958506    1.108513
             |
   obese4cat |
Obese I ..)  |   1.002018   .0496826     0.04   0.968     .9092234    1.104282
Obese II..)  |   1.039896   .0642876     0.63   0.527     .9212291    1.173849
Obese II..)  |   .9431495   .0699925    -0.79   0.430     .8154769    1.090811
             |
smoke_nomiss |
     Former  |   .9782343   .1166147    -0.18   0.854     .7744113    1.235703
    Current  |    .878622   .0437258    -2.60   0.009      .796968    .9686418
             |
         imd |
          4  |   1.006747   .0408208     0.17   0.868     .9298358    1.090019
5 most de..  |   .9441119    .053724    -1.01   0.312     .8444744    1.055505
             |
tot_adults~h |
          2  |   3.216842   3.917706     0.96   0.337     .2956474     35.0014
          3  |   4.558198   4.611482     1.50   0.134     .6275401    33.10891
             |
    1.shield |   1.698969    1.94431     0.46   0.643      .180329    16.00684
1.htdiag_o~p |   1.003452   .0339157     0.10   0.919     .9391323    1.072177
1.~y_disease |   1.041185   .0437871     0.96   0.337      .958806    1.130643
    1.asthma |   1.069525   .0653433     1.10   0.271     .9488255    1.205579
1.~c_disease |   1.085121   .0422606     2.10   0.036     1.005374    1.171194
             |
     diabcat |
T1DM, con..  |   1.002536   .1062587     0.02   0.981     .8144815     1.23401
T1DM, unc..  |   .9509929   .2029815    -0.24   0.814     .6258863    1.444971
T2DM, con..  |   1.007355   .0456067     0.16   0.871     .9218185    1.100828
T2DM, unc..  |   .9139861   .0825787    -1.00   0.320     .7656556    1.091053
Diabetes,..  |   .9964837   .5703965    -0.01   0.995     .3245148     3.05989
             |
cancer_exh~t |
  Last year  |   .9043809   .2584217    -0.35   0.725     .5165655    1.583352
2-5 years..  |   1.202355   .1475322     1.50   0.133     .9453395    1.529246
   5+ years  |    .991441   .0452771    -0.19   0.851     .9065551    1.084275
             |
cancer_hae~t |
  Last year  |   1.259324   .3266409     0.89   0.374     .7574509    2.093728
2-5 years..  |   1.107257   .1395255     0.81   0.419     .8649449    1.417452
   5+ years  |   .9725148   .0447669    -0.61   0.545     .8886151    1.064336
             |
1.~r_disease |   1.022385   .0428171     0.53   0.597     .9418166    1.109845
1.stroke_d~a |   .9166429   .0389615    -2.05   0.041     .8433741     .996277
1.other_ne~o |   .9776074   .0400753    -0.55   0.581     .9021337    1.059395
             |
reduced_ki~t |
Stage 3a/..  |   1.115197   .0916164     1.33   0.184     .9493429    1.310027
      1.esrd |   .9949285   .0366364    -0.14   0.890     .9256524    1.069389
1.other_tr~t |   1.049286   .0452995     1.11   0.265     .9641535    1.141936
  1.asplenia |   1.042652   .0464775     0.94   0.349     .9554239    1.137844
1.ra_sle_p~s |   1.036737   .0415324     0.90   0.368     .9584483     1.12142
1.other_im~o |   1.008878   .0436012     0.20   0.838     .9269409    1.098059
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.04e+08   4.37e+07    43.87   0.000     4.55e+07    2.37e+08
          1 #|
 only 12-18  |   1.26e+08          .        .       .            .           .
    1#mixed  |   .5353264   .6129811    -0.55   0.585     .0567468    5.050052
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6595083   .2774911    -0.99   0.323     .2891168    1.504413
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3586493   .2047262    -1.80   0.072     .1171608    1.097887
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6486255   .2448816    -1.15   0.252     .3094796    1.359428
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_t
> imeperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_timeperi
> od4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_shield_covid_death.lo
> g
  log type:  text
 closed on:  15 Mar 2023, 14:22:41
-------------------------------------------------------------------------------
