-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_death_vac
> cine_stratified.log
  log type:  text
 opened on:  15 Mar 2023, 14:49:21

. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents_int ("age") _tab ("exposure") _tab ("exposure lev
> el") ///
> _tab ("outcome") _tab ("int_type") _tab ("int_level") ///
> _tab ("events") _tab ("person_years") _tab ("rate") ///
> _tab ("HR")  _tab ("lci")  _tab ("uci") _tab ("pval") _n
  3. foreach x in 0 1 {
  4. forvalues i=`min'/`max'{
  5. foreach int_type in vaccine {
  6. 
. foreach int_level in  1 2 3 {
  7. 
. local endwith "_tab"
  8. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_int ("`x'") _tab ("`variable'") _tab ("`i'")
>  _tab ("`outcome'") _tab ("`int_type'") _tab ("`int_level'") _tab
  9.  
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
 10. 
. replace covid_vacc_second_dose_date=. if covid_vacc_date>=covid_vacc_second_d
> ose_date
 11. replace covid_vacc_second_dose_date=. if covid_vacc_date==. 
 12. drop if covid_vacc_date<d(20dec2020)
 13. drop if covid_vacc_second_dose_date<d(20dec2020)
 14. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
 15. replace `outcome'=0 if stime_`outcome'<date_`outcome'
 16. *Drop those without any eligible follow-up
. drop if enter_date>=stime_`outcome'
 17. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 18. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 19. format first_vacc_plus_7d second_vacc_plus_7d %td
 20. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 21. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 22. 
. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 23. 
. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 24. recode `outcome' .=0 
 25. stsplit split2, after(second_vacc_plus_7d) at(0)
 26. recode `outcome' .=0 
 27. 
. stset
 28. bysort patient_id (_t): gen vaccine=_n
 29. 
.         keep if vaccine==`int_level'
 30. *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 31.         local event = r(N)
 32.         gen fup=_t-_t0
 33.     bysort `variable': egen total_follow_up = total(fup)
 34.         su total_follow_up if `variable' == `i'
 35.         local person_days = r(mean)
 36.         local person_years=`person_days'/365.25
 37.         local rate = 100000*(`event'/`person_years')
 38.         
.         file write tablecontents_int (`event') _tab %10.0f (`person_years') _
> tab %3.2f (`rate') _tab
 39.         drop total_follow_up
 40.  
.         foreach modeltype of any fulladj {
 41. 
.                 local noestimatesflag 0 /*reset*/
 42. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 43. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 44.                                 cap estimates use ./output/an_interaction_
> cox_models_`outcome'_kids_cat4_`int_type'_`x'
 45.                                 if _rc!=0 local noestimatesflag 1
 46.                                 }
 47.                                 di "`noestimatesflag'"
 48.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0{
 49.                         if `int_level'==1 {
 50.                             
.                         local pval=r(p)
 51.                         cap lincom 1.vaccine +1.vaccine#`i'.`variable', ef
> orm
 52.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab %4.2f (`pval') `endwith'
 53. 
.                                 else file write tablecontents_int %4.2f ("ERR
>  IN MODEL") `endwith'
 54.                                 }
 55.                         if `int_level'==2 {
 56.                         cap lincom 2.vaccine +2.vaccine#`i'.`variable', ef
> orm
 57.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 58.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 59.                                 }
 60.                         
.                         if `int_level'==3 {
 61.                         cap lincom 3.vaccine +3.vaccine#`i'.`variable', ef
> orm
 62.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 63.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 64.                                 }
 65.                         }
 66.                         
.                         else file write tablecontents_int %4.2f ("DID NOT FIT
> ") `endwith'
 67. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 68.                         if "`modeltype'"=="fulladj" {
 69.                                 local hr = r(estimate)
 70.                                 local lb = r(lb)
 71.                                 local ub = r(ub)
 72.                                 cap gen `variable'=.
 73.                                 test 1.`int_type'#2.`variable' 1.`int_type
> '#1.`variable'
 74.                                 local pval=r(p)
 75.                                 post HRestimates_int ("`x'") ("`outcome'")
>  ("`variable'") ("`int_type'") (`i') (`int_level') (`hr') (`lb') (`ub') (`pva
> l')
 76.                                 drop `variable'
 77.                                 }
 78.                 }
 79.                 }
 80.                 } /*int_level*/
 81.                 } /*full adj*/
 82. 
. } /*variable levels*/
 83. }
 84. end

. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. cap file close tablecontents_int

. file open tablecontents_int using ./output/11_an_int_tab_contents_HRtable_`ou
> tcome'_vaccine_stratified.txt, t w replace
(note: file ./output/11_an_int_tab_contents_HRtable_covid_death_vaccine_stratif
> ied.txt not found)

. 
. tempfile HRestimates_int

. cap postutil clear

. postfile HRestimates_int str10 x str10 outcome str27 variable str27 int_type 
> level int_level hr lci uci pval using `HRestimates_int'

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(72,676 real changes made)
(24,104 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(25,003 real changes made, 25,003 to missing)
(81,497 real changes made, 81,497 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(70,916 observations (episodes) created)
(covid_death: 70916 changes made)
(3,397 observations (episodes) created)
(covid_death: 3397 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    176,034  total observations
          0  exclusions
------------------------------------------------------------------------------
    176,034  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(74,313 observations deleted)
  38

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        334       32310           0      32310      32310
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(72,676 real changes made)
(24,104 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(25,003 real changes made, 25,003 to missing)
(81,497 real changes made, 81,497 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(70,916 observations (episodes) created)
(covid_death: 70916 changes made)
(3,397 observations (episodes) created)
(covid_death: 3397 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    176,034  total observations
          0  exclusions
------------------------------------------------------------------------------
    176,034  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(105,118 observations deleted)
  39

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        267       35485           0      35485      35485
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(72,676 real changes made)
(24,104 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(25,003 real changes made, 25,003 to missing)
(81,497 real changes made, 81,497 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(70,916 observations (episodes) created)
(covid_death: 70916 changes made)
(3,397 observations (episodes) created)
(covid_death: 3397 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    176,034  total observations
          0  exclusions
------------------------------------------------------------------------------
    176,034  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(172,637 observations deleted)
  51

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        176       26707           0      26707      26707
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(72,676 real changes made)
(24,104 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(25,003 real changes made, 25,003 to missing)
(81,497 real changes made, 81,497 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(70,916 observations (episodes) created)
(covid_death: 70916 changes made)
(3,397 observations (episodes) created)
(covid_death: 3397 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    176,034  total observations
          0  exclusions
------------------------------------------------------------------------------
    176,034  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(74,313 observations deleted)
  94

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        875       89522           0      89522      89522
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(72,676 real changes made)
(24,104 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(25,003 real changes made, 25,003 to missing)
(81,497 real changes made, 81,497 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(70,916 observations (episodes) created)
(covid_death: 70916 changes made)
(3,397 observations (episodes) created)
(covid_death: 3397 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    176,034  total observations
          0  exclusions
------------------------------------------------------------------------------
    176,034  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(105,118 observations deleted)
  135

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        694       86094           0      86094      86094
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(72,676 real changes made)
(24,104 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(25,003 real changes made, 25,003 to missing)
(81,497 real changes made, 81,497 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(70,916 observations (episodes) created)
(covid_death: 70916 changes made)
(3,397 observations (episodes) created)
(covid_death: 3397 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    176,034  total observations
          0  exclusions
------------------------------------------------------------------------------
    176,034  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(172,637 observations deleted)
  135

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        453       68641           0      68641      68641
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(72,676 real changes made)
(24,104 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(25,003 real changes made, 25,003 to missing)
(81,497 real changes made, 81,497 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(70,916 observations (episodes) created)
(covid_death: 70916 changes made)
(3,397 observations (episodes) created)
(covid_death: 3397 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    176,034  total observations
          0  exclusions
------------------------------------------------------------------------------
    176,034  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(74,313 observations deleted)
  23

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        188       18332           0      18332      18332
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(72,676 real changes made)
(24,104 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(25,003 real changes made, 25,003 to missing)
(81,497 real changes made, 81,497 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(70,916 observations (episodes) created)
(covid_death: 70916 changes made)
(3,397 observations (episodes) created)
(covid_death: 3397 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    176,034  total observations
          0  exclusions
------------------------------------------------------------------------------
    176,034  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(105,118 observations deleted)
  29

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        138       13861           0      13861      13861
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(72,676 real changes made)
(24,104 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(25,003 real changes made, 25,003 to missing)
(81,497 real changes made, 81,497 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(70,916 observations (episodes) created)
(covid_death: 70916 changes made)
(3,397 observations (episodes) created)
(covid_death: 3397 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    176,034  total observations
          0  exclusions
------------------------------------------------------------------------------
    176,034  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(172,637 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         45        2151           0       2151       2151
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(72,676 real changes made)
(24,104 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(25,003 real changes made, 25,003 to missing)
(81,497 real changes made, 81,497 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(70,916 observations (episodes) created)
(covid_death: 70916 changes made)
(3,397 observations (episodes) created)
(covid_death: 3397 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    176,034  total observations
          0  exclusions
------------------------------------------------------------------------------
    176,034  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(74,313 observations deleted)
  10,030

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    100,324     9484772           0    9484772    9484772
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(72,676 real changes made)
(24,104 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(25,003 real changes made, 25,003 to missing)
(81,497 real changes made, 81,497 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(70,916 observations (episodes) created)
(covid_death: 70916 changes made)
(3,397 observations (episodes) created)
(covid_death: 3397 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    176,034  total observations
          0  exclusions
------------------------------------------------------------------------------
    176,034  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(105,118 observations deleted)
  6,395

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     69,817     5581792           0    5581792    5581792
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(72,676 real changes made)
(24,104 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(25,003 real changes made, 25,003 to missing)
(81,497 real changes made, 81,497 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(70,916 observations (episodes) created)
(covid_death: 70916 changes made)
(3,397 observations (episodes) created)
(covid_death: 3397 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    176,034  total observations
          0  exclusions
------------------------------------------------------------------------------
    176,034  observations remaining, representing
    101,721  subjects
     17,083  failures in single-failure-per-subject data
   15503440  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(172,637 observations deleted)
  111

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      2,723       63773           0      63773      63773
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(20,498 real changes made)
(6,792 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(6,997 real changes made, 6,997 to missing)
(22,999 real changes made, 22,999 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,048 observations (episodes) created)
(covid_death: 20048 changes made)
(916 observations (episodes) created)
(covid_death: 916 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     49,701  total observations
          0  exclusions
------------------------------------------------------------------------------
     49,701  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,964 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         83        8638           0       8638       8638
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(20,498 real changes made)
(6,792 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(6,997 real changes made, 6,997 to missing)
(22,999 real changes made, 22,999 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,048 observations (episodes) created)
(covid_death: 20048 changes made)
(916 observations (episodes) created)
(covid_death: 916 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     49,701  total observations
          0  exclusions
------------------------------------------------------------------------------
     49,701  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(29,653 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         66        8974           0       8974       8974
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(20,498 real changes made)
(6,792 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(6,997 real changes made, 6,997 to missing)
(22,999 real changes made, 22,999 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,048 observations (episodes) created)
(covid_death: 20048 changes made)
(916 observations (episodes) created)
(covid_death: 916 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     49,701  total observations
          0  exclusions
------------------------------------------------------------------------------
     49,701  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(48,785 observations deleted)
  13

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         40        6125           0       6125       6125
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(20,498 real changes made)
(6,792 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(6,997 real changes made, 6,997 to missing)
(22,999 real changes made, 22,999 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,048 observations (episodes) created)
(covid_death: 20048 changes made)
(916 observations (episodes) created)
(covid_death: 916 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     49,701  total observations
          0  exclusions
------------------------------------------------------------------------------
     49,701  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,964 observations deleted)
  32

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        254       25581           0      25581      25581
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(20,498 real changes made)
(6,792 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(6,997 real changes made, 6,997 to missing)
(22,999 real changes made, 22,999 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,048 observations (episodes) created)
(covid_death: 20048 changes made)
(916 observations (episodes) created)
(covid_death: 916 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     49,701  total observations
          0  exclusions
------------------------------------------------------------------------------
     49,701  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(29,653 observations deleted)
  31

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        199       24706           0      24706      24706
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(20,498 real changes made)
(6,792 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(6,997 real changes made, 6,997 to missing)
(22,999 real changes made, 22,999 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,048 observations (episodes) created)
(covid_death: 20048 changes made)
(916 observations (episodes) created)
(covid_death: 916 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     49,701  total observations
          0  exclusions
------------------------------------------------------------------------------
     49,701  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(48,785 observations deleted)
  33

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        124       18766           0      18766      18766
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(20,498 real changes made)
(6,792 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(6,997 real changes made, 6,997 to missing)
(22,999 real changes made, 22,999 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,048 observations (episodes) created)
(covid_death: 20048 changes made)
(916 observations (episodes) created)
(covid_death: 916 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     49,701  total observations
          0  exclusions
------------------------------------------------------------------------------
     49,701  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,964 observations deleted)
  10

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         57        5171           0       5171       5171
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(20,498 real changes made)
(6,792 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(6,997 real changes made, 6,997 to missing)
(22,999 real changes made, 22,999 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,048 observations (episodes) created)
(covid_death: 20048 changes made)
(916 observations (episodes) created)
(covid_death: 916 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     49,701  total observations
          0  exclusions
------------------------------------------------------------------------------
     49,701  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(29,653 observations deleted)
  8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         41        3888           0       3888       3888
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(20,498 real changes made)
(6,792 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(6,997 real changes made, 6,997 to missing)
(22,999 real changes made, 22,999 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,048 observations (episodes) created)
(covid_death: 20048 changes made)
(916 observations (episodes) created)
(covid_death: 916 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     49,701  total observations
          0  exclusions
------------------------------------------------------------------------------
     49,701  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(48,785 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         12         508           0        508        508
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(20,498 real changes made)
(6,792 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(6,997 real changes made, 6,997 to missing)
(22,999 real changes made, 22,999 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,048 observations (episodes) created)
(covid_death: 20048 changes made)
(916 observations (episodes) created)
(covid_death: 916 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     49,701  total observations
          0  exclusions
------------------------------------------------------------------------------
     49,701  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,964 observations deleted)
  2,858

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     28,343     2677451           0    2677451    2677451
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(20,498 real changes made)
(6,792 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(6,997 real changes made, 6,997 to missing)
(22,999 real changes made, 22,999 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,048 observations (episodes) created)
(covid_death: 20048 changes made)
(916 observations (episodes) created)
(covid_death: 916 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     49,701  total observations
          0  exclusions
------------------------------------------------------------------------------
     49,701  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(29,653 observations deleted)
  1,876

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     19,742     1579620           0    1579620    1579620
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(20,498 real changes made)
(6,792 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(6,997 real changes made, 6,997 to missing)
(22,999 real changes made, 22,999 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(20,048 observations (episodes) created)
(covid_death: 20048 changes made)
(916 observations (episodes) created)
(covid_death: 916 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     49,701  total observations
          0  exclusions
------------------------------------------------------------------------------
     49,701  observations remaining, representing
     28,737  subjects
      4,909  failures in single-failure-per-subject data
  4,376,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(48,785 observations deleted)
  27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        740       16969           0      16969      16969
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

. file write tablecontents_int _n

. 
. file close tablecontents_int

. 
. postclose HRestimates_int

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_death_vac
> cine_stratified.log
  log type:  text
 closed on:  15 Mar 2023, 14:51:06
-------------------------------------------------------------------------------
