-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covidadmission_
> vaccine_stratified.log
  log type:  text
 opened on:  15 Mar 2023, 14:46:38

. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents_int ("age") _tab ("exposure") _tab ("exposure lev
> el") ///
> _tab ("outcome") _tab ("int_type") _tab ("int_level") ///
> _tab ("events") _tab ("person_years") _tab ("rate") ///
> _tab ("HR")  _tab ("lci")  _tab ("uci") _tab ("pval") _n
  3. foreach x in 0 1 {
  4. forvalues i=`min'/`max'{
  5. foreach int_type in vaccine {
  6. 
. foreach int_level in  1 2 3 {
  7. 
. local endwith "_tab"
  8. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_int ("`x'") _tab ("`variable'") _tab ("`i'")
>  _tab ("`outcome'") _tab ("`int_type'") _tab ("`int_level'") _tab
  9.  
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
 10. 
. replace covid_vacc_second_dose_date=. if covid_vacc_date>=covid_vacc_second_d
> ose_date
 11. replace covid_vacc_second_dose_date=. if covid_vacc_date==. 
 12. drop if covid_vacc_date<d(20dec2020)
 13. drop if covid_vacc_second_dose_date<d(20dec2020)
 14. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
 15. replace `outcome'=0 if stime_`outcome'<date_`outcome'
 16. *Drop those without any eligible follow-up
. drop if enter_date>=stime_`outcome'
 17. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 18. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 19. format first_vacc_plus_7d second_vacc_plus_7d %td
 20. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 21. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 22. 
. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 23. 
. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 24. recode `outcome' .=0 
 25. stsplit split2, after(second_vacc_plus_7d) at(0)
 26. recode `outcome' .=0 
 27. 
. stset
 28. bysort patient_id (_t): gen vaccine=_n
 29. 
.         keep if vaccine==`int_level'
 30. *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 31.         local event = r(N)
 32.         gen fup=_t-_t0
 33.     bysort `variable': egen total_follow_up = total(fup)
 34.         su total_follow_up if `variable' == `i'
 35.         local person_days = r(mean)
 36.         local person_years=`person_days'/365.25
 37.         local rate = 100000*(`event'/`person_years')
 38.         
.         file write tablecontents_int (`event') _tab %10.0f (`person_years') _
> tab %3.2f (`rate') _tab
 39.         drop total_follow_up
 40.  
.         foreach modeltype of any fulladj {
 41. 
.                 local noestimatesflag 0 /*reset*/
 42. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 43. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 44.                                 cap estimates use ./output/an_interaction_
> cox_models_`outcome'_kids_cat4_`int_type'_`x'
 45.                                 if _rc!=0 local noestimatesflag 1
 46.                                 }
 47.                                 di "`noestimatesflag'"
 48.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0{
 49.                         if `int_level'==1 {
 50.                             
.                         local pval=r(p)
 51.                         cap lincom 1.vaccine +1.vaccine#`i'.`variable', ef
> orm
 52.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab %4.2f (`pval') `endwith'
 53. 
.                                 else file write tablecontents_int %4.2f ("ERR
>  IN MODEL") `endwith'
 54.                                 }
 55.                         if `int_level'==2 {
 56.                         cap lincom 2.vaccine +2.vaccine#`i'.`variable', ef
> orm
 57.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 58.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 59.                                 }
 60.                         
.                         if `int_level'==3 {
 61.                         cap lincom 3.vaccine +3.vaccine#`i'.`variable', ef
> orm
 62.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 63.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 64.                                 }
 65.                         }
 66.                         
.                         else file write tablecontents_int %4.2f ("DID NOT FIT
> ") `endwith'
 67. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 68.                         if "`modeltype'"=="fulladj" {
 69.                                 local hr = r(estimate)
 70.                                 local lb = r(lb)
 71.                                 local ub = r(ub)
 72.                                 cap gen `variable'=.
 73.                                 test 1.`int_type'#2.`variable' 1.`int_type
> '#1.`variable'
 74.                                 local pval=r(p)
 75.                                 post HRestimates_int ("`x'") ("`outcome'")
>  ("`variable'") ("`int_type'") (`i') (`int_level') (`hr') (`lb') (`ub') (`pva
> l')
 76.                                 drop `variable'
 77.                                 }
 78.                 }
 79.                 }
 80.                 } /*int_level*/
 81.                 } /*full adj*/
 82. 
. } /*variable levels*/
 83. }
 84. end

. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. cap file close tablecontents_int

. file open tablecontents_int using ./output/11_an_int_tab_contents_HRtable_`ou
> tcome'_vaccine_stratified.txt, t w replace
(note: file ./output/11_an_int_tab_contents_HRtable_covidadmission_vaccine_stra
> tified.txt not found)

. 
. tempfile HRestimates_int

. cap postutil clear

. postfile HRestimates_int str10 x str10 outcome str27 variable str27 int_type 
> level int_level hr lci uci pval using `HRestimates_int'

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(59,374 real changes made)
(14,056 real changes made)
(130 observations deleted)
(5,299 missing values generated)
(16,586 missing values generated)
(31,302 real changes made, 31,302 to missing)
(82,130 real changes made, 82,130 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,603  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,603  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(64,512 observations (episodes) created)
(covidadmission: 64512 changes made)
(2,703 observations (episodes) created)
(covidadmission: 2703 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    168,818  total observations
          0  exclusions
------------------------------------------------------------------------------
    168,818  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(67,215 observations deleted)
  36

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        332       29419           0      29419      29419
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(59,374 real changes made)
(14,056 real changes made)
(130 observations deleted)
(5,299 missing values generated)
(16,586 missing values generated)
(31,302 real changes made, 31,302 to missing)
(82,130 real changes made, 82,130 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,603  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,603  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(64,512 observations (episodes) created)
(covidadmission: 64512 changes made)
(2,703 observations (episodes) created)
(covidadmission: 2703 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    168,818  total observations
          0  exclusions
------------------------------------------------------------------------------
    168,818  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(104,306 observations deleted)
  37

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        242       29709           0      29709      29709
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(59,374 real changes made)
(14,056 real changes made)
(130 observations deleted)
(5,299 missing values generated)
(16,586 missing values generated)
(31,302 real changes made, 31,302 to missing)
(82,130 real changes made, 82,130 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,603  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,603  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(64,512 observations (episodes) created)
(covidadmission: 64512 changes made)
(2,703 observations (episodes) created)
(covidadmission: 2703 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    168,818  total observations
          0  exclusions
------------------------------------------------------------------------------
    168,818  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(166,115 observations deleted)
  24

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        132       17987           0      17987      17987
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(59,374 real changes made)
(14,056 real changes made)
(130 observations deleted)
(5,299 missing values generated)
(16,586 missing values generated)
(31,302 real changes made, 31,302 to missing)
(82,130 real changes made, 82,130 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,603  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,603  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(64,512 observations (episodes) created)
(covidadmission: 64512 changes made)
(2,703 observations (episodes) created)
(covidadmission: 2703 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    168,818  total observations
          0  exclusions
------------------------------------------------------------------------------
    168,818  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(67,215 observations deleted)
  91

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        874       81899           0      81899      81899
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(59,374 real changes made)
(14,056 real changes made)
(130 observations deleted)
(5,299 missing values generated)
(16,586 missing values generated)
(31,302 real changes made, 31,302 to missing)
(82,130 real changes made, 82,130 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,603  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,603  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(64,512 observations (episodes) created)
(covidadmission: 64512 changes made)
(2,703 observations (episodes) created)
(covidadmission: 2703 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    168,818  total observations
          0  exclusions
------------------------------------------------------------------------------
    168,818  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(104,306 observations deleted)
  90

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        621       72477           0      72477      72477
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(59,374 real changes made)
(14,056 real changes made)
(130 observations deleted)
(5,299 missing values generated)
(16,586 missing values generated)
(31,302 real changes made, 31,302 to missing)
(82,130 real changes made, 82,130 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,603  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,603  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(64,512 observations (episodes) created)
(covidadmission: 64512 changes made)
(2,703 observations (episodes) created)
(covidadmission: 2703 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    168,818  total observations
          0  exclusions
------------------------------------------------------------------------------
    168,818  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(166,115 observations deleted)
  71

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        358       47756           0      47756      47756
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(59,374 real changes made)
(14,056 real changes made)
(130 observations deleted)
(5,299 missing values generated)
(16,586 missing values generated)
(31,302 real changes made, 31,302 to missing)
(82,130 real changes made, 82,130 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,603  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,603  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(64,512 observations (episodes) created)
(covidadmission: 64512 changes made)
(2,703 observations (episodes) created)
(covidadmission: 2703 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    168,818  total observations
          0  exclusions
------------------------------------------------------------------------------
    168,818  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(67,215 observations deleted)
  12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        187       17475           0      17475      17475
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(59,374 real changes made)
(14,056 real changes made)
(130 observations deleted)
(5,299 missing values generated)
(16,586 missing values generated)
(31,302 real changes made, 31,302 to missing)
(82,130 real changes made, 82,130 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,603  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,603  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(64,512 observations (episodes) created)
(covidadmission: 64512 changes made)
(2,703 observations (episodes) created)
(covidadmission: 2703 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    168,818  total observations
          0  exclusions
------------------------------------------------------------------------------
    168,818  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(104,306 observations deleted)
  19

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        128       11480           0      11480      11480
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(59,374 real changes made)
(14,056 real changes made)
(130 observations deleted)
(5,299 missing values generated)
(16,586 missing values generated)
(31,302 real changes made, 31,302 to missing)
(82,130 real changes made, 82,130 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,603  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,603  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(64,512 observations (episodes) created)
(covidadmission: 64512 changes made)
(2,703 observations (episodes) created)
(covidadmission: 2703 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    168,818  total observations
          0  exclusions
------------------------------------------------------------------------------
    168,818  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(166,115 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         32        1288           0       1288       1288
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(59,374 real changes made)
(14,056 real changes made)
(130 observations deleted)
(5,299 missing values generated)
(16,586 missing values generated)
(31,302 real changes made, 31,302 to missing)
(82,130 real changes made, 82,130 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,603  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,603  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(64,512 observations (episodes) created)
(covidadmission: 64512 changes made)
(2,703 observations (episodes) created)
(covidadmission: 2703 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    168,818  total observations
          0  exclusions
------------------------------------------------------------------------------
    168,818  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(67,215 observations deleted)
  9,937

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    100,210     8854584           0    8854584    8854584
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(59,374 real changes made)
(14,056 real changes made)
(130 observations deleted)
(5,299 missing values generated)
(16,586 missing values generated)
(31,302 real changes made, 31,302 to missing)
(82,130 real changes made, 82,130 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,603  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,603  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(64,512 observations (episodes) created)
(covidadmission: 64512 changes made)
(2,703 observations (episodes) created)
(covidadmission: 2703 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    168,818  total observations
          0  exclusions
------------------------------------------------------------------------------
    168,818  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(104,306 observations deleted)
  5,872

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     63,521     4896703           0    4896703    4896703
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(59,374 real changes made)
(14,056 real changes made)
(130 observations deleted)
(5,299 missing values generated)
(16,586 missing values generated)
(31,302 real changes made, 31,302 to missing)
(82,130 real changes made, 82,130 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,603  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,603  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(64,512 observations (episodes) created)
(covidadmission: 64512 changes made)
(2,703 observations (episodes) created)
(covidadmission: 2703 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    168,818  total observations
          0  exclusions
------------------------------------------------------------------------------
    168,818  observations remaining, representing
    101,603  subjects
     16,239  failures in single-failure-per-subject data
   14107619  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(166,115 observations deleted)
  50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      2,181       46842           0      46842      46842
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(16,942 real changes made)
(4,051 real changes made)
(26 observations deleted)
(1,543 missing values generated)
(4,758 missing values generated)
(8,723 real changes made, 8,723 to missing)
(23,176 real changes made, 23,176 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,715  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,715  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(18,303 observations (episodes) created)
(covidadmission: 18303 changes made)
(732 observations (episodes) created)
(covidadmission: 732 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     47,750  total observations
          0  exclusions
------------------------------------------------------------------------------
     47,750  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(19,035 observations deleted)
  8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         83        8326           0       8326       8326
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(16,942 real changes made)
(4,051 real changes made)
(26 observations deleted)
(1,543 missing values generated)
(4,758 missing values generated)
(8,723 real changes made, 8,723 to missing)
(23,176 real changes made, 23,176 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,715  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,715  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(18,303 observations (episodes) created)
(covidadmission: 18303 changes made)
(732 observations (episodes) created)
(covidadmission: 732 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     47,750  total observations
          0  exclusions
------------------------------------------------------------------------------
     47,750  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(29,447 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         61        6904           0       6904       6904
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(16,942 real changes made)
(4,051 real changes made)
(26 observations deleted)
(1,543 missing values generated)
(4,758 missing values generated)
(8,723 real changes made, 8,723 to missing)
(23,176 real changes made, 23,176 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,715  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,715  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(18,303 observations (episodes) created)
(covidadmission: 18303 changes made)
(732 observations (episodes) created)
(covidadmission: 732 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     47,750  total observations
          0  exclusions
------------------------------------------------------------------------------
     47,750  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(47,018 observations deleted)
  7

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         31        3946           0       3946       3946
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(16,942 real changes made)
(4,051 real changes made)
(26 observations deleted)
(1,543 missing values generated)
(4,758 missing values generated)
(8,723 real changes made, 8,723 to missing)
(23,176 real changes made, 23,176 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,715  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,715  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(18,303 observations (episodes) created)
(covidadmission: 18303 changes made)
(732 observations (episodes) created)
(covidadmission: 732 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     47,750  total observations
          0  exclusions
------------------------------------------------------------------------------
     47,750  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(19,035 observations deleted)
  34

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        254       22941           0      22941      22941
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(16,942 real changes made)
(4,051 real changes made)
(26 observations deleted)
(1,543 missing values generated)
(4,758 missing values generated)
(8,723 real changes made, 8,723 to missing)
(23,176 real changes made, 23,176 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,715  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,715  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(18,303 observations (episodes) created)
(covidadmission: 18303 changes made)
(732 observations (episodes) created)
(covidadmission: 732 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     47,750  total observations
          0  exclusions
------------------------------------------------------------------------------
     47,750  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(29,447 observations deleted)
  26

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        174       19353           0      19353      19353
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(16,942 real changes made)
(4,051 real changes made)
(26 observations deleted)
(1,543 missing values generated)
(4,758 missing values generated)
(8,723 real changes made, 8,723 to missing)
(23,176 real changes made, 23,176 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,715  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,715  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(18,303 observations (episodes) created)
(covidadmission: 18303 changes made)
(732 observations (episodes) created)
(covidadmission: 732 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     47,750  total observations
          0  exclusions
------------------------------------------------------------------------------
     47,750  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(47,018 observations deleted)
  19

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         91       12575           0      12575      12575
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(16,942 real changes made)
(4,051 real changes made)
(26 observations deleted)
(1,543 missing values generated)
(4,758 missing values generated)
(8,723 real changes made, 8,723 to missing)
(23,176 real changes made, 23,176 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,715  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,715  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(18,303 observations (episodes) created)
(covidadmission: 18303 changes made)
(732 observations (episodes) created)
(covidadmission: 732 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     47,750  total observations
          0  exclusions
------------------------------------------------------------------------------
     47,750  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(19,035 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         57        4877           0       4877       4877
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(16,942 real changes made)
(4,051 real changes made)
(26 observations deleted)
(1,543 missing values generated)
(4,758 missing values generated)
(8,723 real changes made, 8,723 to missing)
(23,176 real changes made, 23,176 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,715  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,715  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(18,303 observations (episodes) created)
(covidadmission: 18303 changes made)
(732 observations (episodes) created)
(covidadmission: 732 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     47,750  total observations
          0  exclusions
------------------------------------------------------------------------------
     47,750  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(29,447 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         37        3409           0       3409       3409
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(16,942 real changes made)
(4,051 real changes made)
(26 observations deleted)
(1,543 missing values generated)
(4,758 missing values generated)
(8,723 real changes made, 8,723 to missing)
(23,176 real changes made, 23,176 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,715  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,715  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(18,303 observations (episodes) created)
(covidadmission: 18303 changes made)
(732 observations (episodes) created)
(covidadmission: 732 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     47,750  total observations
          0  exclusions
------------------------------------------------------------------------------
     47,750  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(47,018 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          8         378           0        378        378
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(16,942 real changes made)
(4,051 real changes made)
(26 observations deleted)
(1,543 missing values generated)
(4,758 missing values generated)
(8,723 real changes made, 8,723 to missing)
(23,176 real changes made, 23,176 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,715  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,715  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(18,303 observations (episodes) created)
(covidadmission: 18303 changes made)
(732 observations (episodes) created)
(covidadmission: 732 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     47,750  total observations
          0  exclusions
------------------------------------------------------------------------------
     47,750  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(19,035 observations deleted)
  2,663

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     28,321     2507987           0    2507987    2507987
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(16,942 real changes made)
(4,051 real changes made)
(26 observations deleted)
(1,543 missing values generated)
(4,758 missing values generated)
(8,723 real changes made, 8,723 to missing)
(23,176 real changes made, 23,176 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,715  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,715  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(18,303 observations (episodes) created)
(covidadmission: 18303 changes made)
(732 observations (episodes) created)
(covidadmission: 732 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     47,750  total observations
          0  exclusions
------------------------------------------------------------------------------
     47,750  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(29,447 observations deleted)
  1,590

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     18,031     1399636           0    1399636    1399636
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(16,942 real changes made)
(4,051 real changes made)
(26 observations deleted)
(1,543 missing values generated)
(4,758 missing values generated)
(8,723 real changes made, 8,723 to missing)
(23,176 real changes made, 23,176 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,715  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,715  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(18,303 observations (episodes) created)
(covidadmission: 18303 changes made)
(732 observations (episodes) created)
(covidadmission: 732 changes made)
-> stset stime_covidadmission, id(patient_id) failure(covidadmission)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     47,750  total observations
          0  exclusions
------------------------------------------------------------------------------
     47,750  observations remaining, representing
     28,715  subjects
      4,385  failures in single-failure-per-subject data
  4,002,621  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(47,018 observations deleted)
  18

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        602       12289           0      12289      12289
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

. file write tablecontents_int _n

. 
. file close tablecontents_int

. 
. postclose HRestimates_int

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covidadmission_
> vaccine_stratified.log
  log type:  text
 closed on:  15 Mar 2023, 14:48:32
-------------------------------------------------------------------------------
