-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_tpp_prob_
> vaccine_stratified.log
  log type:  text
 opened on:  15 Mar 2023, 14:44:08

. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents_int ("age") _tab ("exposure") _tab ("exposure lev
> el") ///
> _tab ("outcome") _tab ("int_type") _tab ("int_level") ///
> _tab ("events") _tab ("person_years") _tab ("rate") ///
> _tab ("HR")  _tab ("lci")  _tab ("uci") _tab ("pval") _n
  3. foreach x in 0 1 {
  4. forvalues i=`min'/`max'{
  5. foreach int_type in vaccine {
  6. 
. foreach int_level in  1 2 3 {
  7. 
. local endwith "_tab"
  8. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_int ("`x'") _tab ("`variable'") _tab ("`i'")
>  _tab ("`outcome'") _tab ("`int_type'") _tab ("`int_level'") _tab
  9.  
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
 10. 
. replace covid_vacc_second_dose_date=. if covid_vacc_date>=covid_vacc_second_d
> ose_date
 11. replace covid_vacc_second_dose_date=. if covid_vacc_date==. 
 12. drop if covid_vacc_date<d(20dec2020)
 13. drop if covid_vacc_second_dose_date<d(20dec2020)
 14. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
 15. replace `outcome'=0 if stime_`outcome'<date_`outcome'
 16. *Drop those without any eligible follow-up
. drop if enter_date>=stime_`outcome'
 17. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 18. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 19. format first_vacc_plus_7d second_vacc_plus_7d %td
 20. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 21. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 22. 
. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 23. 
. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 24. recode `outcome' .=0 
 25. stsplit split2, after(second_vacc_plus_7d) at(0)
 26. recode `outcome' .=0 
 27. 
. stset
 28. bysort patient_id (_t): gen vaccine=_n
 29. 
.         keep if vaccine==`int_level'
 30. *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 31.         local event = r(N)
 32.         gen fup=_t-_t0
 33.     bysort `variable': egen total_follow_up = total(fup)
 34.         su total_follow_up if `variable' == `i'
 35.         local person_days = r(mean)
 36.         local person_years=`person_days'/365.25
 37.         local rate = 100000*(`event'/`person_years')
 38.         
.         file write tablecontents_int (`event') _tab %10.0f (`person_years') _
> tab %3.2f (`rate') _tab
 39.         drop total_follow_up
 40.  
.         foreach modeltype of any fulladj {
 41. 
.                 local noestimatesflag 0 /*reset*/
 42. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 43. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 44.                                 cap estimates use ./output/an_interaction_
> cox_models_`outcome'_kids_cat4_`int_type'_`x'
 45.                                 if _rc!=0 local noestimatesflag 1
 46.                                 }
 47.                                 di "`noestimatesflag'"
 48.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0{
 49.                         if `int_level'==1 {
 50.                             
.                         local pval=r(p)
 51.                         cap lincom 1.vaccine +1.vaccine#`i'.`variable', ef
> orm
 52.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab %4.2f (`pval') `endwith'
 53. 
.                                 else file write tablecontents_int %4.2f ("ERR
>  IN MODEL") `endwith'
 54.                                 }
 55.                         if `int_level'==2 {
 56.                         cap lincom 2.vaccine +2.vaccine#`i'.`variable', ef
> orm
 57.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 58.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 59.                                 }
 60.                         
.                         if `int_level'==3 {
 61.                         cap lincom 3.vaccine +3.vaccine#`i'.`variable', ef
> orm
 62.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 63.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 64.                                 }
 65.                         }
 66.                         
.                         else file write tablecontents_int %4.2f ("DID NOT FIT
> ") `endwith'
 67. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 68.                         if "`modeltype'"=="fulladj" {
 69.                                 local hr = r(estimate)
 70.                                 local lb = r(lb)
 71.                                 local ub = r(ub)
 72.                                 cap gen `variable'=.
 73.                                 test 1.`int_type'#2.`variable' 1.`int_type
> '#1.`variable'
 74.                                 local pval=r(p)
 75.                                 post HRestimates_int ("`x'") ("`outcome'")
>  ("`variable'") ("`int_type'") (`i') (`int_level') (`hr') (`lb') (`ub') (`pva
> l')
 76.                                 drop `variable'
 77.                                 }
 78.                 }
 79.                 }
 80.                 } /*int_level*/
 81.                 } /*full adj*/
 82. 
. } /*variable levels*/
 83. }
 84. end

. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. cap file close tablecontents_int

. file open tablecontents_int using ./output/11_an_int_tab_contents_HRtable_`ou
> tcome'_vaccine_stratified.txt, t w replace
(note: file ./output/11_an_int_tab_contents_HRtable_covid_tpp_prob_vaccine_stra
> tified.txt not found)

. 
. tempfile HRestimates_int

. cap postutil clear

. postfile HRestimates_int str10 x str10 outcome str27 variable str27 int_type 
> level int_level hr lci uci pval using `HRestimates_int'

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(49,212 real changes made)
(52,667 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(36,475 real changes made, 36,475 to missing)
(82,806 real changes made, 82,806 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(59,411 observations (episodes) created)
(covid_tpp_prob: 59411 changes made)
(2,151 observations (episodes) created)
(covid_tpp_prob: 2151 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    163,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    163,283  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(61,562 observations deleted)
  60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        334       27968           0      27968      27968
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(49,212 real changes made)
(52,667 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(36,475 real changes made, 36,475 to missing)
(82,806 real changes made, 82,806 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(59,411 observations (episodes) created)
(covid_tpp_prob: 59411 changes made)
(2,151 observations (episodes) created)
(covid_tpp_prob: 2151 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    163,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    163,283  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(103,872 observations deleted)
  63

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        224       23349           0      23349      23349
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(49,212 real changes made)
(52,667 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(36,475 real changes made, 36,475 to missing)
(82,806 real changes made, 82,806 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(59,411 observations (episodes) created)
(covid_tpp_prob: 59411 changes made)
(2,151 observations (episodes) created)
(covid_tpp_prob: 2151 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    163,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    163,283  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(161,132 observations deleted)
  57

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        104       10402           0      10402      10402
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(49,212 real changes made)
(52,667 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(36,475 real changes made, 36,475 to missing)
(82,806 real changes made, 82,806 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(59,411 observations (episodes) created)
(covid_tpp_prob: 59411 changes made)
(2,151 observations (episodes) created)
(covid_tpp_prob: 2151 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    163,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    163,283  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(61,562 observations deleted)
  163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        875       77166           0      77166      77166
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(49,212 real changes made)
(52,667 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(36,475 real changes made, 36,475 to missing)
(82,806 real changes made, 82,806 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(59,411 observations (episodes) created)
(covid_tpp_prob: 59411 changes made)
(2,151 observations (episodes) created)
(covid_tpp_prob: 2151 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    163,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    163,283  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(103,872 observations deleted)
  169

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        573       60768           0      60768      60768
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(49,212 real changes made)
(52,667 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(36,475 real changes made, 36,475 to missing)
(82,806 real changes made, 82,806 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(59,411 observations (episodes) created)
(covid_tpp_prob: 59411 changes made)
(2,151 observations (episodes) created)
(covid_tpp_prob: 2151 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    163,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    163,283  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(161,132 observations deleted)
  134

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        263       27537           0      27537      27537
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(49,212 real changes made)
(52,667 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(36,475 real changes made, 36,475 to missing)
(82,806 real changes made, 82,806 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(59,411 observations (episodes) created)
(covid_tpp_prob: 59411 changes made)
(2,151 observations (episodes) created)
(covid_tpp_prob: 2151 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    163,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    163,283  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(61,562 observations deleted)
  30

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        188       16525           0      16525      16525
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(49,212 real changes made)
(52,667 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(36,475 real changes made, 36,475 to missing)
(82,806 real changes made, 82,806 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(59,411 observations (episodes) created)
(covid_tpp_prob: 59411 changes made)
(2,151 observations (episodes) created)
(covid_tpp_prob: 2151 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    163,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    163,283  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(103,872 observations deleted)
  25

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        116       10335           0      10335      10335
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(49,212 real changes made)
(52,667 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(36,475 real changes made, 36,475 to missing)
(82,806 real changes made, 82,806 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(59,411 observations (episodes) created)
(covid_tpp_prob: 59411 changes made)
(2,151 observations (episodes) created)
(covid_tpp_prob: 2151 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    163,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    163,283  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(161,132 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         29        1364           0       1364       1364
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(49,212 real changes made)
(52,667 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(36,475 real changes made, 36,475 to missing)
(82,806 real changes made, 82,806 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(59,411 observations (episodes) created)
(covid_tpp_prob: 59411 changes made)
(2,151 observations (episodes) created)
(covid_tpp_prob: 2151 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    163,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    163,283  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(61,562 observations deleted)
  17,676

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    100,324     8378083           0    8378083    8378083
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(49,212 real changes made)
(52,667 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(36,475 real changes made, 36,475 to missing)
(82,806 real changes made, 82,806 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(59,411 observations (episodes) created)
(covid_tpp_prob: 59411 changes made)
(2,151 observations (episodes) created)
(covid_tpp_prob: 2151 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    163,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    163,283  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(103,872 observations deleted)
  10,281

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     58,498     4382631           0    4382631    4382631
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(49,212 real changes made)
(52,667 real changes made)
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(36,475 real changes made, 36,475 to missing)
(82,806 real changes made, 82,806 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,721  total observations
          0  exclusions
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(59,411 observations (episodes) created)
(covid_tpp_prob: 59411 changes made)
(2,151 observations (episodes) created)
(covid_tpp_prob: 2151 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    163,283  total observations
          0  exclusions
------------------------------------------------------------------------------
    163,283  observations remaining, representing
    101,721  subjects
     28,779  failures in single-failure-per-subject data
   13051954  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(161,132 observations deleted)
  119

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,755       35826           0      35826      35826
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(13,827 real changes made)
(14,840 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(10,177 real changes made, 10,177 to missing)
(23,363 real changes made, 23,363 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(16,876 observations (episodes) created)
(covid_tpp_prob: 16876 changes made)
(570 observations (episodes) created)
(covid_tpp_prob: 570 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     46,183  total observations
          0  exclusions
------------------------------------------------------------------------------
     46,183  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(17,446 observations deleted)
  21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         83        6650           0       6650       6650
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(13,827 real changes made)
(14,840 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(10,177 real changes made, 10,177 to missing)
(23,363 real changes made, 23,363 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(16,876 observations (episodes) created)
(covid_tpp_prob: 16876 changes made)
(570 observations (episodes) created)
(covid_tpp_prob: 570 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     46,183  total observations
          0  exclusions
------------------------------------------------------------------------------
     46,183  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(29,307 observations deleted)
  24

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         49        5571           0       5571       5571
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(13,827 real changes made)
(14,840 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(10,177 real changes made, 10,177 to missing)
(23,363 real changes made, 23,363 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(16,876 observations (episodes) created)
(covid_tpp_prob: 16876 changes made)
(570 observations (episodes) created)
(covid_tpp_prob: 570 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     46,183  total observations
          0  exclusions
------------------------------------------------------------------------------
     46,183  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(45,613 observations deleted)
  13

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         17        1960           0       1960       1960
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(13,827 real changes made)
(14,840 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(10,177 real changes made, 10,177 to missing)
(23,363 real changes made, 23,363 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(16,876 observations (episodes) created)
(covid_tpp_prob: 16876 changes made)
(570 observations (episodes) created)
(covid_tpp_prob: 570 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     46,183  total observations
          0  exclusions
------------------------------------------------------------------------------
     46,183  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(17,446 observations deleted)
  51

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        254       21032           0      21032      21032
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(13,827 real changes made)
(14,840 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(10,177 real changes made, 10,177 to missing)
(23,363 real changes made, 23,363 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(16,876 observations (episodes) created)
(covid_tpp_prob: 16876 changes made)
(570 observations (episodes) created)
(covid_tpp_prob: 570 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     46,183  total observations
          0  exclusions
------------------------------------------------------------------------------
     46,183  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(29,307 observations deleted)
  59

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        163       16052           0      16052      16052
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(13,827 real changes made)
(14,840 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(10,177 real changes made, 10,177 to missing)
(23,363 real changes made, 23,363 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(16,876 observations (episodes) created)
(covid_tpp_prob: 16876 changes made)
(570 observations (episodes) created)
(covid_tpp_prob: 570 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     46,183  total observations
          0  exclusions
------------------------------------------------------------------------------
     46,183  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(45,613 observations deleted)
  24

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         65        7709           0       7709       7709
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(13,827 real changes made)
(14,840 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(10,177 real changes made, 10,177 to missing)
(23,363 real changes made, 23,363 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(16,876 observations (episodes) created)
(covid_tpp_prob: 16876 changes made)
(570 observations (episodes) created)
(covid_tpp_prob: 570 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     46,183  total observations
          0  exclusions
------------------------------------------------------------------------------
     46,183  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(17,446 observations deleted)
  10

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         57        4710           0       4710       4710
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(13,827 real changes made)
(14,840 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(10,177 real changes made, 10,177 to missing)
(23,363 real changes made, 23,363 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(16,876 observations (episodes) created)
(covid_tpp_prob: 16876 changes made)
(570 observations (episodes) created)
(covid_tpp_prob: 570 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     46,183  total observations
          0  exclusions
------------------------------------------------------------------------------
     46,183  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(29,307 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         33        3081           0       3081       3081
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(13,827 real changes made)
(14,840 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(10,177 real changes made, 10,177 to missing)
(23,363 real changes made, 23,363 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(16,876 observations (episodes) created)
(covid_tpp_prob: 16876 changes made)
(570 observations (episodes) created)
(covid_tpp_prob: 570 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     46,183  total observations
          0  exclusions
------------------------------------------------------------------------------
     46,183  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(45,613 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          9         440           0        440        440
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(13,827 real changes made)
(14,840 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(10,177 real changes made, 10,177 to missing)
(23,363 real changes made, 23,363 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(16,876 observations (episodes) created)
(covid_tpp_prob: 16876 changes made)
(570 observations (episodes) created)
(covid_tpp_prob: 570 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     46,183  total observations
          0  exclusions
------------------------------------------------------------------------------
     46,183  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(17,446 observations deleted)
  4,993

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     28,343     2365434           0    2365434    2365434
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(13,827 real changes made)
(14,840 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(10,177 real changes made, 10,177 to missing)
(23,363 real changes made, 23,363 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(16,876 observations (episodes) created)
(covid_tpp_prob: 16876 changes made)
(570 observations (episodes) created)
(covid_tpp_prob: 570 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     46,183  total observations
          0  exclusions
------------------------------------------------------------------------------
     46,183  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(29,307 observations deleted)
  3,011

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     16,631     1241223           0    1241223    1241223
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(13,827 real changes made)
(14,840 real changes made)
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(10,177 real changes made, 10,177 to missing)
(23,363 real changes made, 23,363 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,737  total observations
          0  exclusions
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(16,876 observations (episodes) created)
(covid_tpp_prob: 16876 changes made)
(570 observations (episodes) created)
(covid_tpp_prob: 570 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     46,183  total observations
          0  exclusions
------------------------------------------------------------------------------
     46,183  observations remaining, representing
     28,737  subjects
      8,247  failures in single-failure-per-subject data
  3,683,080  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(45,613 observations deleted)
  36

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        479        9218           0       9218       9218
0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

. file write tablecontents_int _n

. 
. file close tablecontents_int

. 
. postclose HRestimates_int

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_tpp_prob_
> vaccine_stratified.log
  log type:  text
 closed on:  15 Mar 2023, 14:45:50
-------------------------------------------------------------------------------
