-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_death.log
  log type:  text
 opened on:  15 Mar 2023, 14:42:34

. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents_int ("period") _tab ("age") _tab ("exposure") _ta
> b ("exposure level") ///
> _tab ("outcome") _tab ("int_type") _tab ("int_level") ///
> _tab ("HR")  _tab ("lci")  _tab ("uci") _tab ("pval") _n
  3. foreach period in 0 1 2 3 4   {
  4. foreach x in 0 1 {
  5. forvalues i=`min'/`max'{
  6. foreach int_type in male shield {
  7. 
. foreach int_level in 0 1 {
  8. 
. local endwith "_tab"
  9. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_int ("`period'") _tab ("`x'") _tab ("`variab
> le'") _tab ("`i'") _tab ("`outcome'") _tab ("`int_type'") _tab ("`int_level'"
> ) _tab
 10. 
.         foreach modeltype of any fulladj {
 11. 
.                 local noestimatesflag 0 /*reset*/
 12. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 13. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 14.                                 cap estimates use ./output/an_interaction_
> cox_models_`outcome'_kids_cat4_`int_type'_`x'_timeperiod`period'
 15.                                 if _rc!=0 local noestimatesflag 1
 16.                                 }
 17.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0{
 18.                         if `int_level'==0 {
 19.                         test 1.`int_type'#`i'.`variable'
 20.                         *overall p-value for interaction: test 1.`int_type
> '#1.`variable' test 1.`int_type'#2.`variable'
.                         local pval=r(p)
 21.                         cap lincom `i'.`variable', eform
 22.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab %4.2f (`pval') `endwith'
 23. 
.                                 else file write tablecontents_int %4.2f ("ERR
>  IN MODEL") `endwith'
 24.                                 }
 25.                         if `int_level'==1 {
 26.                         cap lincom `i'.`variable'+ 1.`int_type'#`i'.`varia
> ble', eform
 27.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 28.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 29.                                 }
 30.                         }
 31.                         else file write tablecontents_int %4.2f ("DID NOT 
> FIT") `endwith'
 32. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 33.                         if "`modeltype'"=="fulladj" {
 34.                                 local hr = r(estimate)
 35.                                 local lb = r(lb)
 36.                                 local ub = r(ub)
 37.                                 cap gen `variable'=.
 38.                                 test 1.`int_type'#2.`variable' 1.`int_type
> '#1.`variable'
 39.                                 local pval=r(p)
 40.                                 post HRestimates_int ("`period'") ("`x'") 
> ("`outcome'") ("`variable'") ("`int_type'") (`i') (`int_level') (`hr') (`lb')
>  (`ub') (`pval')
 41.                                 drop `variable'
 42.                                 }
 43.                 }
 44.                 }
 45.                 } /*int_level*/
 46.                 } /*full adj*/
 47. 
. } /*variable levels*/
 48. } /*agebands*/
 49. } /*datsets*/
 50. end

. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. cap file close tablecontents_int

. file open tablecontents_int using ./output/11_an_int_tab_contents_HRtable_`ou
> tcome'.txt, t w replace
(note: file ./output/11_an_int_tab_contents_HRtable_covid_death.txt not found)

. 
. tempfile HRestimates_int

. cap postutil clear

. postfile HRestimates_int str10 period str10 x str10 outcome str27 variable st
> r27 int_type level int_level hr lci uci pval using `HRestimates_int'

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.39
         Prob > chi2 =    0.8228

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.39
         Prob > chi2 =    0.8228

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.11
         Prob > chi2 =    0.3485

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.11
         Prob > chi2 =    0.3485

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.30
         Prob > chi2 =    0.5823

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.39
         Prob > chi2 =    0.8228

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.39
         Prob > chi2 =    0.8228

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    1.21
         Prob > chi2 =    0.2715

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.11
         Prob > chi2 =    0.3485

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.11
         Prob > chi2 =    0.3485

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9619

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.39
         Prob > chi2 =    0.8228

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.39
         Prob > chi2 =    0.8228

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    0.06
         Prob > chi2 =    0.8038

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.11
         Prob > chi2 =    0.3485

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.11
         Prob > chi2 =    0.3485

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9693

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.39
         Prob > chi2 =    0.8228

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.39
         Prob > chi2 =    0.8228

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    0.84
         Prob > chi2 =    0.3581

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.11
         Prob > chi2 =    0.3485

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.11
         Prob > chi2 =    0.3485

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.44
         Prob > chi2 =    0.8041

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.44
         Prob > chi2 =    0.8041

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.84
         Prob > chi2 =    0.6566

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.84
         Prob > chi2 =    0.6566

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.43
         Prob > chi2 =    0.5138

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.44
         Prob > chi2 =    0.8041

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.44
         Prob > chi2 =    0.8041

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    0.27
         Prob > chi2 =    0.6063

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.84
         Prob > chi2 =    0.6566

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.84
         Prob > chi2 =    0.6566

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.21
         Prob > chi2 =    0.6477

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.44
         Prob > chi2 =    0.8041

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.44
         Prob > chi2 =    0.8041

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    0.80
         Prob > chi2 =    0.3711

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.84
         Prob > chi2 =    0.6566

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.84
         Prob > chi2 =    0.6566

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9576

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.44
         Prob > chi2 =    0.8041

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.44
         Prob > chi2 =    0.8041

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    0.37
         Prob > chi2 =    0.5408

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.84
         Prob > chi2 =    0.6566

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.84
         Prob > chi2 =    0.6566

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.01
         Prob > chi2 =    0.9943

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.01
         Prob > chi2 =    0.9943

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.31
         Prob > chi2 =    0.5203

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.31
         Prob > chi2 =    0.5203

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9669

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.01
         Prob > chi2 =    0.9943

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.01
         Prob > chi2 =    0.9943

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    0.13
         Prob > chi2 =    0.7138

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.31
         Prob > chi2 =    0.5203

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.31
         Prob > chi2 =    0.5203

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.01
         Prob > chi2 =    0.9183

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.01
         Prob > chi2 =    0.9943

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.01
         Prob > chi2 =    0.9943

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    0.63
         Prob > chi2 =    0.4256

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.31
         Prob > chi2 =    0.5203

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.31
         Prob > chi2 =    0.5203

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9931

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.01
         Prob > chi2 =    0.9943

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.01
         Prob > chi2 =    0.9943

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9696

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.31
         Prob > chi2 =    0.5203

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.31
         Prob > chi2 =    0.5203

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7443

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7443

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.59
         Prob > chi2 =    0.4516

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.59
         Prob > chi2 =    0.4516

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.38
         Prob > chi2 =    0.5395

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7443

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7443

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    1.24
         Prob > chi2 =    0.2657

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.59
         Prob > chi2 =    0.4516

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.59
         Prob > chi2 =    0.4516

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9592

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7443

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7443

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    1.29
         Prob > chi2 =    0.2563

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.59
         Prob > chi2 =    0.4516

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.59
         Prob > chi2 =    0.4516

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.86
         Prob > chi2 =    0.3550

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7443

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7443

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    3.35
         Prob > chi2 =    0.0673

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.59
         Prob > chi2 =    0.4516

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.59
         Prob > chi2 =    0.4516

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.86
         Prob > chi2 =    0.6512

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.86
         Prob > chi2 =    0.6512

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    3.41
         Prob > chi2 =    0.0647

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    3.41
         Prob > chi2 =    0.0647

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.45
         Prob > chi2 =    0.5026

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.86
         Prob > chi2 =    0.6512

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.86
         Prob > chi2 =    0.6512

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    3.41
         Prob > chi2 =    0.0647

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    3.41
         Prob > chi2 =    0.0647

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    3.41
         Prob > chi2 =    0.0647

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.01
         Prob > chi2 =    0.9342

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.86
         Prob > chi2 =    0.6512

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.86
         Prob > chi2 =    0.6512

 ( 1)  1.shield#2.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    3.41
         Prob > chi2 =    0.0647

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    3.41
         Prob > chi2 =    0.0647

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.74
         Prob > chi2 =    0.3913

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.86
         Prob > chi2 =    0.6512

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.86
         Prob > chi2 =    0.6512

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    2.88
         Prob > chi2 =    0.0896

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    3.41
         Prob > chi2 =    0.0647

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    3.41
         Prob > chi2 =    0.0647

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.22
         Prob > chi2 =    0.8966

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.22
         Prob > chi2 =    0.8966

 ( 1)  1.male#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    0.22
         Prob > chi2 =    0.6419

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.22
         Prob > chi2 =    0.8966

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.22
         Prob > chi2 =    0.8966

 ( 1)  1.male#2.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    0.04
         Prob > chi2 =    0.8368

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.22
         Prob > chi2 =    0.8966

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.22
         Prob > chi2 =    0.8966

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) = 1174.28
         Prob > chi2 =    0.0000

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    0.26
         Prob > chi2 =    0.6088

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.22
         Prob > chi2 =    0.8966

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.22
         Prob > chi2 =    0.8966

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.68
         Prob > chi2 =    0.2622

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.68
         Prob > chi2 =    0.2622

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.98
         Prob > chi2 =    0.3723

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.98
         Prob > chi2 =    0.3723

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.95
         Prob > chi2 =    0.3309

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.68
         Prob > chi2 =    0.2622

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.68
         Prob > chi2 =    0.2622

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    1.47
         Prob > chi2 =    0.2261

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.98
         Prob > chi2 =    0.3723

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.98
         Prob > chi2 =    0.3723

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    2.68
         Prob > chi2 =    0.1019

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.68
         Prob > chi2 =    0.2622

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.68
         Prob > chi2 =    0.2622

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    0.17
         Prob > chi2 =    0.6827

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.98
         Prob > chi2 =    0.3723

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.98
         Prob > chi2 =    0.3723

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    1.08
         Prob > chi2 =    0.2978

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.68
         Prob > chi2 =    0.2622

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.68
         Prob > chi2 =    0.2622

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    0.76
         Prob > chi2 =    0.3845

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.98
         Prob > chi2 =    0.3723

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.98
         Prob > chi2 =    0.3723

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.48
         Prob > chi2 =    0.7854

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.48
         Prob > chi2 =    0.7854

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =  564.14
         Prob > chi2 =    0.0000

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =  564.14
         Prob > chi2 =    0.0000

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.37
         Prob > chi2 =    0.5436

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.48
         Prob > chi2 =    0.7854

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.48
         Prob > chi2 =    0.7854

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =  564.14
         Prob > chi2 =    0.0000

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =  564.14
         Prob > chi2 =    0.0000

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =  564.14
         Prob > chi2 =    0.0000

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.41
         Prob > chi2 =    0.5233

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.48
         Prob > chi2 =    0.7854

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.48
         Prob > chi2 =    0.7854

 ( 1)  1.shield#2.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =  564.14
         Prob > chi2 =    0.0000

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =  564.14
         Prob > chi2 =    0.0000

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.37
         Prob > chi2 =    0.5454

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.48
         Prob > chi2 =    0.7854

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.48
         Prob > chi2 =    0.7854

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =  327.10
         Prob > chi2 =    0.0000

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =  564.14
         Prob > chi2 =    0.0000

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =  564.14
         Prob > chi2 =    0.0000

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    7.58
         Prob > chi2 =    0.0226

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    7.58
         Prob > chi2 =    0.0226

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.01
         Prob > chi2 =    0.9361

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.01
         Prob > chi2 =    0.9361

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.29
         Prob > chi2 =    0.5900

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    7.58
         Prob > chi2 =    0.0226

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    7.58
         Prob > chi2 =    0.0226

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    0.01
         Prob > chi2 =    0.9361

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.01
         Prob > chi2 =    0.9361

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.01
         Prob > chi2 =    0.9361

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    7.55
         Prob > chi2 =    0.0060

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    7.58
         Prob > chi2 =    0.0226

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    7.58
         Prob > chi2 =    0.0226

 ( 1)  1.shield#2.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.01
         Prob > chi2 =    0.9361

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.01
         Prob > chi2 =    0.9361

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.53
         Prob > chi2 =    0.4667

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    7.58
         Prob > chi2 =    0.0226

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    7.58
         Prob > chi2 =    0.0226

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    0.17
         Prob > chi2 =    0.6795

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.01
         Prob > chi2 =    0.9361

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.01
         Prob > chi2 =    0.9361

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.14
         Prob > chi2 =    0.9340

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.14
         Prob > chi2 =    0.9340

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) = 1924.36
         Prob > chi2 =    0.0000

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) = 1924.36
         Prob > chi2 =    0.0000

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.12
         Prob > chi2 =    0.7307

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.14
         Prob > chi2 =    0.9340

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.14
         Prob > chi2 =    0.9340

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) = 1924.36
         Prob > chi2 =    0.0000

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) = 1924.36
         Prob > chi2 =    0.0000

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) = 1924.36
         Prob > chi2 =    0.0000

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.07
         Prob > chi2 =    0.7897

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.14
         Prob > chi2 =    0.9340

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.14
         Prob > chi2 =    0.9340

 ( 1)  1.shield#2.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) = 1924.36
         Prob > chi2 =    0.0000

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) = 1924.36
         Prob > chi2 =    0.0000

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.02
         Prob > chi2 =    0.8914

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.14
         Prob > chi2 =    0.9340

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.14
         Prob > chi2 =    0.9340

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    0.30
         Prob > chi2 =    0.5853

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) = 1924.36
         Prob > chi2 =    0.0000

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) = 1924.36
         Prob > chi2 =    0.0000

. file write tablecontents_int _n

. 
. file close tablecontents_int

. 
. postclose HRestimates_int

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_death.log
  log type:  text
 closed on:  15 Mar 2023, 14:42:36
-------------------------------------------------------------------------------
