-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11c_an_interaction_HR_tables_forest_covid_tpp_prob
> _vaccine_child_prevacc.log
  log type:  text
 opened on:  15 Mar 2023, 14:50:09

. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents_int ("age") _tab ("exposure") _tab ("exposure lev
> el") ///
> _tab ("outcome") _tab ("int_type") _tab ("int_level") ///
> _tab ("events") _tab ("person_years") _tab ("rate") ///
> _tab ("HR")  _tab ("lci")  _tab ("uci") _tab ("pval") _n
  3. foreach x in 0 1 {
  4. forvalues i=`min'/`max'{
  5. foreach int_type in vaccine {
  6. 
. foreach int_level in  1 2 3 4 {
  7. 
. local endwith "_tab"
  8. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_int ("`x'") _tab ("`variable'") _tab ("`i'")
>  _tab ("`outcome'") _tab ("`int_type'") _tab ("`int_level'") _tab
  9.  
.  use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", c
> lear
 10. 
. 
. replace covid_vacc_second_dose_date = . if ///
>         covid_vacc_date == . | ///
>         covid_vacc_date >= covid_vacc_second_dose_date
 11. replace covid_vacc_third_dose_date = . if ///
>         covid_vacc_date == . | ///
>         covid_vacc_second_dose_date == . | ///
>         covid_vacc_third_dose_date <= covid_vacc_second_dose_date | ///
>         covid_vacc_third_dose_date <= covid_vacc_date
 12. drop if covid_vacc_date<d(20dec2020)
 13. drop if covid_vacc_second_dose_date<d(20dec2020)
 14. drop if covid_vacc_third_dose_date<=d(20dec2020)
 15. 
. *Censor at date of all children aged 12-17 being vaccinated in hh
. replace stime_`outcome'         = all_under18vacc if stime_`outcome'>all_unde
> r18vacc
 16. replace `outcome'=0 if stime_`outcome'<date_`outcome'
 17. replace date_`outcome' = . if (date_`outcome' > stime_`outcome' )
 18. 
. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 19. 
. *Drop those without any eligible follow-up
. drop if enter_date>=stime_`outcome'
 20.         
. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 21. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 22. gen third_vacc_plus_7d = covid_vacc_third_dose_date+7
 23. format first_vacc_plus_7d second_vacc_plus_7d third_vacc_plus_7d %td
 24. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 25. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 26. replace third_vacc_plus_7d=. if third_vacc_plus_7d>=stime_`outcome'
 27. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 28. recode `outcome' .=0 
 29. stsplit split2, after(second_vacc_plus_7d) at(0)
 30. recode `outcome' .=0 
 31. stsplit split3, after(third_vacc_plus_7d) at(0)
 32. recode `outcome' .=0 
 33. 
. bysort patient_id: gen vaccine=_n
 34. tab vaccine, miss
 35.         
.         
.         keep if vaccine==`int_level'
 36. *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 37.         local event = r(N)
 38.         gen fup=_t-_t0
 39.     bysort `variable': egen total_follow_up = total(fup)
 40.         su total_follow_up if `variable' == `i'
 41.         local person_days = r(mean)
 42.         local person_years=`person_days'/365.25
 43.         local rate = 100000*(`event'/`person_years')
 44. 
.         file write tablecontents_int (`event') _tab %10.0f (`person_years') _
> tab %3.2f (`rate') _tab
 45.         
.         drop total_follow_up
 46.         foreach modeltype of any fulladj {
 47. 
.                 local noestimatesflag 0 /*reset*/
 48. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 49. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 50.                                 cap estimates use ./output/an_interaction_
> cox_models_`outcome'_kids_cat4_`int_type'_`x'_child_prevacc
 51.                                 if _rc!=0 local noestimatesflag 1
 52.                                 }
 53.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0{
 54.                         if `int_level'==1 {
 55.                         cap lincom 1.vaccine+`i'.`variable'+ 1.vaccine#`i'
> .`variable', eform                    
 56.                         local pval=r(p)
 57.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab %4.2f (`pval') `endwith'
 58.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 59.                                 }
 60.                         if `int_level'==2 {
 61.                         cap lincom 2.vaccine+`i'.`variable'+ 2.vaccine#`i'
> .`variable', eform
 62.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 63.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 64.                                 }
 65.                 
.                         if `int_level'==3 {
 66.                         cap lincom 3.vaccine+`i'.`variable'+ 3.vaccine#`i'
> .`variable', eform
 67.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 68.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 69.                                 }
 70.                                 
.                         if `int_level'==4 {
 71.                         cap lincom 4.vaccine+`i'.`variable'+ 4.vaccine#`i'
> .`variable', eform
 72.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 73.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 74.                                 }
 75.                         }
 76.                         
.                         else file write tablecontents_int %4.2f ("DID NOT FIT
> ") `endwith'
 77. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 78.                         if "`modeltype'"=="fulladj" {
 79.                                 local hr = r(estimate)
 80.                                 local lb = r(lb)
 81.                                 local ub = r(ub)
 82.                                 cap gen `variable'=.
 83.                                 test 1.`int_type'#2.`variable' 1.`int_type
> '#1.`variable'
 84.                                 local pval=r(p)
 85.                                 post HRestimates_int ("`x'") ("`outcome'")
>  ("`variable'") ("`int_type'") (`i') (`int_level') (`hr') (`lb') (`ub') (`pva
> l')
 86.                                 drop `variable'
 87.                                 }
 88.                 }
 89.                 }
 90.                 } /*int_level*/
 91.                 } /*full adj*/
 92. 
. } /*variable levels*/
 93. di "*****"
 94. 
. }
 95. end

. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. cap file close tablecontents_int

. file open tablecontents_int using ./output/11c_an_int_tab_contents_HRtable_`o
> utcome'_vaccine_child_prevacc.txt, t w replace
(note: file ./output/11c_an_int_tab_contents_HRtable_covid_tpp_prob_vaccine_chi
> ld_prevacc.txt not found)

. di "****"
****

. 
. 
. tempfile HRestimates_int

. cap postutil clear

. postfile HRestimates_int str10 x str10 outcome str27 variable str27 int_type 
> level int_level hr lci uci pval using `HRestimates_int'

. di "*****"
*****

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(104,667 observations deleted)
  60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        334       27968           0      27968      27968

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(140,584 observations deleted)
  63

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        224       23349           0      23349      23349

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(175,994 observations deleted)
  45

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        104        8094           0       8094       8094

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(197,919 observations deleted)
  12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         33        2308           0       2308       2308

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(104,667 observations deleted)
  163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        875       77166           0      77166      77166

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(140,584 observations deleted)
  169

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        573       60768           0      60768      60768

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(175,994 observations deleted)
  99

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        263       22701           0      22701      22701

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(197,919 observations deleted)
  35

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         73        4836           0       4836       4836

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(104,667 observations deleted)
  31

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        188       16764           0      16764      16764

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(140,584 observations deleted)
  27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        116       10710           0      10710      10710

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(175,994 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         35        2020           0       2020       2020

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(197,919 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          2         181           0        181        181

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(104,667 observations deleted)
  19,194

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    100,324     8794887           0    8794887    8794887

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(140,584 observations deleted)
  18,657

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     64,891     6940999           0    6940999    6940999

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(175,994 observations deleted)
  10,865

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     29,992     2587790           0    2587790    2587790

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(5,505 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2,738 real changes made)
(28,869 real changes made)
(28,869 real changes made, 28,869 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    101,733  total observations
         12  observations end on or before enter()
------------------------------------------------------------------------------
    101,721  observations remaining, representing
    101,721  subjects
     52,577  failures in single-failure-per-subject data
   19096536  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(12 observations deleted)
(5,306 missing values generated)
(16,602 missing values generated)
(30,733 missing values generated)
(30,290 real changes made, 30,290 to missing)
(54,515 real changes made, 54,515 to missing)
(62,519 real changes made, 62,519 to missing)
(65,804 observations (episodes) created)
(covid_tpp_prob: 65804 changes made)
(30,394 observations (episodes) created)
(covid_tpp_prob: 30394 changes made)
(8,469 observations (episodes) created)
(covid_tpp_prob: 8469 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    101,721       49.29       49.29
          2 |     65,804       31.88       81.17
          3 |     30,394       14.73       95.90
          4 |      8,469        4.10      100.00
------------+-----------------------------------
      Total |    206,388      100.00
(197,919 observations deleted)
  3,155

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      8,361      515995           0     515995     515995

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
*****
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(29,518 observations deleted)
  21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         83        6650           0       6650       6650

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(39,601 observations deleted)
  24

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         49        5571           0       5571       5571

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(49,796 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         17        1591           0       1591       1591

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(55,850 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          6         369           0        369        369

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(29,518 observations deleted)
  51

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        254       21032           0      21032      21032

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(39,601 observations deleted)
  59

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        163       16052           0      16052      16052

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(49,796 observations deleted)
  15

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         65        6355           0       6355       6355

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(55,850 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         24        1354           0       1354       1354

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(29,518 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         57        4854           0       4854       4854

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(39,601 observations deleted)
  7

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         33        3222           0       3222       3222

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(49,796 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         11         801           0        801        801

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(55,850 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          2         154           0        154        154

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(29,518 observations deleted)
  5,392

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     28,343     2480370           0    2480370    2480370

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(39,601 observations deleted)
  5,446

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     18,409     1962726           0    1962726    1962726

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(49,796 observations deleted)
  3,014

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      8,366      726406           0     726406     726406

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(0 real changes made)
(0 real changes made)
(1,480 observations deleted)
(0 observations deleted)
(0 observations deleted)
(752 real changes made)
(8,122 real changes made)
(8,122 real changes made, 8,122 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     28,741  total observations
          4  observations end on or before enter()
------------------------------------------------------------------------------
     28,737  observations remaining, representing
     28,737  subjects
     14,965  failures in single-failure-per-subject data
  5,385,053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       428
(4 observations deleted)
(1,543 missing values generated)
(4,762 missing values generated)
(8,752 missing values generated)
(8,460 real changes made, 8,460 to missing)
(15,469 real changes made, 15,469 to missing)
(17,580 real changes made, 17,580 to missing)
(18,654 observations (episodes) created)
(covid_tpp_prob: 18654 changes made)
(8,459 observations (episodes) created)
(covid_tpp_prob: 8459 changes made)
(2,405 observations (episodes) created)
(covid_tpp_prob: 2405 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     28,737       49.33       49.33
          2 |     18,654       32.02       81.35
          3 |      8,459       14.52       95.87
          4 |      2,405        4.13      100.00
------------+-----------------------------------
      Total |     58,255      100.00
(55,850 observations deleted)
  899

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      2,373      147546           0     147546     147546

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
*****

. file write tablecontents_int _n

. 
. file close tablecontents_int

. 
. postclose HRestimates_int

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/11c_an_interaction_HR_tables_forest_covid_tpp_prob
> _vaccine_child_prevacc.log
  log type:  text
 closed on:  15 Mar 2023, 14:52:44
-------------------------------------------------------------------------------
