-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11d_an_interaction_HR_tables_forest_covidadmission
> _vaccine_child_postvacc.log
  log type:  text
 opened on:  15 Mar 2023, 14:56:13

. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents_int ("age") _tab ("exposure") _tab ("exposure lev
> el") ///
> _tab ("outcome") _tab ("int_type") _tab ("int_level") ///
> _tab ("events") _tab ("person_years") _tab ("rate") ///
> _tab ("HR")  _tab ("lci")  _tab ("uci") _tab ("pval") _n
  3. foreach x in 0 1 {
  4. forvalues i=`min'/`max'{
  5. foreach int_type in vaccine {
  6. 
. foreach int_level in  1 2 3 4 {
  7. 
. local endwith "_tab"
  8. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_int ("`x'") _tab ("`variable'") _tab ("`i'")
>  _tab ("`outcome'") _tab ("`int_type'") _tab ("`int_level'") _tab
  9.  
.  use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", c
> lear
 10. 
. *create artificial start of follow-up for households in which not all childre
> n had been double-vaccinated
. gen all_under18vacc_postvacc_an = all_under18vacc
 11. replace all_under18vacc_postvacc_an = d(01oct2021) if all_child_vacc == 0 
> // may edit this date later on
 12. 
. *remove households with children not all of whom get double-vaccinated
. drop if all_child_vacc == 0 & num_child_eligible != 0
 13. 
. *Tidy vaccination data
. replace covid_vacc_second_dose_date = . if ///
>         covid_vacc_date == . | ///
>         covid_vacc_date >= covid_vacc_second_dose_date
 14. replace covid_vacc_third_dose_date = . if ///
>         covid_vacc_date == . | ///
>         covid_vacc_second_dose_date == . | ///
>         covid_vacc_third_dose_date <= covid_vacc_second_dose_date | ///
>         covid_vacc_third_dose_date <= covid_vacc_date
 15. drop if covid_vacc_date<d(20dec2020)
 16. drop if covid_vacc_second_dose_date<d(20dec2020)
 17. drop if covid_vacc_third_dose_date<=d(20dec2020)
 18. 
. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 19. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 20. gen third_vacc_plus_7d = covid_vacc_third_dose_date+7
 21. format first_vacc_plus_7d second_vacc_plus_7d third_vacc_plus_7d %td
 22. 
. *Drop individuals who died before date by which all children aged 12-17 were 
> vaccinated
. drop if died_date_ons <= all_under18vacc_postvacc_an
 23. 
. *Drop those without any eligible follow-up
. drop if stime_`outcome' <= all_under18vacc_postvacc_an
 24. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 25. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 26. replace third_vacc_plus_7d=. if third_vacc_plus_7d>=stime_`outcome'
 27. 
. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(all_under18vacc_postvacc_an) origin(all_under18v
> acc_postvacc_an)
 28. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 29. recode `outcome' .=0 
 30. stsplit split2, after(second_vacc_plus_7d) at(0)
 31. recode `outcome' .=0 
 32. stsplit split3, after(third_vacc_plus_7d) at(0)
 33. recode `outcome' .=0 
 34. foreach var of varlist covid_vacc*date {
 35.         replace `var' = . if `var' >= (stime_`outcome' - 7)
 36. }
 37. egen vaccine = rownonmiss(covid_vacc*date)
 38. replace vaccine = vaccine + 1 // add 1 as code is written so vaccine==1 is
>  no vaccine
 39. tab vaccine, miss
 40.         
.         
.         keep if vaccine==`int_level'
 41. *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 42.         local event = r(N)
 43.         gen fup=_t-_t0
 44.     bysort `variable': egen total_follow_up = total(fup)
 45.         su total_follow_up if `variable' == `i'
 46.         local person_days = r(mean)
 47.         local person_years=`person_days'/365.25
 48.         local rate = 100000*(`event'/`person_years')
 49. 
.         file write tablecontents_int (`event') _tab %10.0f (`person_years') _
> tab %3.2f (`rate') _tab
 50.         
.         drop total_follow_up
 51.         foreach modeltype of any fulladj {
 52. 
.                 local noestimatesflag 0 /*reset*/
 53. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 54. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 55.                                 cap estimates use ./output/an_interaction_
> cox_models_`outcome'_kids_cat4_`int_type'_`x'_child_postvacc
 56.                 if _rc!=0 local noestimatesflag 1
 57.                                 }
 58.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0{
 59.                         if `int_level'==1 {
 60.                         cap lincom 1.vaccine+`i'.`variable'+ 1.vaccine#`i'
> .`variable', eform                    
 61.                         local pval=r(p)
 62.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab %4.2f (`pval') `endwith'
 63.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 64.                                 }
 65.                         if `int_level'==2 {
 66.                         cap lincom 2.vaccine+`i'.`variable'+ 2.vaccine#`i'
> .`variable', eform
 67.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 68.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 69.                                 }
 70.                 
.                         if `int_level'==3 {
 71.                         cap lincom 3.vaccine+`i'.`variable'+ 3.vaccine#`i'
> .`variable', eform
 72.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 73.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 74.                                 }
 75.                                 
.                         if `int_level'==4 {
 76.                         cap lincom 4.vaccine+`i'.`variable'+ 4.vaccine#`i'
> .`variable', eform
 77.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 78.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 79.                                 }
 80.                         }
 81.                         
.                         else file write tablecontents_int %4.2f ("DID NOT FIT
> ") `endwith'
 82. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 83.                         if "`modeltype'"=="fulladj" {
 84.                                 local hr = r(estimate)
 85.                                 local lb = r(lb)
 86.                                 local ub = r(ub)
 87.                                 cap gen `variable'=.
 88.                                 test 1.`int_type'#2.`variable' 1.`int_type
> '#1.`variable'
 89.                                 local pval=r(p)
 90.                                 post HRestimates_int ("`x'") ("`outcome'")
>  ("`variable'") ("`int_type'") (`i') (`int_level') (`hr') (`lb') (`ub') (`pva
> l')
 91.                                 drop `variable'
 92.                                 }
 93.                 }
 94.                 }
 95.                 } /*int_level*/
 96.                 } /*full adj*/
 97. 
. } /*variable levels*/
 98. di "*****"
 99. 
. }
100. end

. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. cap file close tablecontents_int

. file open tablecontents_int using ./output/11d_an_int_tab_contents_HRtable_`o
> utcome'_vaccine_child_postvacc.txt, t w replace
(note: file ./output/11d_an_int_tab_contents_HRtable_covidadmission_vaccine_chi
> ld_postvacc.txt not found)

. di "****"
****

. 
. 
. tempfile HRestimates_int

. cap postutil clear

. postfile HRestimates_int str10 x str10 outcome str27 variable str27 int_type 
> level int_level hr lci uci pval using `HRestimates_int'

. di "*****"
*****

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(6,355 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          2         183           0        183        183

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(5,250 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         22        1737           0       1737       1737

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(3,198 observations deleted)
  8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         91        6767           0       6767       6767

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(4,988 observations deleted)
  6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         53        4220           0       4220       4220

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(6,355 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         15        1795           0       1795       1795

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(5,250 observations deleted)
  8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         51        3313           0       3313       3313

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(3,198 observations deleted)
  32

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        265       19289           0      19289      19289

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(4,988 observations deleted)
  12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        145       10555           0      10555      10555

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(6,355 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          8        1173           0       1173       1173

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(5,250 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         33        2127           0       2127       2127

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(3,198 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         52        5330           0       5330       5330

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(4,988 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         20        1390           0       1390       1390

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(6,355 observations deleted)
  48

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        217       22870           0      22870      22870

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(5,250 observations deleted)
  126

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,241       70434           0      70434      70434

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(3,198 observations deleted)
  425

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      2,991      247085           0     247085     247085

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(1,610 observations deleted)
(0 real changes made)
(96 real changes made, 96 to missing)
(1,445 real changes made, 1,445 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      4,358  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,358  observations remaining, representing
      4,358  subjects
        848  failures in single-failure-per-subject data
    496,547  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(13 observations (episodes) created)
(covidadmission: 13 changes made)
(756 observations (episodes) created)
(covidadmission: 756 changes made)
(1,470 observations (episodes) created)
(covidadmission: 1470 changes made)
(13 real changes made, 13 to missing)
(869 real changes made, 869 to missing)
(3,532 real changes made, 3,532 to missing)
(6,597 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        242        3.67        3.67
          2 |      1,347       20.42       24.09
          3 |      3,399       51.52       75.61
          4 |      1,609       24.39      100.00
------------+-----------------------------------
      Total |      6,597      100.00
(4,988 observations deleted)
  160

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,391       98279           0      98279      98279

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
*****
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(1,861 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          1         129           .        129        129

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(1,518 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          6         443           0        443        443

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(928 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         24        1683           0       1683       1683

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(1,447 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         11         995           0        995        995

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(1,861 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          4         427           0        427        427

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(1,518 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         18        1155           0       1155       1155

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(928 observations deleted)
  12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         70        5135           0       5135       5135

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(1,447 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         37        2806           0       2806       2806

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(1,861 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(1,518 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         10         261           0        261        261

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(928 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         11         875           0        875        875

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(1,447 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          5         342           0        342        342

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(1,861 observations deleted)
  8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         52        5596           0       5596       5596

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(1,518 observations deleted)
  27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        366       20911           0      20911      20911

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(928 observations deleted)
  133

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        885       72308           0      72308      72308

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(463 observations deleted)
(0 real changes made)
(23 real changes made, 23 to missing)
(385 real changes made, 385 to missing)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      1,239  total observations
          0  exclusions
------------------------------------------------------------------------------
      1,239  observations remaining, representing
      1,239  subjects
        259  failures in single-failure-per-subject data
    142,186  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covidadmission: 1 changes made)
(240 observations (episodes) created)
(covidadmission: 240 changes made)
(438 observations (episodes) created)
(covidadmission: 438 changes made)
(1 real change made, 1 to missing)
(265 real changes made, 265 to missing)
(1,018 real changes made, 1,018 to missing)
(1,918 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         57        2.97        2.97
          2 |        400       20.86       23.83
          3 |        990       51.62       75.44
          4 |        471       24.56      100.00
------------+-----------------------------------
      Total |      1,918      100.00
(1,447 observations deleted)
  61

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        418       29120           0      29120      29120

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
*****

. file write tablecontents_int _n

. 
. file close tablecontents_int

. 
. postclose HRestimates_int

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/11d_an_interaction_HR_tables_forest_covidadmission
> _vaccine_child_postvacc.log
  log type:  text
 closed on:  15 Mar 2023, 14:56:21
-------------------------------------------------------------------------------
