-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11d_an_interaction_HR_tables_forest_covid_tpp_prob
> _vaccine_child_postvacc.log
  log type:  text
 opened on:  15 Mar 2023, 14:55:22

. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents_int ("age") _tab ("exposure") _tab ("exposure lev
> el") ///
> _tab ("outcome") _tab ("int_type") _tab ("int_level") ///
> _tab ("events") _tab ("person_years") _tab ("rate") ///
> _tab ("HR")  _tab ("lci")  _tab ("uci") _tab ("pval") _n
  3. foreach x in 0 1 {
  4. forvalues i=`min'/`max'{
  5. foreach int_type in vaccine {
  6. 
. foreach int_level in  1 2 3 4 {
  7. 
. local endwith "_tab"
  8. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_int ("`x'") _tab ("`variable'") _tab ("`i'")
>  _tab ("`outcome'") _tab ("`int_type'") _tab ("`int_level'") _tab
  9.  
.  use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", c
> lear
 10. 
. *create artificial start of follow-up for households in which not all childre
> n had been double-vaccinated
. gen all_under18vacc_postvacc_an = all_under18vacc
 11. replace all_under18vacc_postvacc_an = d(01oct2021) if all_child_vacc == 0 
> // may edit this date later on
 12. 
. *remove households with children not all of whom get double-vaccinated
. drop if all_child_vacc == 0 & num_child_eligible != 0
 13. 
. *Tidy vaccination data
. replace covid_vacc_second_dose_date = . if ///
>         covid_vacc_date == . | ///
>         covid_vacc_date >= covid_vacc_second_dose_date
 14. replace covid_vacc_third_dose_date = . if ///
>         covid_vacc_date == . | ///
>         covid_vacc_second_dose_date == . | ///
>         covid_vacc_third_dose_date <= covid_vacc_second_dose_date | ///
>         covid_vacc_third_dose_date <= covid_vacc_date
 15. drop if covid_vacc_date<d(20dec2020)
 16. drop if covid_vacc_second_dose_date<d(20dec2020)
 17. drop if covid_vacc_third_dose_date<=d(20dec2020)
 18. 
. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 19. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 20. gen third_vacc_plus_7d = covid_vacc_third_dose_date+7
 21. format first_vacc_plus_7d second_vacc_plus_7d third_vacc_plus_7d %td
 22. 
. *Drop individuals who died before date by which all children aged 12-17 were 
> vaccinated
. drop if died_date_ons <= all_under18vacc_postvacc_an
 23. 
. *Drop those without any eligible follow-up
. drop if stime_`outcome' <= all_under18vacc_postvacc_an
 24. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 25. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 26. replace third_vacc_plus_7d=. if third_vacc_plus_7d>=stime_`outcome'
 27. 
. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(all_under18vacc_postvacc_an) origin(all_under18v
> acc_postvacc_an)
 28. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 29. recode `outcome' .=0 
 30. stsplit split2, after(second_vacc_plus_7d) at(0)
 31. recode `outcome' .=0 
 32. stsplit split3, after(third_vacc_plus_7d) at(0)
 33. recode `outcome' .=0 
 34. foreach var of varlist covid_vacc*date {
 35.         replace `var' = . if `var' >= (stime_`outcome' - 7)
 36. }
 37. egen vaccine = rownonmiss(covid_vacc*date)
 38. replace vaccine = vaccine + 1 // add 1 as code is written so vaccine==1 is
>  no vaccine
 39. tab vaccine, miss
 40.         
.         
.         keep if vaccine==`int_level'
 41. *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 42.         local event = r(N)
 43.         gen fup=_t-_t0
 44.     bysort `variable': egen total_follow_up = total(fup)
 45.         su total_follow_up if `variable' == `i'
 46.         local person_days = r(mean)
 47.         local person_years=`person_days'/365.25
 48.         local rate = 100000*(`event'/`person_years')
 49. 
.         file write tablecontents_int (`event') _tab %10.0f (`person_years') _
> tab %3.2f (`rate') _tab
 50.         
.         drop total_follow_up
 51.         foreach modeltype of any fulladj {
 52. 
.                 local noestimatesflag 0 /*reset*/
 53. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 54. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 55.                                 cap estimates use ./output/an_interaction_
> cox_models_`outcome'_kids_cat4_`int_type'_`x'_child_postvacc
 56.                 if _rc!=0 local noestimatesflag 1
 57.                                 }
 58.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0{
 59.                         if `int_level'==1 {
 60.                         cap lincom 1.vaccine+`i'.`variable'+ 1.vaccine#`i'
> .`variable', eform                    
 61.                         local pval=r(p)
 62.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab %4.2f (`pval') `endwith'
 63.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 64.                                 }
 65.                         if `int_level'==2 {
 66.                         cap lincom 2.vaccine+`i'.`variable'+ 2.vaccine#`i'
> .`variable', eform
 67.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 68.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 69.                                 }
 70.                 
.                         if `int_level'==3 {
 71.                         cap lincom 3.vaccine+`i'.`variable'+ 3.vaccine#`i'
> .`variable', eform
 72.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 73.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 74.                                 }
 75.                                 
.                         if `int_level'==4 {
 76.                         cap lincom 4.vaccine+`i'.`variable'+ 4.vaccine#`i'
> .`variable', eform
 77.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 78.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 79.                                 }
 80.                         }
 81.                         
.                         else file write tablecontents_int %4.2f ("DID NOT FIT
> ") `endwith'
 82. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 83.                         if "`modeltype'"=="fulladj" {
 84.                                 local hr = r(estimate)
 85.                                 local lb = r(lb)
 86.                                 local ub = r(ub)
 87.                                 cap gen `variable'=.
 88.                                 test 1.`int_type'#2.`variable' 1.`int_type
> '#1.`variable'
 89.                                 local pval=r(p)
 90.                                 post HRestimates_int ("`x'") ("`outcome'")
>  ("`variable'") ("`int_type'") (`i') (`int_level') (`hr') (`lb') (`ub') (`pva
> l')
 91.                                 drop `variable'
 92.                                 }
 93.                 }
 94.                 }
 95.                 } /*int_level*/
 96.                 } /*full adj*/
 97. 
. } /*variable levels*/
 98. di "*****"
 99. 
. }
100. end

. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. cap file close tablecontents_int

. file open tablecontents_int using ./output/11d_an_int_tab_contents_HRtable_`o
> utcome'_vaccine_child_postvacc.txt, t w replace
(note: file ./output/11d_an_int_tab_contents_HRtable_covid_tpp_prob_vaccine_chi
> ld_postvacc.txt not found)

. di "****"
****

. 
. 
. tempfile HRestimates_int

. cap postutil clear

. postfile HRestimates_int str10 x str10 outcome str27 variable str27 int_type 
> level int_level hr lci uci pval using `HRestimates_int'

. di "*****"
*****

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(4,244 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          3         167           0        167        167

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(3,436 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          5         562           0        562        562

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(2,076 observations deleted)
  26

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         60        3276           0       3276       3276

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(3,501 observations deleted)
  14

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         33        2241           0       2241       2241

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(4,244 observations deleted)
  7

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         11         792           0        792        792

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(3,436 observations deleted)
  16

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         35        1656           0       1656       1656

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(2,076 observations deleted)
  73

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        175       10243           0      10243      10243

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(3,501 observations deleted)
  40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         73        4705           0       4705       4705

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(4,244 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          5         601           0        601        601

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(3,436 observations deleted)
  8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         24        1408           0       1408       1408

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(2,076 observations deleted)
  20

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         37        3066           0       3066       3066

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(3,501 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         12         960           0        960        960

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(4,244 observations deleted)
  104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        156       13144           0      13144      13144

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(3,436 observations deleted)
  265

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        919       44818           0      44818      44818

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(2,076 observations deleted)
  943

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      2,071      149060           0     149060     149060

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(97,607 missing values generated)
(97,607 real changes made)
(96,334 observations deleted)
(0 real changes made)
(0 real changes made)
(553 observations deleted)
(0 observations deleted)
(0 observations deleted)
(558 missing values generated)
(1,719 missing values generated)
(3,107 missing values generated)
(4,383 observations deleted)
(2,931 observations deleted)
(0 real changes made)
(89 real changes made, 89 to missing)
(1,197 real changes made, 1,197 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
      3,037  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,037  observations remaining, representing
      3,037  subjects
      1,878  failures in single-failure-per-subject data
    288,653  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       263
(8 observations (episodes) created)
(covid_tpp_prob: 8 changes made)
(547 observations (episodes) created)
(covid_tpp_prob: 547 changes made)
(827 observations (episodes) created)
(covid_tpp_prob: 827 changes made)
(8 real changes made, 8 to missing)
(648 real changes made, 648 to missing)
(2,472 real changes made, 2,472 to missing)
(4,419 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        175        3.96        3.96
          2 |        983       22.24       26.21
          3 |      2,343       53.02       79.23
          4 |        918       20.77      100.00
------------+-----------------------------------
      Total |      4,419      100.00
(3,501 observations deleted)
  354

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        800       51954           0      51954      51954

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
*****
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(1,186 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(948 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          1          17           .         17         17

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(574 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         14         670           0        670        670

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(961 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          5         326           0        326        326

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(1,186 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          2         116           0        116        116

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(948 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         11         411           0        411        411

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(574 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         40        3327           0       3327       3327

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(961 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         22        1291           0       1291       1291

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(1,186 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(948 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          8         309           0        309        309

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(574 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          9        1054           0       1054       1054

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(961 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          2          96           0         96         96

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(1,186 observations deleted)
  20

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         35        3539           0       3539       3539

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(948 observations deleted)
  76

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        255       10831           0      10831      10831

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(574 observations deleted)
  244

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        586       41825           0      41825      41825

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(27,538 missing values generated)
(27,538 real changes made)
(27,185 observations deleted)
(0 real changes made)
(0 real changes made)
(156 observations deleted)
(0 observations deleted)
(0 observations deleted)
(149 missing values generated)
(484 missing values generated)
(894 missing values generated)
(1,178 observations deleted)
(884 observations deleted)
(0 real changes made)
(30 real changes made, 30 to missing)
(310 real changes made, 310 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time all_under18vacc_postvacc_an
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time all_under18vacc_postvacc_an

------------------------------------------------------------------------------
        818  total observations
          0  exclusions
------------------------------------------------------------------------------
        818  observations remaining, representing
        818  subjects
        498  failures in single-failure-per-subject data
     77,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       255
(1 observation (episode) created)
(covid_tpp_prob: 1 changes made)
(163 observations (episodes) created)
(covid_tpp_prob: 163 changes made)
(241 observations (episodes) created)
(covid_tpp_prob: 241 changes made)
(1 real change made, 1 to missing)
(196 real changes made, 196 to missing)
(681 real changes made, 681 to missing)
(1,223 real changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         37        3.03        3.03
          2 |        275       22.49       25.51
          3 |        649       53.07       78.58
          4 |        262       21.42      100.00
------------+-----------------------------------
      Total |      1,223      100.00
(961 observations deleted)
  112

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        233       13231           0      13231      13231

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
*****

. file write tablecontents_int _n

. 
. file close tablecontents_int

. 
. postclose HRestimates_int

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/11d_an_interaction_HR_tables_forest_covid_tpp_prob
> _vaccine_child_postvacc.log
  log type:  text
 closed on:  15 Mar 2023, 14:55:29
-------------------------------------------------------------------------------
