-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/comorbidity.log
  log type:  text
 opened on:  21 Mar 2023, 10:32:59

. 
. *1-year lookback period
. import delimited "output/input_comorbidity", clear
(25 vars, 200,000 obs)

. tab stroke_gp stroke_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |      stroke_hosp
 stroke_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,984     32,016 |   160,000 
           |     79.99      20.01 |    100.00 
           |     79.99      80.04 |     80.00 
-----------+----------------------+----------
         1 |    32,016      7,984 |    40,000 
           |     80.04      19.96 |    100.00 
           |     20.01      19.96 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab mi_gp mi_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        mi_hosp
     mi_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,086     31,914 |   160,000 
           |     80.05      19.95 |    100.00 
           |     80.05      79.78 |     80.00 
-----------+----------------------+----------
         1 |    31,914      8,086 |    40,000 
           |     79.78      20.21 |    100.00 
           |     19.95      20.21 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab hf_gp hf_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        hf_hosp
     hf_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,002     31,998 |   160,000 
           |     80.00      20.00 |    100.00 
           |     80.00      80.00 |     80.00 
-----------+----------------------+----------
         1 |    31,998      8,002 |    40,000 
           |     80.00      20.00 |    100.00 
           |     20.00      20.00 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab hypertension_gp hypertension_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

hypertensi |   hypertension_hosp
     on_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,925     32,075 |   160,000 
           |     79.95      20.05 |    100.00 
           |     79.95      80.19 |     80.00 
-----------+----------------------+----------
         1 |    32,075      7,925 |    40,000 
           |     80.19      19.81 |    100.00 
           |     20.05      19.81 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab obesity_gp obesity_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |     obesity_hosp
obesity_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,914     32,086 |   160,000 
           |     79.95      20.05 |    100.00 
           |     79.95      80.22 |     80.00 
-----------+----------------------+----------
         1 |    32,086      7,914 |    40,000 
           |     80.22      19.79 |    100.00 
           |     20.05      19.79 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab diabetes_gp diabetes_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

diabetes_g |     diabetes_hosp
         p |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,995     32,005 |   160,000 
           |     80.00      20.00 |    100.00 
           |     80.00      80.01 |     80.00 
-----------+----------------------+----------
         1 |    32,005      7,995 |    40,000 
           |     80.01      19.99 |    100.00 
           |     20.00      19.99 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab asthma_gp asthma_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |      asthma_hosp
 asthma_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,095     31,905 |   160,000 
           |     80.06      19.94 |    100.00 
           |     80.06      79.76 |     80.00 
-----------+----------------------+----------
         1 |    31,905      8,095 |    40,000 
           |     79.76      20.24 |    100.00 
           |     19.94      20.24 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab lung_cancer_gp lung_cancer_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

lung_cance |   lung_cancer_hosp
      r_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,936     32,064 |   160,000 
           |     79.96      20.04 |    100.00 
           |     79.96      80.16 |     80.00 
-----------+----------------------+----------
         1 |    32,064      7,936 |    40,000 
           |     80.16      19.84 |    100.00 
           |     20.04      19.84 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab hypothyroidism_gp hypothyroidism_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

hypothyroi |  hypothyroidism_hosp
   dism_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,119     31,881 |   160,000 
           |     80.07      19.93 |    100.00 
           |     80.07      79.70 |     80.00 
-----------+----------------------+----------
         1 |    31,881      8,119 |    40,000 
           |     79.70      20.30 |    100.00 
           |     19.93      20.30 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab depression_gp depression_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

depression |    depression_hosp
       _gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,091     31,909 |   160,000 
           |     80.06      19.94 |    100.00 
           |     80.06      79.77 |     80.00 
-----------+----------------------+----------
         1 |    31,909      8,091 |    40,000 
           |     79.77      20.23 |    100.00 
           |     19.94      20.23 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab epilepsy_gp epilepsy_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

epilepsy_g |     epilepsy_hosp
         p |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,888     32,112 |   160,000 
           |     79.93      20.07 |    100.00 
           |     79.93      80.28 |     80.00 
-----------+----------------------+----------
         1 |    32,112      7,888 |    40,000 
           |     80.28      19.72 |    100.00 
           |     20.07      19.72 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab dementia_gp dementia_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

dementia_g |     dementia_hosp
         p |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,046     31,954 |   160,000 
           |     80.03      19.97 |    100.00 
           |     80.03      79.88 |     80.00 
-----------+----------------------+----------
         1 |    31,954      8,046 |    40,000 
           |     79.88      20.11 |    100.00 
           |     19.97      20.11 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. *5-year lookback period
. import delimited "output/input_comorbidity_5y", clear
(25 vars, 200,000 obs)

. tab stroke_gp stroke_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |      stroke_hosp
 stroke_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,160     31,840 |   160,000 
           |     80.10      19.90 |    100.00 
           |     80.10      79.60 |     80.00 
-----------+----------------------+----------
         1 |    31,840      8,160 |    40,000 
           |     79.60      20.40 |    100.00 
           |     19.90      20.40 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab mi_gp mi_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        mi_hosp
     mi_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,028     31,972 |   160,000 
           |     80.02      19.98 |    100.00 
           |     80.02      79.93 |     80.00 
-----------+----------------------+----------
         1 |    31,972      8,028 |    40,000 
           |     79.93      20.07 |    100.00 
           |     19.98      20.07 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab hf_gp hf_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        hf_hosp
     hf_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,983     32,017 |   160,000 
           |     79.99      20.01 |    100.00 
           |     79.99      80.04 |     80.00 
-----------+----------------------+----------
         1 |    32,017      7,983 |    40,000 
           |     80.04      19.96 |    100.00 
           |     20.01      19.96 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab hypertension_gp hypertension_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

hypertensi |   hypertension_hosp
     on_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,048     31,952 |   160,000 
           |     80.03      19.97 |    100.00 
           |     80.03      79.88 |     80.00 
-----------+----------------------+----------
         1 |    31,952      8,048 |    40,000 
           |     79.88      20.12 |    100.00 
           |     19.97      20.12 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab obesity_gp obesity_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |     obesity_hosp
obesity_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,000     32,000 |   160,000 
           |     80.00      20.00 |    100.00 
           |     80.00      80.00 |     80.00 
-----------+----------------------+----------
         1 |    32,000      8,000 |    40,000 
           |     80.00      20.00 |    100.00 
           |     20.00      20.00 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab diabetes_gp diabetes_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

diabetes_g |     diabetes_hosp
         p |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,014     31,986 |   160,000 
           |     80.01      19.99 |    100.00 
           |     80.01      79.97 |     80.00 
-----------+----------------------+----------
         1 |    31,986      8,014 |    40,000 
           |     79.97      20.04 |    100.00 
           |     19.99      20.04 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab asthma_gp asthma_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |      asthma_hosp
 asthma_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,908     32,092 |   160,000 
           |     79.94      20.06 |    100.00 
           |     79.94      80.23 |     80.00 
-----------+----------------------+----------
         1 |    32,092      7,908 |    40,000 
           |     80.23      19.77 |    100.00 
           |     20.06      19.77 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab lung_cancer_gp lung_cancer_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

lung_cance |   lung_cancer_hosp
      r_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,249     31,751 |   160,000 
           |     80.16      19.84 |    100.00 
           |     80.16      79.38 |     80.00 
-----------+----------------------+----------
         1 |    31,751      8,249 |    40,000 
           |     79.38      20.62 |    100.00 
           |     19.84      20.62 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab hypothyroidism_gp hypothyroidism_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

hypothyroi |  hypothyroidism_hosp
   dism_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,949     32,051 |   160,000 
           |     79.97      20.03 |    100.00 
           |     79.97      80.13 |     80.00 
-----------+----------------------+----------
         1 |    32,051      7,949 |    40,000 
           |     80.13      19.87 |    100.00 
           |     20.03      19.87 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab depression_gp depression_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

depression |    depression_hosp
       _gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,061     31,939 |   160,000 
           |     80.04      19.96 |    100.00 
           |     80.04      79.85 |     80.00 
-----------+----------------------+----------
         1 |    31,939      8,061 |    40,000 
           |     79.85      20.15 |    100.00 
           |     19.96      20.15 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab epilepsy_gp epilepsy_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

epilepsy_g |     epilepsy_hosp
         p |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,041     31,959 |   160,000 
           |     80.03      19.97 |    100.00 
           |     80.03      79.90 |     80.00 
-----------+----------------------+----------
         1 |    31,959      8,041 |    40,000 
           |     79.90      20.10 |    100.00 
           |     19.97      20.10 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab dementia_gp dementia_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

dementia_g |     dementia_hosp
         p |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,946     32,054 |   160,000 
           |     79.97      20.03 |    100.00 
           |     79.97      80.14 |     80.00 
-----------+----------------------+----------
         1 |    32,054      7,946 |    40,000 
           |     80.14      19.86 |    100.00 
           |     20.03      19.86 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. *close log file
. log close
      name:  <unnamed>
       log:  /workspace/logs/comorbidity.log
  log type:  text
 closed on:  21 Mar 2023, 10:33:01
-------------------------------------------------------------------------------
