-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/comorbidity.log
  log type:  text
 opened on:  17 Mar 2023, 09:37:22

. import delimited "output/input_comorbidity", clear
(25 vars, 200,000 obs)

. tab stroke_gp stroke_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |      stroke_hosp
 stroke_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,982     32,018 |   160,000 
           |     79.99      20.01 |    100.00 
           |     79.99      80.05 |     80.00 
-----------+----------------------+----------
         1 |    32,018      7,982 |    40,000 
           |     80.05      19.96 |    100.00 
           |     20.01      19.96 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab mi_gp mi_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        mi_hosp
     mi_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,969     32,031 |   160,000 
           |     79.98      20.02 |    100.00 
           |     79.98      80.08 |     80.00 
-----------+----------------------+----------
         1 |    32,031      7,969 |    40,000 
           |     80.08      19.92 |    100.00 
           |     20.02      19.92 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab hf_gp hf_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        hf_hosp
     hf_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,027     31,973 |   160,000 
           |     80.02      19.98 |    100.00 
           |     80.02      79.93 |     80.00 
-----------+----------------------+----------
         1 |    31,973      8,027 |    40,000 
           |     79.93      20.07 |    100.00 
           |     19.98      20.07 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab hypertension_gp hypertension_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

hypertensi |   hypertension_hosp
     on_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,972     32,028 |   160,000 
           |     79.98      20.02 |    100.00 
           |     79.98      80.07 |     80.00 
-----------+----------------------+----------
         1 |    32,028      7,972 |    40,000 
           |     80.07      19.93 |    100.00 
           |     20.02      19.93 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab obesity_gp obesity_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |     obesity_hosp
obesity_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,124     31,876 |   160,000 
           |     80.08      19.92 |    100.00 
           |     80.08      79.69 |     80.00 
-----------+----------------------+----------
         1 |    31,876      8,124 |    40,000 
           |     79.69      20.31 |    100.00 
           |     19.92      20.31 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab diabetes_gp diabetes_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

diabetes_g |     diabetes_hosp
         p |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,957     32,043 |   160,000 
           |     79.97      20.03 |    100.00 
           |     79.97      80.11 |     80.00 
-----------+----------------------+----------
         1 |    32,043      7,957 |    40,000 
           |     80.11      19.89 |    100.00 
           |     20.03      19.89 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab asthma_gp asthma_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |      asthma_hosp
 asthma_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,989     32,011 |   160,000 
           |     79.99      20.01 |    100.00 
           |     79.99      80.03 |     80.00 
-----------+----------------------+----------
         1 |    32,011      7,989 |    40,000 
           |     80.03      19.97 |    100.00 
           |     20.01      19.97 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab lung_cancer_gp lung_cancer_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

lung_cance |   lung_cancer_hosp
      r_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,077     31,923 |   160,000 
           |     80.05      19.95 |    100.00 
           |     80.05      79.81 |     80.00 
-----------+----------------------+----------
         1 |    31,923      8,077 |    40,000 
           |     79.81      20.19 |    100.00 
           |     19.95      20.19 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab hypothyroidism_gp hypothyroidism_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

hypothyroi |  hypothyroidism_hosp
   dism_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,962     32,038 |   160,000 
           |     79.98      20.02 |    100.00 
           |     79.98      80.09 |     80.00 
-----------+----------------------+----------
         1 |    32,038      7,962 |    40,000 
           |     80.09      19.91 |    100.00 
           |     20.02      19.91 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab depression_gp depression_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

depression |    depression_hosp
       _gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,050     31,950 |   160,000 
           |     80.03      19.97 |    100.00 
           |     80.03      79.88 |     80.00 
-----------+----------------------+----------
         1 |    31,950      8,050 |    40,000 
           |     79.88      20.12 |    100.00 
           |     19.97      20.12 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab epilepsy_gp epilepsy_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

epilepsy_g |     epilepsy_hosp
         p |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,958     32,042 |   160,000 
           |     79.97      20.03 |    100.00 
           |     79.97      80.11 |     80.00 
-----------+----------------------+----------
         1 |    32,042      7,958 |    40,000 
           |     80.11      19.89 |    100.00 
           |     20.03      19.89 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab dementia_gp dementia_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

dementia_g |     dementia_hosp
         p |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,951     32,049 |   160,000 
           |     79.97      20.03 |    100.00 
           |     79.97      80.12 |     80.00 
-----------+----------------------+----------
         1 |    32,049      7,951 |    40,000 
           |     80.12      19.88 |    100.00 
           |     20.03      19.88 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. log close
      name:  <unnamed>
       log:  /workspace/logs/comorbidity.log
  log type:  text
 closed on:  17 Mar 2023, 09:37:23
-------------------------------------------------------------------------------
