-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/comorbidity.log
  log type:  text
 opened on:  17 Mar 2023, 11:53:37

. import delimited "output/input_comorbidity", clear
(25 vars, 200,000 obs)

. tab stroke_gp stroke_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |      stroke_hosp
 stroke_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,046     31,954 |   160,000 
           |     80.03      19.97 |    100.00 
           |     80.03      79.88 |     80.00 
-----------+----------------------+----------
         1 |    31,954      8,046 |    40,000 
           |     79.88      20.11 |    100.00 
           |     19.97      20.11 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab mi_gp mi_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        mi_hosp
     mi_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,012     31,988 |   160,000 
           |     80.01      19.99 |    100.00 
           |     80.01      79.97 |     80.00 
-----------+----------------------+----------
         1 |    31,988      8,012 |    40,000 
           |     79.97      20.03 |    100.00 
           |     19.99      20.03 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab hf_gp hf_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        hf_hosp
     hf_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,958     32,042 |   160,000 
           |     79.97      20.03 |    100.00 
           |     79.97      80.11 |     80.00 
-----------+----------------------+----------
         1 |    32,042      7,958 |    40,000 
           |     80.11      19.89 |    100.00 
           |     20.03      19.89 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab hypertension_gp hypertension_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

hypertensi |   hypertension_hosp
     on_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,954     32,046 |   160,000 
           |     79.97      20.03 |    100.00 
           |     79.97      80.12 |     80.00 
-----------+----------------------+----------
         1 |    32,046      7,954 |    40,000 
           |     80.12      19.89 |    100.00 
           |     20.03      19.89 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab obesity_gp obesity_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |     obesity_hosp
obesity_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,995     32,005 |   160,000 
           |     80.00      20.00 |    100.00 
           |     80.00      80.01 |     80.00 
-----------+----------------------+----------
         1 |    32,005      7,995 |    40,000 
           |     80.01      19.99 |    100.00 
           |     20.00      19.99 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab diabetes_gp diabetes_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

diabetes_g |     diabetes_hosp
         p |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,903     32,097 |   160,000 
           |     79.94      20.06 |    100.00 
           |     79.94      80.24 |     80.00 
-----------+----------------------+----------
         1 |    32,097      7,903 |    40,000 
           |     80.24      19.76 |    100.00 
           |     20.06      19.76 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab asthma_gp asthma_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |      asthma_hosp
 asthma_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,083     31,917 |   160,000 
           |     80.05      19.95 |    100.00 
           |     80.05      79.79 |     80.00 
-----------+----------------------+----------
         1 |    31,917      8,083 |    40,000 
           |     79.79      20.21 |    100.00 
           |     19.95      20.21 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab lung_cancer_gp lung_cancer_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

lung_cance |   lung_cancer_hosp
      r_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,043     31,957 |   160,000 
           |     80.03      19.97 |    100.00 
           |     80.03      79.89 |     80.00 
-----------+----------------------+----------
         1 |    31,957      8,043 |    40,000 
           |     79.89      20.11 |    100.00 
           |     19.97      20.11 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab hypothyroidism_gp hypothyroidism_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

hypothyroi |  hypothyroidism_hosp
   dism_gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,161     31,839 |   160,000 
           |     80.10      19.90 |    100.00 
           |     80.10      79.60 |     80.00 
-----------+----------------------+----------
         1 |    31,839      8,161 |    40,000 
           |     79.60      20.40 |    100.00 
           |     19.90      20.40 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab depression_gp depression_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

depression |    depression_hosp
       _gp |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,979     32,021 |   160,000 
           |     79.99      20.01 |    100.00 
           |     79.99      80.05 |     80.00 
-----------+----------------------+----------
         1 |    32,021      7,979 |    40,000 
           |     80.05      19.95 |    100.00 
           |     20.01      19.95 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab epilepsy_gp epilepsy_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

epilepsy_g |     epilepsy_hosp
         p |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,979     32,021 |   160,000 
           |     79.99      20.01 |    100.00 
           |     79.99      80.05 |     80.00 
-----------+----------------------+----------
         1 |    32,021      7,979 |    40,000 
           |     80.05      19.95 |    100.00 
           |     20.01      19.95 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. tab dementia_gp dementia_hosp, row col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

dementia_g |     dementia_hosp
         p |         0          1 |     Total
-----------+----------------------+----------
         0 |   128,050     31,950 |   160,000 
           |     80.03      19.97 |    100.00 
           |     80.03      79.88 |     80.00 
-----------+----------------------+----------
         1 |    31,950      8,050 |    40,000 
           |     79.88      20.12 |    100.00 
           |     19.97      20.12 |     20.00 
-----------+----------------------+----------
     Total |   160,000     40,000 |   200,000 
           |     80.00      20.00 |    100.00 
           |    100.00     100.00 |    100.00 

. log close
      name:  <unnamed>
       log:  /workspace/logs/comorbidity.log
  log type:  text
 closed on:  17 Mar 2023, 11:53:38
-------------------------------------------------------------------------------
